import 'package:avrodi_sharif/utils/tools/file_importer.dart';

class AboutPage extends StatelessWidget {
  const AboutPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SafeArea(
        child: SizedBox(
          height: height(context),
          width: width(context),
          child: Column(
            children: [
              GlobalAppBar(
                AppBarType.withSettingsAndPop,
                title: "Ушбу Авроди шариф",
              ),
              Expanded(
                child: ListView(
                  shrinkWrap: true,
                  children: [
                    Padding(
                        padding: EdgeInsets.symmetric(horizontal: 20.h),
                        child: SingleChildScrollView(
                          child: Text("""Ушбу авроди шариф....
   Бисмиллаҳир роҳманир роҳийм
Аллоҳ таолога сõзсиз хамду санолар, хазрати Расулуллоҳга чексз салоту саломлар бõлсин.
    Ушбу авроди шариф ер юзидаги энг шарафли энг ишончли дуо китобларидан ҳисобланади. Чунки у мйқаддас Қуръони карим оятлари ва энг сахих хадиси шарифлар асосида тузилган. 
ъЪАвродъъ ъъвирдъъ сòзининг кòплиги бòлиб, хар кун, доимий бажариб туриладиган вазифалар, дуолар деган манони билдиради.
 Ушбу Аврод қадимий тарихга эгадур. Уни, дастлаб, Мйҳаммад ибн Усома ( Усома ибн Зайд розияллоҳу анҳунинг òģиллари ) Исфахон шаҳрида тасниф этганлар. Таснифнинг ягона ва нодир қòлёзма нусхаси П 2177 рақами, ягона тошбосма нусхаси, Л 23240 - рақами остида ъЪАвроди Қуръония"/" Жавоҳир ул-Қурон деган ном билан Òзбекистон фанлар академияси Абу Райхон Беруний номидаги Шарқшунослик институти қòлёзмалар ҳазинасида сақланади (46-54 саҳифалар). Китоб Бухорода хижрий 1295, милодий 1878 йилда Амир Аркининг қорийси ва хаттоти Қорий Абдурраҳийм томонидан кòчирилган. (" Қашф уз-зунун" китобида бу тасниф "Ал-авроди саба" (" Етти кунлик видрлар ") деб аталиб, мусанниф аш-шайх аз-зоҳид Мухйиддин ибн Усома дейилган.) 
  Нақлга кòра, Муҳаммад ибн Усома бир вақт Ажам ( Исфахон шаҳри)да этиқодли бузуқ бир қавмнинг қòлига асир тушиб қоладилар. У кишини хибс этишади. Шунда у киши хазрати Пайģамбаримиз соллолоҳу алайҳи ва салламни тушида корадилар. Хазрати Росулуллоҳ; " Эй Ибн Усома! Бу холингдан ģамгин бòлма! Туриб, Мусхаф (Қуръонни карим)дан ҳафтанинг етти куни учун етти вирд (вазифа ва дуолар ) чиқаргин!" дейдилар.  Ибн усома етти кун учун қуръондан гулчин қилиб, ушбу видрларни чиқарадилар ва уни õқиб, хибсдан халос боладилар: 
1) Жума куни учун хамду сано оятлари; 
2) Шанба куни учун тавба-истигфор оятлари; 
3) Якшанба куни учун тасбех оятлари; 
4) Душанба куни учун таваккул ва хифзу химоят оятлари; 
5) Сешанба куни учун саломат ва шифо оятлари; 
6) Чоршанба куни учун таҳлил ("Ла илаҳа иллаллоҳ") оятлари; 
7) Пайшанба куни учун дуо оятлари..""",
                              style: AppTextStyles.labelLarge(context)),
                        ))
                  ],
                ),
              )
            ],
          ),
        ),
      ),
    );
  }
}
