import 'models/daily_zikr_arab_krill_model.dart';

List<List<DailyArabicRussianModel>> dailyData = [
  // Monday
  [
    DailyArabicRussianModel(arabic: """
اِذْ هَمَّتْ طَٓائِفَتَانِ مِنْكُمْ اَنْ تَفْشَلَاۙ وَاللّٰهُ وَلِيُّهُمَاۜ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ   ۝   وَلَقَدْ نَصَرَكُمُ اللّٰهُ بِبَدْرٍ وَاَنْتُمْ اَذِلَّةٌۚ فَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تَشْكُرُونَ   ۝ 
    """, russian: """
    Ўшанда, (Уҳуд ғазотида) сизлардан икки тоифа - Аллоҳ уларнинг мададкори бўлгани ҳолда - қўрқувга тушиб, (лашкарнинг икки қанотидан) орқага чекинишга ниятланган эди. Ҳолбуки, мўминлар фақатгина Аллоҳга таваккал қилмоқларини (ишониб-таянмоқлари) лозимдир. Муҳаққақки, Бадр (ғазоти)да сизлар (аскар ва қурол-яроқ жиҳатидан) заифроқ бўла туриб, Аллоҳ сизларга  ёрдам  бери (ва ғалаба  ато қилди). Бас, Аллоҳга тақво қилинглар - амрига мос яшанглар, токи шукр қилгувчи бўлинглар (3/Оли Имрон, 122-123).
    """),
    DailyArabicRussianModel(arabic: """
اِنْ يَنْصُرْكُمُ اللّٰهُ فَلَا غَالِبَ لَكُمْۚ وَاِنْ يَخْذُلْكُمْ فَمَنْ ذَا الَّذ۪ي يَنْصُرُكُمْ مِنْ بَعْدِه۪ۜ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ۝ 
    """, russian: """
    Агар Аллоҳ ёрдам берса, баски, сизларнинг устингиздан ғолиб келадиган ҳеч ким бўлмас. Агар (сизлар Аллоҳ ва Унинг Расулига боғлиқликдан узилиб) У сизларни ёрдамсиз қолдирса, ундан кейин сизларга ким ёрдам бера олур? Шундоқ экан, мўминлар фақат Аллоҳга таваккул қилсинлар (суяниб таянсизлар)  (3/Оли Имрон,  160).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّمَا الْمُؤْمِنُونَ الَّذ۪ينَ اِذَا ذُكِرَ اللّٰهُ وَجِلَتْ قُلُوبُهُمْ وَاِذَا تُلِيَتْ عَلَيْهِمْ اٰيَاتُهُ زَادَتْهُمْ ا۪يمَانًا وَعَلٰى رَبِّهِمْ يَتَوَكَّلُونَۚ ۝ 
    """, russian: """
    (Чин манодаги) мўминлар (фақат) ул кишилардирки, Аллоҳнинг номи зикр қилинган вақтда қалблари титрар,  Унинг оятлари уларга тиловат қилинган вақт (бу)  уларнинг иймон (нур)ларини зиёда қилур (қувватлантирур).  Ва (барча ишларида) ўз Раббига таваккул қилурлар-таяниб-суянурлар (8/Анфол, 2).
    """),
    DailyArabicRussianModel(arabic: """
    َلِلّٰهِ غَيْبُ السَّمٰوَاتِ وَالْاَرْضِ وَاِلَيْهِ يُرْجَعُ الْاَمْرُ كُلُّهُ فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِۜ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ ۝ 
    """, russian: """
    Осмонларнинг ва ернинг ғайби(ни билмоқ) Аллоҳга хосдир. Барча ишлар фақатгина Унга қайтарилур. У ҳолда Унга бандалик қилинг, Унга таваккул қилинг - таяниб - суянинг! Раббингиз қилаётган амалларингиздан асло беҳабар эмасдир (11/Ҳуд,  123).
    """),
    DailyArabicRussianModel(
        arabic: """اَلَّذ۪ينَ صَبَرُوا وَعَلٰى رَبِّهِمْ يَتَوَكَّلُونَ
    """,
        russian: """
    Улар (озор-азиятларга) сабр қилинглар ва ўз Раббингизга таваккул қиладиганлардир (16/Наҳл, 42).
    """),
    DailyArabicRussianModel(
        arabic: """وَتَوَكَّلْ عَلَى الْعَز۪يزِ الرَّح۪يمِۙ ۝""", russian: """
    Сиз (фақатгина) мутлақ ғолиб ва бениҳоят раҳимли Зот (бўлмиш Аллоҳ)га таваккул қилинг (26/Шуаро,  217).
    """),
    DailyArabicRussianModel(arabic: """
    فَتَوَكَّلْ عَلَى اللّٰهِۜ اِنَّكَ عَلَى الْحَقِّ الْمُب۪ينِ ۝ 
    """, russian: """
    (Эй Расулим!)  бу ҳолда сиз Аллоҳга таваккул қилинг - таяниб - суянинг!  Чунки сиз очиқ ҳақиқат узрадирсиз!  (27/Намл, 79).
    """),
    DailyArabicRussianModel(arabic: """
    وَتَوَكَّلْ عَلَى اللّٰهِۜ وَكَفٰى بِاللّٰهِ وَك۪يلًا ۝ 
    """, russian: """
    Аллоҳга таваккул қилинг! Вакийл ўлароқ Аллоҳ етарлидир! (33/Азҳоб, 3).
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۜ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ۝ 
    """, russian: """
    Аллоҳ шундай Зотки,  Ундан бошқа ҳеч бир илоҳ йўқдир.  Бас, мўминлар фақат Аллоҳга таваккул қилсинлар - таянсинлар (64/Тағобун, 13).
    """),
    DailyArabicRussianModel(arabic: """
    وَمَنْ يَتَّقِ اللّٰهَ يَجْعَلْ لَهُ مَخْرَجًاۙ ۝ وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُۜ وَمَنْ يَتَوَكَّلْ عَلَى اللّٰهِ فَهُوَ حَسْبُهُۜ اِنَّ اللّٰهَ بَالِغُ اَمْرِه۪ۜ قَدْ جَعَلَ اللّٰهُ لِكُلِّ شَيْءٍ قَدْرًا   ۝ 
    """, russian: """
    Ким Аллоҳга тақво қил(иб амалларига юр)са, (Аллоҳ)  уни бир (омонликка) чиқиш йўлини пайдо қилур. Уни ўзи ўйламаган томондан ризқлантириб қўюр. Ким Аллоҳга таваккул қилса -  таянса, У Зот унга етарлидир! Шубҳасизки, Аллоҳ Ўз ишини бажо келтиргувчидир! Аллоҳ ҳамма нарса учун бир ўлчов (бир чегара) муқаррар қилингандир (65/Талоқ, 2-3).
    """),
    DailyArabicRussianModel(arabic: """
    قُلْ هُوَ الرَّحْمٰنُ اٰمَنَّا بِه۪ وَعَلَيْهِ تَوَكَّلْنَاۚ فَسَتَعْلَمُونَ مَنْ هُوَ ف۪ي ضَلَالٍ مُب۪ينٍ  ۝   قُلْ اَرَاَيْتُمْ اِنْ اَصْبَحَ مَٓاؤُ۬كُمْ غَوْرًا فَمَنْ يَأْت۪يكُمْ بِمَٓاءٍ مَع۪ينٍ ۝  
    """, russian: """
    Айтинг: "У (Аллоҳ) Раҳмондир (дунёда барча махлуқотига  раҳм қилиб, немат бергувчидир). Биз Унга иймон келтирдик ва Унинг ўзига таваккул қилдик -  таяндик. Бас, ким очиқ гумроҳликда эканини яқинда билурсизлар! "Айтинг: сўзланглар-чи,  агар сувларингиз ер остига сингиб кетса,  ким сизларга оқар сувни (кашф этиб) келтира олур?! (Албатта, фақат Аллоҳ келтирур!)"  (67/Мулк, 29-30).
    """),
    DailyArabicRussianModel(arabic: """
    حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلٰوةِ الْوُسْطٰى وَقُومُوا لِلّٰهِ قَانِت۪ينَ ۝
    """, russian: """
    Намозларни ва (булар орасида) ўрта намозни (ғайрат билан) бардавом сақланглар;  Аллоҳнинг ҳузурида сидқидилдан бўйин эгган ҳолда (вақтга  ва арконга  риоя этиб) тўлиқ таслимият  билан туринглар (2/Бақара,  238).
    """),
    DailyArabicRussianModel(arabic: """
    وَالَّذ۪ينَ يُؤْمِنُونَ بِالْاٰخِرَةِ يُؤْمِنُونَ بِه۪ وَهُمْ عَلٰى صَلَاتِهِمْ يُحَافِظُونَ ۝ 

    """, russian: """
    Охиратга ишонганлар унга (Қуронга) ҳам ишонурлар ва улар намозларида бардавом бўлурлар (6/Аном, 92).
    """),
    DailyArabicRussianModel(arabic: """
    وَالْحَافِظُونَ لِحُدُودِ اللّٰهِۜ وَبَشِّرِ الْمُؤْمِن۪ينَ ۝ 
    """, russian: """
(У мўминлар) Аллоҳнинг чегараларини (белгилаган ҳукмларини) сақловчилардир. (Ана шундай) мўминларга (жаннатдан) хушхабар беринг! (9/Тавба, 112).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّ رَبّ۪ي عَلٰى كُلِّ شَيْءٍ حَف۪يظٌ ۝
    """, russian: """
    "Раббим ҳамма нарсани сақлаб (кузатиб) тургувчидир" (11/Ҳуд,  57).
    """),
    DailyArabicRussianModel(arabic: """
    وَاِنَّا لَهُ لَحَافِظُونَ ۝ 
    """, russian: """
"Ҳеч шубҳасиз,  биз уни жуда яхши сақлаб - қўриқлаймиз" (12/Юсуф, 12).
    """),
    DailyArabicRussianModel(arabic: """
    فَاللّٰهُ خَيْرٌ حَافِظًاۖ وَهُوَ اَرْحَمُ الرَّاحِم۪ينَ ۝ 
    """, russian: """
    "(Бирон бир кимса эмас) энг яхши муҳофаза қилгувчи Аллоҳдир.  Ва У раҳмлиларнинг энг раҳимлисидир" (12/Юсуф, 64).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَاِنَّا لَهُ لَحَافِظُونَ ۝ 
    """, russian: """
    Муҳаққақки, Зикрни  (Қуронни) Биз  нозил қилдик;  шубҳасиз, уни асрагувчи ҳам фақат билдирмиз (15/Ҳижр, 9).
    """),
    DailyArabicRussianModel(arabic: """
لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِه۪ يَحْفَظُونَهُ مِنْ اَمْرِ اللّٰهِۜ اِنَّ اللّٰهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتّٰى يُغَيِّرُوا مَا بِاَنْفُسِهِمْۜ وَاِذَٓا اَرَادَ اللّٰهُ بِقَوْمٍ سُٓوءًا فَلَا مَرَدَّ لَهُۚ وَمَا لَهُمْ مِنْ دُونِه۪ مِنْ وَالٍ ۝ 
    """, russian: """
    У (инсон фарзанди)нинг олдида орқасида тақиб этувчи (кузатувчи фаришталар) бордирки, Аллоҳнинг амри или уни муҳофаза қилурлар Муҳаққақки, бир қавм то ўзларини  (ички оламларини) ўзгартир(иб буз)магунича, Аллоҳ уларнинг аҳволларини ўзгартир(иб буз)мас. Аллоҳ (амирларидан юз ўгирмас) бир қавмга бир ёмонликни ирода қилса,  бас, уни орқага қайтариладиган йўқдир. Улар учун Ундан бошқа бир валий (асраб, ёрдам, қилувчи) йўқдир (13/Рад, 11)
    """),
    DailyArabicRussianModel(arabic: """
    وَجَعَلْنَا السَّمَٓاءَ سَقْفًا مَحْفُوظًاۚ وَهُمْ عَنْ اٰيَاتِهَا مُعْرِضُونَ ۝ 
    """, russian: """
Осмонни (қулаб тушишдан ва бузилишдан) муҳофаза этилган бир  шифт қилиб қўйдик. У (инкор этувчи)лар эса Унинг оят - аломатларидан  юз ўгирмоқдалар (21/Анбиё, 32). 
    """),
    DailyArabicRussianModel(arabic: """
    وَرَبُّكَ عَلٰى كُلِّ شَيْءٍ حَف۪يظٌ۟ ۝ 
    """, russian: """
    Раббингиз ҳар бир нарсани кузатиб - сақлаб тургувчидир ( 34/Саба, 21). 
    """),
    DailyArabicRussianModel(arabic: """
وَحِفْظًا مِنْ كُلِّ شَيْطَانٍ مَارِدٍۚ ۝     
    """, russian: """
    Ва (у осмонни) ҳар бир итоатдан чиққан саркаш шайтондан муҳофаза қилиб қўйдик (37/Соффат, 7).
    """),
    DailyArabicRussianModel(arabic: """
    وَزَيَّنَّا السَّمَٓاءَ الدُّنْيَا بِمَصَاب۪يحَۗ وَحِفْظًاۜ  ذٰلِكَ تَقْد۪يرُ الْعَز۪يزِ الْعَل۪يمِ ۝ 
    """, russian: """
    Биз дунё осмонини  (Ерга яқин осмонни) чироқлар билан зийнатладик ва (офатлардан) муҳофаза қилиб қўйдик. Бу мутлақ ғолиб - устун ва (ҳамма нарсани) ҳаққоний билгувчи Зот (Аллоҳ)нинг тақдиридир (41/Фуссилат,  12).
    """),
    DailyArabicRussianModel(arabic: """
    اِنْ كُلُّ نَفْسٍ لَمَّا عَلَيْهَا حَافِظٌۜ ۝ 
    """, russian: """
    Ҳеч бир жон йўқки,  унинг тепасида (уни кўриб кузатиб тургувчи) бир сақловчи -  муҳофиз  (фаришта) бўлмаса!  (86/Ториқ, 4).
    """),
    DailyArabicRussianModel(arabic: """
قُلْ لَنْ يُص۪يبَنَٓا اِلَّا مَا كَتَبَ اللّٰهُ لَنَاۚ هُوَ مَوْلٰينَاۚ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ۝   
    """, russian: """
    Айтингки:  "Аллоҳ биз учун (тақдирда) ёзганидан бошқа нарса бизга асло етмас. Бизнинг Мавломиз (Эгамиз, мададкор,  дўстимиз)дир. Шу боис мўминлар  фақат Аллоҳга таваккул  қилсинглар - суяниб - таянсинлар"  (9/Тавба, 51).
    """),
    DailyArabicRussianModel(arabic: """
    وَاِنْ يَمْسَسْكَ اللّٰهُ بِضُرٍّ فَلَا كَاشِفَ لَهُٓ اِلَّا هُوَۚ وَاِنْ يُرِدْكَ بِخَيْرٍ فَلَا رَٓادَّ لِفَضْلِه۪ۜ يُص۪يبُ بِه۪ مَنْ يَشَٓاءُ مِنْ عِبَادِه۪ۜ وَهُوَ الْغَفُورُ الرَّح۪يمُ ۝ 
    """, russian: """
    Агар Аллоҳ сенга бир зарар етказса, бас, Ўзидан бошқа даф этадиган (ҳеч бир куч) йўқ. Агар сенга бир яхшиликни раво кўрса, Унинг фазлу карамини орқага қайтарадиган ҳеч бир қувват ҳам йўқдир. У бандаларидан хоҳлаганини бунга эриштирур.  У беҳад мағфиратли,  бениҳоят раҳимлидир (10/Юнус, 107).
    """),
    DailyArabicRussianModel(arabic: """
    وَمَا مِنْ دَٓابَّةٍ فِي الْاَرْضِ اِلَّا عَلَى اللّٰهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَاۜ كُلٌّ ف۪ي كِتَابٍ مُب۪ينٍ ۝ 
    """, russian: """
    Ер юзида қимирлаган жон борки, унинг ризқи Аллоҳнинг зиммасидадир.  (Аллоҳ) уларнинг қарор топган жойларини ҳам,  омонат турадиган (вақтинча қоладиган ёки тупроққа топшириладиган) жойларини ҳам билур. Ҳаммаси очиқ  Китобда (Лавҳул - Маҳфузда мавжуд)дир  (11/Ҳуд, 6).
    """),
    DailyArabicRussianModel(arabic: """
    اِنّ۪ي تَوَكَّلْتُ عَلَى اللّٰهِ رَبّ۪ي وَرَبِّكُمْۜ مَا مِنْ دَٓابَّةٍ اِلَّا هُوَ اٰخِذٌ بِنَاصِيَتِهَاۜ اِنَّ رَبّ۪ي عَلٰى صِرَاطٍ مُسْتَق۪يمٍ ۝ 
    """, russian: """
(Ҳуд алайҳиссалом деди:) Шубҳасиз, мен - менинг ҳам Раббим,  сизнинг ҳам Раббингиз бўлган Аллоҳга таваккул қилдим -- суяниб - таяндим!  Ҳеч бир жонзот йўқки, У зот унинг манглайидан  тутган (уни  Ўз ҳукми ва иродаси остига олган) бўлмаса. Шубҳасиз, менинг Раббим тик-тўғри йўлдадир (У одилдир, ҳукм ва тасарруфида ҳаққоният узрадир, ҳеч кимга зулм ва ноҳақлик қилмас) (11/Ҳуд, 56).
"""),
    DailyArabicRussianModel(arabic: """
وَكَاَيِّنْ مِنْ دَٓابَّةٍ لَا تَحْمِلُ رِزْقَهَاۗ اَللّٰهُ يَرْزُقُهَا وَاِيَّاكُمْۘ وَهُوَ السَّم۪يعُ الْعَل۪يمُ ۝ 
    """, russian: """
    Қанча жонзод (махлуқ) борки,  ўз ризқини (ўзи) кўтара олмас. Уларга ҳам, сизларга ҳам Аллоҳ ризқ берур. У  ҳаққоний эшитгувчидир, билгувчидир  (29/Анкабут, 60).
    """),
    DailyArabicRussianModel(arabic: """
مَا يَفْتَحِ اللّٰهُ لِلنَّاسِ مِنْ رَحْمَةٍ فَلَا مُمْسِكَ لَهَاۚ وَمَا يُمْسِكْۙ فَلَا مُرْسِلَ لَهُ مِنْ بَعْدِه۪ۜ وَهُوَ الْعَز۪يزُ الْحَك۪يمُ ۝ 
    """, russian: """
Аллоҳ инсонларга Ўз раҳматидан қай нарсани очса (юборса),  уни  ушлаб - тўсиб қолгувчи йўқдир. У қай  нарсани тутиб -  тўсиб қолса, ундан кейин уни қўйиб юборгувчи ҳам йўқдир. У мутлақ ғолиб, ҳукм ва  ҳукмат  соҳибидир. (35/Фотир,  2).
    """),
    DailyArabicRussianModel(
        arabic:
            """وَلَئِنْ سَاَلْتَهُمْ مَنْ خَلَقَ السَّمٰوَاتِ وَالْاَرْضَ لَيَقُولُنَّ اللّٰهُۜ قُلْ اَفَرَاَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللّٰهِ اِنْ اَرَادَنِيَ اللّٰهُ بِضُرٍّ هَلْ هُنَّ كَاشِفَاتُ ضُرِّه۪ٓ اَوْ اَرَادَن۪ي بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَاتُ رَحْمَتِه۪ۜ قُلْ حَسْبِيَ اللّٰهُۜ عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُونَ ۝ """,
        russian:
            """Қасамки, агар сиз улардан:  "Осмонларни ва ерни ким яратди?" -- деб сўрсангиз,  албатта: "Аллоҳ",  дерлар. Айтинг:"Ундоқ бўлса, айтинглар-чи, Аллоҳ менга бир зарар беришни хоҳласа, сизлар Аллоҳни  қўйиб ибодат қилаётган (тепасида тўпланиб, сиғинаётган) нарсаларингиз Унинг зарарини  (мендан) кетказа олурларми?! Ёки (Аллоҳ) менга бир рахматни (яхшиликни) раво кўрса, улар Унинг раҳматини тўса олурларми?" Айтинг: "Менга Аллоҳ кифоядир! Таваккул қилгувчилар фақат Унга таваккул қилур(лар)!" (39/Зумар, 38).
Изоҳ. Тавба сурасининг 51-оятидан бошлаб Зумар сурасининг 38-оятигача  бўлган етти оят ҳақида бази валий зотлар: "Ушбу етти оят қироат қилинганида шу кунда агар узулиб ерга тушса ҳам, парво қилмайман, буларнинг қироати баракотидан, албатта, қутулиб қоламан", деганлари нақл қилинади.
"""),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّه۪    ۝    عَاجِلِه۪ وَاٰجِلِه۪    ۝    مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ   ۝   وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّه۪   ۝   عَاجِلِه۪ وَاٰجِلِه۪   ۝   مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ   ۝   اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ   ۝   وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِه۪ عَبْدُكَ وَنَبِيُّكَ   ۝   اَللّٰهُمَّ  إِنِّي أَسْأَلُكَ الْجَنَّةَ   ۝   وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ  ۝   وَأَعُوذُ بِكَ مِنَ النَّارِ   ۝   وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ  ۝   وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا ۝ 
    """, russian: """
    Ҳадиси шарифлар
    
    
 Аллоҳим! Сендан ўзим билган ва билмаган, тез бериладиган ва кейин бериладиган яхшиликнинг барчасини тилайман! Ўзим билган ва билмаган, тез келадиган ва кейин келадиган ёмонликнинг барчасидан Ўзингдан паноҳ тилайман! 
Аллоҳим! Сендан банданг ва пайғамбаринг (ҳазрати Муҳаммад соллаллоҳу  алайҳи ва саллам) тилаган яхшиликларни тилайман!  Банданг  пайғамбаринг (ҳазрати Муҳаммад соллаллоҳу алайҳи ва саллам) Сендан тилаган ёмонликлардан Ўзингдан паноҳ тилайман! 
Сендан жаннатни ва унга яқинлаштирадиган сўз ёки амални (насиб этмоғингни)  тилайман! Дўзах оловидан ва унга яқинлаштирадиган сўз ёки амалдан Ўзингга сиғинаман! Сендан - Ўзинг менга  тақдир қилган ҳар қазо ҳукмини мен учун ҳайрли қилмоғингни тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
لَا إِلٰهَ إِلَّا اللّٰهُ الْعَلِيمُ الْحَلِيمُ   ۝   لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ الْعَرْشِ الْعَظِيمِ  ۝   لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ السَّمَاوَاتِ وَرَبُّ الْأَرْضِ رَبُّ الْعَرْشِ الْكَرِيمِ ۝ 
    """, russian: """
    Илм ва ҳилм эгаси бўлмиш Аллоҳдан бошқа илоҳ йўқ. Буюк - азаматли Аршнинг Рабби - эгаси бўлмиш Аллоҳдан бошқа илоҳ йўқ. Осмонларнинг Рабби, Ернинг Рабби, олий - карамли Аршнинг  Рабби бўлиш Аллоҳдан бошқа илоҳ йўқ! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الطَّاهِرِ الطَّيِّبِ الْمُبَارَكِ الْأَحَبِّ إِلَيْكَ   ۝   اَلَّذِي إِذَا دُعِيْتَ بِه۪ أَجَبْتَ   ۝    وَإِذَا سُئِلْتَ بِه۪ أَعْطَيْتَ   ۝   وَإِذَا اسْتُرْحِمْتَ بِه۪ رَحِمْتَ   ۝    وَإِذَا اسْتُفْرِجْتَ بِه۪ فَرَّجْتَ ۝ 
    """, russian: """
    Аллоҳим. Сенинг пок, гўзал ва муборак ҳамда Ўзинг учун севимли бўлган исмин ила Сендан тилайман! У исмнинг ила Сенга дуо қилинганида ижобат қилурсан, У исмин ила Сендан сўралганида ато қилурсан, у исминг ила Сендан раҳмат сўралганида раҳмат қилурсан. У исминг ила Сендан мушкуллардан нажот тиланганида мушкулотдан халос қилурсан!
    """),
    DailyArabicRussianModel(
        arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْاٰخِرَةِ   ۝   اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي   ۝   اَللّٰهُمَّ اسْتُرْ عَوْرَاتِي   ۝   وَاٰمِنْ رَوْعَاتِي   ۝   وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي   ۝   وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي   ۝   وَأَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ۝ 
    """,
        russian:
            """Аллоҳим! Сендан дунё ва охиратда афв ва офият (сиҳат-саломатлик, тинчлик-омонлик) тилайман! Аллоҳим! Динимда ва дунёмда, аҳли оиламда ва  молимда Сендан афв ва офият (сиҳат-саломатлик, тинчлик-омонлик) тилайман!  Аллоҳим! Айбларимни ёп,  мени қўрққан нарсаларимдан (хавфу хатарлардан) эмин айла! Олдимдан, ортимдан, ўнгимдан, сўлимдан ва устимдан мени  муҳофаза қил! Оёқларим остидан ер тойдирмоғидан (балога учрашдан) Ўзингдан паноҳ тилайман!
"""),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَصْبَحْتُ  ۝  أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ  ۝  وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ  ۝  أَنَّكَ أَنْتَ اللّٰهُ لَا إِلٰهَ إِلَّا أَنْتَ  ۝  وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ ۝ 
    """, russian: """
    Аллоҳим! Тонгга етишдим! Сени гувоҳ қилурман; Сенинг Аршингни кўтариб турувчи фаришталарни,  (барча) фаришталарингни ва бутун яратганларингни  гувоҳ қилурманки, шуҳбасиз, Сен Аллоҳ (бор)сан, Сендан бошқа илоҳ йўқ ва Муҳаммад Сенинг банданг ва пайғамбарингдир.
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ مُنْزِلَ الْكِتَابِ سَرِيعَ الْحِسَابِ   ۝   اِهْزِمِ الْأَحْزَابَ   ۝   اَللّٰهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ ۝
    """, russian: """
    Эт китоб нозил қилгувчи ва ўта тез  ҳисоб-китоб этгувчи Аллоҳим! Иттифоқчи душман гуруҳларини парчала - мағлуб эт!     Аллоҳим! Уларни мағлуб эт ва уларни титроққа сол!  
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ   ۝   وَوَجَّهْتُ وَجْهِي إِلَيْكَ   ۝    وَفَوَّضْتُ أَمْرِي إِلَيْكَ   ۝    وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ   ۝   رَغْبَةً وَرَهْبَةً إِلَيْكَ   ۝   لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ   ۝   اٰمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ   ۝   وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ ۝ 
    """, russian: """
    Аллоҳим! Ўзимни Ўзингга таслим этдим, юзимни Сенга қаратдим, ишимни Ўзингга топширдим, Сенга суяндим, умидим ҳам, қўрқувим ҳам Сендандир. Сендан паноҳ топадиган жой фақат Сенсан, Сендан нажот топадиган жой фақат Сенсан! Нозил қилган Китобингга ва юборган Пайғамбарингга иймон келтирдим!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَوْلَجِ وَخَيْرَ الْمَخْرَجِ   ۝   بِسْمِ اللّٰهِ وَلَجْنَا وَبِسْمِ اللّٰهِ خَرَجْنَا   ۝   وَعَلَى اللّٰهِ رَبِّنَا تَوَكَّلْنَا ۝ 
    """, russian: """
    Аллоҳим! Кириш яхшилигини ва чиқиш яхшилигини Сендан тилайман! Аллоҳни исми билан кирдик, Аллоҳнинг исми билан чиқдик! Раббимиз Аллоҳга таваккул қилдик! 
    """),
    DailyArabicRussianModel(
        arabic:
            """اَللّٰهُمَّ رَبَّنَا اٰتِنَا فِي الدُّنْيَا حَسَنَةً  ۝  وَفِي الْاٰخِرَةِ حَسَنَةً  ۝  وَقِنَا عَذَابَ النَّارِ ۝ 
    """,
        russian: """
    Аллоҳим! Эй Раббимиз! Бизга дунёда ҳам яхшилик, оҳиратда ҳам яхшилик ато айла ва бизни дўзах азобидан ўзинг асра!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اغْفِرْ لَنَا   ۝   وَارْحَمْنَا   ۝   وَارْضَ عَنَّا   ۝   وَتَقَبَّلْ مِنَّا   ۝   وَأَدْخِلْنَا الْجَنَّةَ   ۝   وَنَجِّنَا مِنَ النَّارِ   ۝   وَأَصْلِحْ لَنَا شَأْنَنَا كُلَّهُ ۝ 
    """, russian: """
    Аллоҳим! Бизни мағфират қил, бизга раҳм қил, биздан рози бўл ва (яхши ишларимиз, ибодат ва дуоларимизни) биздан қабул эт, бизни жаннатга кирит, бизга дўзахдан нажот бер ва бизнинг ҳар кору ҳолимизни ислоҳ қил! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ  إِنِّي أَعُوذُ بِكَ مِنَ الْفَقْرِ وَالْقِلَّةِ وَالذِّلَّةِ    ۝   وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ ۝ 
    """, russian: """
    Аллоҳим! Қашшоқликдан, йўқчиликдан, зиллат - хорлик - тубанликдан Ўзингдан паноҳ тилайман! Зулм қилишдан ва зулмга учрашдан Ўзингдан паноҳ тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اجْعَلْ سَرِيرَتِي خَيْرًا مِنْ عَلَانِيَتِي   ۝   وَاجْعَلْ عَلَانِيَتِي صَالِحَةً   ۝   اَللّٰهُمَّ  إِنِّي أَسْأَلُكَ مِنْ صَالِحِ مَا تُؤْتِي النَّاسَ مِنَ الْمَالِ وَالْأَهْلِ وَالْوَلَدِ غَيْرِ الضَّالِّ وَلَا الْمُضِلِّ ۝ 
    """, russian: """
    Аллоҳим! Ичимни ташимдан яхшироқ қил ва ташимни ҳам яхши-дуруст қил! Аллоҳим! Мол-мулк, ахли оила, фарзанд борасида - йўлдан озувчи ва йўлдан оздирувчи қилмасдан - инсонларга берганингдан яхшисини бермоғингни Сендан тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ إِنِّى أَعُوذُ بِكَ مِنَ الْجُبْنِ  ۝   وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ  ۝   وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا  ۝   وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ۝
    """, russian: """
    Аллоҳим! Умрнинг энг забун-нохуш ҳолига қайтишдан (мушкул-машаққатли кунларига қадар яшашдан) Ўзингдан паноҳ тилайман! Дунё фитнасидан Ўзингдан паноҳ тилайман!
    
    
                    Таржимон изоҳи:
"Арзали умр"-"умрнинг энг забун-мушкул даври" ифодаси Қурони каримнинг Наҳл сураси,  70-оятида келган.
"Файзул-Фурқон"  изоҳига кўра, умрнинг нохуш, забун-мушкул ва билганларини унутиш, била туриб билмайдиган бўлиб қолиш даври "арзали умр" дейилади. Шунинг учун Пайғамбаримиз соллаллоҳу алайҳи ва саллам Қурон ифодаси билан дуо қилиб, "арзали умр"дан Аллоҳдан паноҳ тилаганлар.
Ҳазрати Икрима (розияллоҳу анҳу)дан келган бир хушхабарга кўра, Қурон ўқишда бардавом бўладиган киши "арзали умр"га тушмайди. 
Ҳазрати Икрима ҳазрати Абдуллоҳ ибн Аббоснинг озод этган қуллари бўлиб, ҳазрати Аббосдан бир қанча ҳадислар ривоят қилганлар розияллоҳу анҳум).

    """),
  ],

  // Thuesday
  [
    DailyArabicRussianModel(arabic: """
   يَٓا اَيُّهَا الَّذ۪ينَ اٰمَنُٓوا اِذَا ضَرَبْتُمْ  ف۪ي سَب۪يلِ اللّٰهِ فَتَبَيَّنُوا وَلَا تَقُولُوا لِمَنْ اَلْقٰٓى اِلَيْكُمُ السَّلَامَ لَسْتَ مُؤْمِنًاۚ تَبْتَغُونَ عَرَضَ الْحَيٰوةِ الدُّنْيَاۘ فَعِنْدَ اللّٰهِ مَغَانِمُ كَث۪يرَةٌۜ كَذٰلِكَ كُنْتُمْ مِنْ قَبْلُ فَمَنَّ اللّٰهُ عَلَيْكُمْ فَتَبَيَّنُواۜ اِنَّ اللّٰهَ كَانَ بِمَا تَعْمَلُونَ خَب۪يرًا ۝ 
   """, russian: """
   Эй иймон келтирганлар! Аллоҳ йўлида (сафарга) чиққан вақтингизда (мўминни кофирдан ажратмоқ учун) ҳамма нарсани  яхшилаб текширинглар. Сизларга салом берган (мусулмон эканлигини билдирган) кишига - дунё ҳаётининг ўткинчи манфаатини истаб - дарҳол: "Сен мўмин эмассан" деманглар. Чунки Аллоҳнинг ҳузуридаги ўлжалар беҳад кўпдир. (Унутмангларки,) сизлар ҳам олдин шундай эдингизлар ва Аллоҳ сизларга (иймонни) лутфу иноят қилди. У ҳолда яхшилаб текшириб - аниқланглар (шошиб ҳукм қилманглар). Шубҳасизки, Аллоҳ барча аммалларингиздан ҳабардор бўлган Зотдир (4/Нисо, 94).
   """),
    DailyArabicRussianModel(arabic: """
    يَهْد۪ي  بِهِ  اللّٰهُ  مَنِ اتَّبَعَ  رِضْوَانَهُ  سُبُلَ  السَّلَامِ وَيُخْرِجُهُمْ مِنَ الظُّلُمَاتِ اِلَى النُّورِ بِاِذْنِه۪ وَيَهْد۪يهِمْ اِلٰى صِرَاطٍ مُسْتَق۪يمٍ ۝ 
    """, russian: """
    Аллоҳ у (Қурон) билан Ўз ризосига  интилганларни омонлик - саломат йўлларига эриштирур, уларни Ўз изни билан қоронғуликлардан ёруғликларга чиқарур ва тўғри йўлга ҳидоят қилур (5/Моида, 16).
    """),
    DailyArabicRussianModel(arabic: """
    وَاِذَا جَٓاءَكَ الَّذ۪ينَ يُؤْمِنُونَ بِاٰيَاتِنَا فَقُلْ سَلَامٌ عَلَيْكُمْ كَتَبَ رَبُّكُمْ عَلٰى نَفْسِهِ الرَّحْمَةَۙ اَنَّهُ مَنْ عَمِلَ مِنْكُمْ سُٓوءًا بِجَهَالَةٍ ثُمَّ تَابَ مِنْ بَعْدِه۪ وَاَصْلَحَ فَاَنَّهُ غَفُورٌ رَح۪يمٌ ۝
    """, russian: """
    (Эй Расулим!) Бизнинг оятларимизга ишонганлар сизнинг ҳузурингизга келган вақтида айтингки: "Саломун алайкум (Сизларга Аллоҳнинг саломи бўлсин)! Сизлардан кимки билмасдан бир ёмонлик (бир гувоҳ) қилса-ю, сўнг ортидан тавба қилса  ва ўзини тузатса, Раббингиз (унга) раҳмат қилишни Ўз зиммасига ёзгандир. Чунки У беҳад мағфиратли ва бениҳоят раҳмлидир" (6/Аном,  54).
    """),
    DailyArabicRussianModel(arabic: """
  وَبَيْنَهُمَا حِجَابٌۚ وَعَلَى الْاَعْرَافِ رِجَالٌ يَعْرِفُونَ كُلًّا بِس۪يمٰيهُمْۚ وَنَادَوْا اَصْحَابَ الْجَنَّةِ اَنْ سَلَامٌ عَلَيْكُمْ لَمْ يَدْخُلُوهَا وَهُمْ يَطْمَعُونَ ۝ 
    """, russian: """
    Икки (томон) ўртасида бир парда (бўлган девор) бордир. Арофнинг (деворнинг баланд тепалари) устида эса (жаннатийлар ва дўзахийларнинг) ҳар бирини сиймоларидан танийдиган кишилар бордир. Улар жаннат аҳлига: "Саломун алайкум (Сизларга Аллоҳнинг саломи бўлсин)!" - деб нидо қилурларки, ўзлари беҳад орзу қилганлари ҳолда ҳали унга (жаннатга) кирмаган кишилардир (7/Ароф, 46).
    """),
    DailyArabicRussianModel(arabic: """
    دَعْوٰيهُمْ ف۪يهَا سُبْحَانَكَ اللّٰهُمَّ وَتَحِيَّتُهُمْ ف۪يهَا سَلَامٌۚ وَاٰخِرُ دَعْوٰيهُمْ اَنِ الْحَمْدُ لِلّٰهِ رَبِّ الْعَالَم۪ينَ۟ ۝ 
    """, russian: """
    Уларнинг у ердаги дуолари "Субҳанакаллоҳумма" ("Аллоҳим! Сени, ҳар қандай нуқсонлардан пок ва муназзаҳ эканлигингни олқишлаб, ёд этурмиз!") дейишдир. У ерда (бир - бирларига яхшилик ва омонлик) тилаклари "Салом!"дир ва дуоларининг охири эса: "Алаҳамдулиллаҳи Раббил-оламийн!" ("Бутун оламлар Рабби бўлган Аллоҳга ҳамд бўлсин!") дейишдир. (10/Юнус, 10).
    """),
    DailyArabicRussianModel(arabic: """
    وَلَقَدْ جَٓاءَتْ رُسُلُنَٓا اِبْرٰه۪يمَ بِالْبُشْرٰى قَالُوا سَلَامًاۜ قَالَ سَلَامٌۚ فَمَا لَبِثَ اَنْ جَٓاءَ بِعِجْلٍ حَن۪يذٍ ۝
    """, russian: """
    Қасамки, бизнинг элчиларимиз (фаришталар) Иброҳимга (бир фарзанд ҳақидаги) хушҳабар билан келдилар, "Салом!" дедилар. У ҳам "Салом!" деди. Кўп ўтмасдан (уларга) қовурулган бир бузоқни келтирди (11/Ҳуд,  69).
"""),
    DailyArabicRussianModel(arabic: """
    سَلَامٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِۜ ۝ 
    """, russian: """
    (Фаришталар:  "Дин учун дунёнинг завқ ва қийинчиликларига) сабр қилганларингиз сабабли сизларга салом бўлсин, дунё диёрининг (яхши) оқибати нақадар гўзалдир!" (дерлар)  (13/Рад, 24).
    """),
    DailyArabicRussianModel(arabic: """
    وَاُدْخِلَ الَّذ۪ينَ اٰمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْر۪ي مِنْ تَحْتِهَا الْاَنْهَارُ خَالِد۪ينَ ف۪يهَا بِاِذْنِ رَبِّهِمْۜ تَحِيَّتُهُمْ ف۪يهَا سَلَامٌ ۝ 
    """, russian: """
    Иймон келтириб, солиҳ (савобли) амаллар қилганлар ўз Раббининг изни билан ўзлари абадий қоладиган, остидан анҳорлар оқиб турадиган жаннатларга киритилажаклар. У ерда уларнинг (бир-бирларига) тилак,  илтифот ва дуолари (Салом!"дир (омонлик тилашдир)  (14/Иброҳим,  23).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّ الْمُتَّق۪ينَ ف۪ي جَنَّاتٍ وَعُيُونٍۜ   ۝   اُدْخُلُوهَا بِسَلَامٍ اٰمِن۪ينَ   ۝ 
    """, russian: """
    Тақво эгалари (Аллоҳнинг амрларига мос яшаб, шайтонга ва шайтонлашган шахсларга эргашишдан сақланган зотлар) эса жаннатларда ва чашмалар(нинг бошлари)дадирлар. (Уларга: "Эй тақво эгалари!) Унга саломатлик билан, тинч-эмин ҳолда киринглар!" - (дейилур)  (15/Ҳижр,  45-46).
    """),
    DailyArabicRussianModel(arabic: """
    اَلَّذ۪ينَ تَتَوَفّٰيهُمُ الْمَلٰٓئِكَةُ طَيِّب۪ينَۙ يَقُولُونَ سَلَامٌ عَلَيْكُمُۙ ادْخُلُوا الْجَنَّةَ بِمَا كُنْتُمْ تَعْمَلُونَ ۝ 
    """, russian: """
    Улар - яхши ва пок ҳолларида малоикалар жонларини оладиган кишилардир. (Фаришталар уларга:)  Сизларга салом бўлсин! Қилган амалларингиз туфайли киринглар жаннатга!" - дерлар   (16/Наҳл, 32).
    """),
    DailyArabicRussianModel(arabic: """
    وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدْتُ وَيَوْمَ اَمُوتُ وَيَوْمَ اُبْعَثُ حَيًّا ۝ 
    """, russian: """
    (Ийсо алайҳиссалом деди:) Туғилган куним ҳам, ўладиган куним ҳам, қайта тириладиган кунимда ҳам (Аллоҳдан) менга саломдир (омонликдир)!"  (19/Марям, 33).
    """),
    DailyArabicRussianModel(arabic: """
    قَالَ سَلَامٌ عَلَيْكَۚ سَاَسْتَغْفِرُ لَكَ رَبّ۪يۜ اِنَّهُ كَانَ ب۪ي حَفِيًّا ۝ 
    """, russian: """
    (Иброҳим) деди: "Сенга салом бўлсин (саломат бўл)! Сен учун Раббимдан мағфират тилагайман. Чунки У менга кўп лутфкордир"  (19/Марям,  47).
    """),
    DailyArabicRussianModel(arabic: """
    لَا يَسْمَعُونَ ف۪يهَا لَغْوًا اِلَّا سَلَامًاۜ وَلَهُمْ رِزْقُهُمْ ف۪يهَا بُكْرَةً وَعَشِيًّا ۝ 
    """, russian: """
    У ерда (жаннатда) улар беҳуда бир сўз эшитмаслар, фақат салом (омонлик) сўзларини  (эшитурлар). У ерда тонг ва шомда уларнинг ризқлари ҳам бордир  (19/Марям,  62).
    """),
    DailyArabicRussianModel(arabic: """
    فَأْتِيَاهُ فَقُولَٓا اِنَّا رَسُولَا رَبِّكَ فَاَرْسِلْ مَعَنَا بَن۪ٓي اِسْرَٓاء۪يلَ وَلَا تُعَذِّبْهُمْۜ قَدْ جِئْنَاكَ بِاٰيَةٍ مِنْ رَبِّكَۜ وَالسَّلَامُ عَلٰى مَنِ اتَّبَعَ الْهُدٰى ۝ 
    """, russian: """
    (Эй Мусо ва Ҳорун!)  Дарҳол унинг (Фиравннинг элчиларимиз. Бани Исроилни биз билан юбор ва уларга азоб берма! Биз Раббингиздан сенга бир мўъжиза келтирдик. Ҳидоятга эргашганларга салом (ва саодат) бўлгай!  (20/Тоҳо,  47).
    """),
    DailyArabicRussianModel(arabic: """
    قُلْنَا يَا نَارُ كُون۪ي بَرْدًا وَسَلَامًا عَلٰٓى اِبْرٰه۪يمَۙ ۝ 
    """, russian: """
    Биз: "Эй олов! Иброҳим учун салқин ва саломатлик бўл!" - дедик  (21/Анбиё, 69).
    """),
    DailyArabicRussianModel(arabic: """
    قُلْنَا يَا نَارُ كُون۪ي بَرْدًا وَسَلَامًا عَلٰٓى اِبْرٰه۪يمَۙ ۝ 
    """, russian: """
    Раҳмоннинг (ҳос) бандалари ул кишилардирки, ер юзида тавозу билан юрурлар ва жоҳиллар уларга сўз қотганда (талашмасдан):   "Саломат бўлинг!" де(б ўту)рлар  (25/Фурқон, 63).
    """),
    DailyArabicRussianModel(arabic: """
    اُو۬لٰٓئِكَ يُجْزَوْنَ الْغُرْفَةَ بِمَا صَبَرُوا وَيُلَقَّوْنَ ف۪يهَا تَحِيَّةً وَسَلَامًاۙ ۝ 
    """, russian: """
    Ана ўшалар (саналган ҳислатларга эга бўлган ҳолда Раҳмон бўлмиш Аллоҳга бандалик вазифасини бажарувчилар) сабрлари сабабли жаннатнинг энг юксак мавқе(лар)и билан мукофотланурлар ва у ерда табрик (омонлик тилаклари) ва салом билан қарши олинурлар (25/Фурқон,  75).
    """),
    DailyArabicRussianModel(arabic: """
    قُلِ الْحَمْدُ لِلّٰهِ وَسَلَامٌ عَلٰى عِبَادِهِ الَّذ۪ينَ اصْطَفٰىۜ آٰللّٰهُ خَيْرٌ اَمَّا يُشْرِكُونَۜ ۝ 
    """, russian: """
    (Эй Расулим!) Айтинг: "Аллоҳга ҳамд бўлсин! Унинг танлаган (пайғамбар) бандаларига салом бўлсин! Аллоҳ яхшироқми ёки у (мушрик)лар шерик қилаётган (Аллоҳнинг ўрнига ўзлари боғлиқлик кўрсатаётган) нарсаларми?!"  (27/Намл,  59).

    """),
    DailyArabicRussianModel(arabic: """
    وَاِذَا سَمِعُوا اللَّغْوَ اَعْرَضُوا عَنْهُ وَقَالُوا لَنَٓا اَعْمَالُنَا وَلَكُمْ اَعْمَالُكُمْۘ سَلَامٌ عَلَيْكُمْۘ لَا نَبْتَغِي الْجَاهِل۪ينَ ۝ 
    """, russian: """
    Улар (бундан олдин Китоб берилган ва Қуронга ишонган зотлар) беҳуда-бефойда сўз эшитган вақтларида ундан юз ўгирурлар ва: "Бизнинг амалларимиз - бизга, сизларнинг амалларингиз - сизга!  Саломат бўлинглар!  Биз жоҳил(лик қилувчи)ларни истамасмиз (жоҳил кишилар билан ўтириб-турмасмиз, биродарлик қилмасмиз)!" - дерлар (28/Қасас,  55).
    """),
    DailyArabicRussianModel(arabic: """
    تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلَامٌۚ وَاَعَدَّ لَهُمْ اَجْرًا كَر۪يمًا ۝
    """, russian: """
    (Мўминлар) Унга етишадиган кунда (Аллоҳнинг) уларга илтифоти "Салом!"дир. (Аллоҳ) уларга шарафли мукофот таёрлаб қўйгандир (33/Аҳзоб, 44).
    """),
    DailyArabicRussianModel(arabic: """سَلَامٌ قَوْلًا مِنْ رَبٍّ رَح۪يمٍ ۝ 
    """, russian: """
    Беҳад раҳмли Рабби тарафидан (уларга) айтиладиган сўз - "Салом!"дир. (36/Ёсин, 58)
    """),
    DailyArabicRussianModel(arabic: """
    وَس۪يقَ الَّذ۪ينَ اتَّقَوْا رَبَّهُمْ اِلَى الْجَنَّةِ زُمَرًاۜ حَتّٰى اِذَا جَٓاؤُ۫هَا وَفُتِحَتْ اَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَامٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوهَا خَالِد۪ينَ ۝ 
    """, russian: """
    Ўз Раббига тақво қилганлар (Ундан қўрқиб, амрига мувофиқ яшаганлар) эса гуруҳ-гуруҳ ҳолда жаннатга олиб борилур! Ниҳоят, улар у жойга келиб, унинг  эшиклари очилганида (жаннат) соқчилари уларга:  "Сизларга (Аллоҳдан) салом бўлсин! (Қандай) поксизлар! Бас,  абадий қолувчи бўлган ҳолингизда киринглар у ерга!" - дерлар (39/Зумар, 73).

    """),
    DailyArabicRussianModel(arabic: """
    فَاصْفَحْ عَنْهُمْ وَقُلْ سَلَامٌۜ فَسَوْفَ يَعْلَمُونَ ۝ 
    """, russian: """
    (Аллоҳ:) "Энди сиз уларни (иймон келтирмаганларни) тарк этинг ва: "Саломат бўлинглар" - денг. Бас, яқинда билурлар! (деди)  (43/Зухруф, 89).
    """),
    DailyArabicRussianModel(arabic: """
    اُدْخُلُوهَا بِسَلَامٍۜ ذٰلِكَ يَوْمُ الْخُلُودِ ۝ 
    """, russian: """
    (Уларга:) "У ерга саломатлик ила кирингиз! Бу абадийлик кунидир" (дейилур)  (50/Қоф, 34).

    """),
    DailyArabicRussianModel(arabic: """
    اِذْ دَخَلُوا عَلَيْهِ فَقَالُوا سَلَامًاۜ قَالَ سَلَامٌۚ قَوْمٌ مُنْكَرُونَ ۝ 
    """, russian: """
    Ёд этинг, вақтики улар (фаришталар) унинг ҳузурига кирдилар ва: "Салом!" - дедилар, у (Иброҳим) ҳам (жавобан): "Салом! (Булар) нотаниш қавм-ку!" - деди (51/Зориёт, 25).
    """),
    DailyArabicRussianModel(arabic: """
    لَا يَسْمَعُونَ ف۪يهَا لَغْوًا وَلَا تَأْث۪يمًاۙ   ۝   اِلَّا ق۪يلًا سَلَامًا سَلَامًا   ۝ 
    """, russian: """
    У ерда беҳад ва гуноҳ сўз эшитмаслар (ва сўзламаслар); фақат (эшитадиган) сўзлари - "Салом, салом"дир  (56/Воқеа,  25-26).
    """),
    DailyArabicRussianModel(arabic: """
    فَسَلَامٌ لَكَ مِنْ اَصْحَابِ الْيَم۪ينِ ۝ 
    """, russian: """
    "Эй (бахтиёрлардан бўлган) ўнг томон  эгаси! Сенга салом бўлсин (сен омонликдасан)!" (дейилур)  (56/Воқеа, 91).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّٓا اَنْزَلْنَاهُ ف۪ي لَيْلَةِ الْقَدْرِۚ ۝ 
وَمَٓا اَدْرٰيكَ مَا لَيْلَةُ الْقَدْرِۜ ۝ 
لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ اَلْفِ شَهْرٍۜ ۝ 
تَنَزَّلُ الْمَلٰٓئِكَةُ وَالرُّوحُ ف۪يهَا بِاِذْنِ رَبِّهِمْۚ مِنْ كُلِّ اَمْرٍۙ ۛ ۝
سَلَامٌ۠ ۛ هِيَ حَتّٰى مَطْلَعِ الْفَجْرِ ۝ 
    """, russian: """
Бисмиллаҳир-Раҳманир-Роҳийм
    
Дарҳақиқат, Биз уни (Қуронни) Қадр кечасида нозил қилдик.  Қадр кечаси нималигини (унинг фазилат ва шарафини) сиз қандай билурсиз? Қадр кечаси (қадр кечасига эга бўлмаган) минг ойдан яхшироқдир.  У кечада Малоикалар ва Руҳ ўз Раббининг изни билан (келгуси йилга қадар бўладиган ҳикматли) ҳар бир иш учун тушгайдир. У (кеча) то тонг отгунича (ибодат аҳлига) саломдир (раҳмат, омонлик, тинчлик, баракотдир)  (97/Қадр, 1-5).
    """),
    DailyArabicRussianModel(arabic: """
   
 اَللّٰهُمَّ  فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ   ۝   عَالِمَ الْغَيْبِ وَالشَّهَادَةِ   ۝   رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ    ۝    أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا أَنْتَ   ۝   أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي   ۝   وَشَرِّ الشَّيْطَانِ وَشِرْكِه۪ ۝ 
    """, russian: """
    Ҳадиси шарифлар 
    
    
    Эй инсонлар ва ерни илк яратган, ғойиб ва ошкорни билгувчи Аллоҳим! Эй ҳамма нарсанинг Рабби-эгаси ва ягона ҳукмрони! Гувоҳлик бераманки, Сендан бошқа илоҳ йўқдир. Нафсим шарридан, шайтон шарридан ва унинг ширк(ка дават қилиши)идан Ўзингдан паноҳ тилайман! 
    """),
    DailyArabicRussianModel(arabic: """"    
َللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ   ۝   وَ مِنْ شَرِّ مَا لَمْ أَعْمَلْ ۝ 
    """, russian: """
    Аллоҳим! Шу маҳалгача қилган амалларим шарридан ва ҳали қилмаган амалларим шарридан Ўзингдан паноҳ тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَدْمِ   ۝   وَأَعُوذُ بِكَ مِنَ التَّرَدِّي   ۝   وَأَعُوذُ بِكَ مِنَ الْغَرَقِ وَالْحَرَقِ وَالْهَرَمِ   ۝   وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِيَ الشَّيْطَانُ عِنْدَ الْمَوْتِ   ۝   وَأَعُوذُ بِكَ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِرًا   ۝   وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا ۝ 

    """, russian: """
    Аллоҳим! Харобалар остида қолишдан Ўзингдан паноҳ тилайман!  Баландлардан йиқилишдан Ўзингдан паноҳ тилайман! Сувда ғарқ бўлишдан, ёнғиндан ва (қўл-оёқдан  қолиб, бировга муҳтож бўлишдек) ёмон қариликдан Ўзингдан паноҳ тилайман!  Ўлим олдидаги шайтоннинг тасир кучидан Ўзингдан паноҳ тилайман! Сенинг йўлингдан юз ўгирган ҳолда ўлишдан Ўзингдан паноҳ тилайман! Махлуқотларнинг чақиб-заҳарлаши билан ўлишдан Ўзингдан паноҳ тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَعُوذُ بِوَجْهِكَ الْكَرِيمِ   ۝   وَكَلِمَاتِكَ التَّامَّةِ مِنْ شَرِّ مَا أَنْتَ اٰخِذٌ بِنَاصِيَتِه۪   ۝   اَللّٰهُمَّ أَنْتَ تَكْشِفُ الْمَغْرَمَ وَالْمَأْثَمَ   ۝   اَللّٰهُمَّ لَا يُهْزَمُ جُنْدُكَ   ۝   وَلَا يُخْلَفُ وَعْدُكَ   ۝    وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ   ۝   سُبْحَانَكَ وَبِحَمْدِكَ ۝ 
    """, russian: """
    Аллоҳим! Сен (жазолаш учун) маҳкам тутадиган нарсалар ёмонлигидан карамли Зотингга ва мукаммал (бенуқсон) калималарингга сиғинаман! Аллоҳим! Қарз юкини ва гуноҳларни фақат Сен бартараф қилурсан! Аллоҳим! Сенинг лашкарларинг мағлуб қилинмас! Сенинг вадангга қарши иш бўлмас! Ҳеч бир шон-шарафни бергувчи Сенсан! Сен (нуқсон сифатларидан) пок ва муназзаҳсан, дея тасбиҳ ила Сенга ҳамд айтурман!
Таржимон изоҳи: Дуодаги "Охизун биносиятиҳ" ифодаси Қурондандир,  Аллоҳ таоло айтади (маноси) "Йўқ! (Тўхтасин у!) Агар у (куфридан ва бу аҳволидан) қайтмаса, қасамки,  Биз (уни) манглайидан (ушлаб), ўша ёлғончи, гуноҳкор манглай (соч)идан тутиб,  (жаҳаннамга) судрагаймиз. (96/Алақ, 15-16).
    """),
    DailyArabicRussianModel(arabic: """
    أَعُوذُ بِكَلِمَاتِ اللّٰهِ التَّامَّةِ مِنْ غَضَبِه۪ وَشَرِّ عِبَادِه۪    ۝   وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِ ۝ 
    """, russian: """
    Аллоҳнинг ғазабидан, бандаларнинг ёмонлигидан, келиб - кетгувчи шайтонларнинг васвасаларидан ва менга яқинлашишларидан Аллоҳнинг мукаммал -- бекам-кўст калималарига сиғинаман! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا   ۝    وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ   ۝   فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ   ۝    وَارْحَمْنِي   ۝   إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ ۝ 
    """, russian: """
    Аллоҳим! Мен ўз-ўзимга кўп зулм қилдим! Гуноҳларни мағфират қилгувчи эса фақат Сенсан! Бас, (чексиз лутфинг ила) Ўз ҳузурингдан бўлган бир мағфират билан мени мағфират қил ва менга раҳм қил, чунки Сен беҳад мағфиратли, бениҳоят раҳмли Зотсан! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْهُدٰى وَالتُّقٰى وَالْعَفَافَ وَالْغِنٰى ۝
    """, russian: """
    Аллоҳим! Сендан ҳидоят, тақво, иффат ва (кўнгил) бойлиг(ини) тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ  إِنِّي أَعُوذُ بِكَ مِنَ الْجُوعِ   ۝    فَإِنَّهُ بِئْسَ الضَّجِيعُ   ۝   وَأَعُوذُ بِكَ مِنَ الْخِيَانَةِ   ۝   فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ ۝ 
    """, russian: """
    Аллоҳим! Очликдан  Сендан паноҳ тилайман, чунки очлик (бетоқат қилувчи) қандай ёмон ҳолдир! Ҳиёнатдан Ўзингдан паноҳ тилайман, чунки у қандай ёмон бир фельдир!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ  إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ   ۝   وَأَسْأَلُكَ عَزِيمَةَ الرُّشْدِ   ۝   وَأَسْأَلُكَ شُكْرَ نِعْمَتِكَ وَحُسْنَ عِبَادَتِكَ  ۝   وَأَسْأَلُكَ لِسَانًا صَادِقًا وَقَلْبًا سَلِيمًا   ۝   وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ   ۝   وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ   ۝   وَأَسْتَغْفِرُكَ مِمَّا تَعْلَمُ   ۝   إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ ۝ 
    """, russian: """
    Аллоҳим! Сендан иш(ларим)да сабот тилайман! Ва Сендан тўгриликда - ҳақ йўлда азимат тилайман! Сендан нематларингга  шукр қилмоқ, Ўзингга яхши ва гўзал ибодат қилмоқ учун ёрдам тилайман! Сендан тўғри - ростгўй бир тил ва қалби салим -  (ширк, нифоқ, ирим ва ғиллу ғашликдан холи) соғлом бир қалб тилайман! Сен (мен ҳақимда) билган нарсаларинг шарридан Сендан паноҳ тилайман! Сен (мен ҳақимда) билган нарсаларнинг хайрлисини Сендан тилайман!  Сен (мен ҳақимда) билган гуноҳлардан Ўзингдан мағфират тилайман! Албатта, Сен ғайбларни - яширин нарсаларни билгувчисан!
    """),
    DailyArabicRussianModel(arabic: """
   اَللّٰهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ   ۝   وَحُبَّ مَنْ يُحِبُّكَ   ۝   وَالْعَمَلَ الَّذِي يُبَلِّغُنِي حُبَّكَ   ۝   اَللّٰهُمَّ اجْعَلْ حُبَّكَ   ۝    أَحَبَّ إِلَيَّ مِنْ نَفْسِي وَأَهْلِي وَمِنَ الْمَاءِ الْبَارِدِ ۝  
    """, russian: """
    Аллоҳим! Сени севмоқни, Сени севганларни севмоқни ва Сенинг муҳаббатингга етказадиган амалларни севмоқни Сендан тилайман! Аллоҳим! Ўз муҳаббатингни менга жонимдан, аҳли оиламдан  ва муздек сувдан ҳам кўра севимли қил!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلًا مُتَقَبَّلاً ۝ 
    """, russian: """
    Аллоҳим! Сендан фойдали илм, пок-ҳалол ризқ ва қабул бўладиган амал тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ   ۝   وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ ۝ 
    """, russian: """
    Аллоҳим! Мени (ҳақиқий) тавба қилгувчилардан ва поклангувчилардан айла!
    """),
    DailyArabicRussianModel(arabic: """
    بِسْمِ اللّٰهِ تَوَكَّلْتُ عَلَى اللّٰهِ   ۝   لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ ۝ 
    """, russian: """
    Аллоҳнинг исми билан; Аллоҳга таваккул қилдим. Бутун куч ва қувват фақат Аллоҳдандир (Унинг лутфу эҳсони биландир)! 
    """),
    DailyArabicRussianModel(arabic: """
    اَلْحَمْدُ لِلّٰهِ الَّذِي كَفَانِي وَاٰوَانِي وَأَطْعَمَنِي وَسَقَانِي   ۝    وَالَّذِي مَنَّ عَلَيَّ فَأَفْضَلَ   ۝   وَالَّذِي أَعْطَانِي فَأَجْزَلَ   ۝   اَلْحَمْدُ لِلّٰهِ عَلٰى كُلِّ حَالٍ   ۝   اَللّٰهُمَّ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ وَإِلٰهَ كُلِّ شَيْءٍ   ۝   أَعُوذُ بِكَ مِنَ النَّارِ ۝ 
    """, russian: """
    Ҳожатларимни қондирган, менга бошпана берган, едирган ва ичирган Аллоҳга ҳамд бўлсин!  Менга немат берган - икром айлаган ва нематини - икромини мўл қилган, менга ато қилган ва атосини мўл қилган Аллоҳга ҳамд бўлсин! Ҳар ҳол учун Аллоҳга ҳамд бўлсин! Эй ҳамма нарсанинг Рабби ва эгаси-ҳукмрони, эй ҳамма нарсанинг илоҳи! Дўзах оловидан Ўзингга сиғинаман! (Ўзинг асра!)
    """),
    DailyArabicRussianModel(arabic: """
    اَلْحَمْدُ لِلّٰهِ الَّذِي عَافَانِي فِي جَسَدِي   ۝   وَرَدَّ عَلَيَّ رُوحِي   ۝   وَأَذِنَ لِي بِذِكْرِه۪ ۝
    """, russian: """
    Жасадимга офият - сиҳат-саломатлик, омонлик берган, руҳимни менга қайтарган, Ўз зикрини менга насиб этган Аллоҳга ҳамд бўлсин! 
    """),
    DailyArabicRussianModel(arabic: """
    أَعُوذُ بِكَلِمَاتِ اللّٰهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ   ۝    وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ ۝ 
    """, russian: """
    Ҳар турли шайтон ва заҳарли махлуқлардан, бутун ёмон (суқ ва) кўзлардан Аллоҳнинг мукаммал - бекам-кўст калималарига сиғинаман!
    """),
  ],
  // Wendesday
  [
    DailyArabicRussianModel(arabic: """
    وَاِلٰهُكُمْ اِلٰهٌ وَاحِدٌۚ لَٓا اِلٰهَ اِلَّا هُوَ الرَّحْمٰنُ الرَّح۪يمُ ۝ 
    """, russian: """
  Сизларнинг илоҳингиз бир илоҳ (Аллоҳ)дир. Ундан бошқа (ҳеч бир) илоҳ йўқ. У Раҳмондир (дунёда бутун махлуқотига марҳамат қилгувчидир), Рахиймдир (охиратда фақат мўминларга раҳмат қилгувчидир)  (2/Бақара,  163).  
    """),
    DailyArabicRussianModel(arabic: """
    َللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۚ اَلْحَيُّ الْقَيُّومُۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌۜ لَهُ مَا فِي السَّمٰوَاتِ وَمَا فِي الْاَرْضِۜ مَنْ ذَا الَّذ۪ي يَشْفَعُ عِنْدَهُٓ اِلَّا بِاِذْنِه۪ۜ يَعْلَمُ مَا بَيْنَ اَيْد۪يهِمْ وَمَا خَلْفَهُمْۚ وَلَا يُح۪يطُونَ بِشَيْءٍ مِنْ عِلْمِه۪ٓ اِلَّا بِمَا شَٓاءَۚ وَسِعَ كُرْسِيُّهُ السَّمٰوَاتِ وَالْاَرْضَۚ وَلَا يَؤُ۫دُهُ حِفْظُهُمَاۚ وَهُوَ الْعَلِيُّ الْعَظ۪يمُ   ۝   لَٓا اِكْرَاهَ فِي الدّ۪ينِ قَدْ تَبَيَّنَ الرُّشْدُ مِنَ الْغَيّۚ فَمَنْ يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِنْ بِاللّٰهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقٰىۗ لَا انْفِصَامَ لَهَاۜ وَاللّٰهُ سَم۪يعٌ عَل۪يمٌ   ۝   اَللّٰهُ وَلِيُّ الَّذ۪ينَ اٰمَنُواۙ يُخْرِجُهُمْ مِنَ الظُّلُمَاتِ اِلَى النُّورِۜ وَالَّذ۪ينَ كَفَرُٓوا اَوْلِيَٓاؤُ۬هُمُ الطَّاغُوتُۙ يُخْرِجُونَهُمْ مِنَ النُّورِ اِلَى الظُّلُمَاتِۜ اُو۬لٰٓئِكَ اَصْحَابُ النَّارِۚ هُمْ ف۪يهَا خَالِدُونَ۟ ۝ 
    """, russian: """
    Аллоҳ шундай бир илоҳки, ундан бошқа ҳеч бир илоҳ йўқ. У Ҳайй ва Қайюмдир (абадий тирик ва яратганларини сақлаб, кузатиб тургувчидир ва ҳамма нарса ҳаётини У билан давом эттирур). Уни на бир мудроқ (ғафлат) ва на бир уйқу тутар. Осмонларда ва ерда бор нарсалар(нинг ҳаммаси) фақат Уникидир. Унинг изни бўлмагунича, Унинг ҳузурида ким шафоат қила олур? Бандаларининг олдидаги ва ортидаги (ўтмиш ва келажакларини, қилган ва қилажак ишларини, дунё ва охиратга оид) нарсаларини У билур. Улар Унинг илмидан фақар У хоҳлаган миқдоридан бошқа бир нарсани қамрай олмаслар. Унинг Курсиси (қудрати, мулки, салтанати ва ҳукмронлиги) осмонларни ва ерни қамрагандир; уларни муҳофаза қилиб туриш Унга оғир келмас.  У беҳад олийдир, бениҳоят буюкдир. Дин(га киришда - иймон келтириш)да мажбурлаш йўқ. Тўғрилик билан эгрилик (иймон билан куфр, ҳақ билан ботил) очиқ - аён бўлди. Бас, кимки тоғутни (Аллоҳдан узоқлаштирувчи ва Унинг амрларини бажаришдан ман этувчиларни) инкор қилиб, Аллоҳга иймон келтирса, энди у ҳеч узулиши (мумкин) бўлмаган мустаҳкам ҳалқага ёпишгандир. Аллоҳ (ҳамма нарсани) ҳаққоний эшитгувчидир, билгувчидир.Аллоҳ иймон келтирганларни дўсти ва мададкоридир; уларни (куфр, ширк, даҳрийлик ва ҳар турли ботил ҳаёт ва тушунчалар каби) қоронғуликлардан ёруғликка чиқарур. Кофирларнинг дўстлари эса тоғут (Аллоҳдан узоқлаштирувчи ва Унинг амрларини бажаришдан ман этувчилар)дирки, улар эса уларни ёруғликдан (нурли йўлдан) қоронғуликларга чиқарур. Ана ўшалар олов (дўзах) аҳлидирлар, улар у ерда абадий қолурлар (2/Бақара,  255-257).
    """),
    DailyArabicRussianModel(arabic: """
    الٓم    ۝   اَللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۙ الْحَيُّ الْقَيُّومُۜ   ۝   نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ وَاَنْزَلَ التَّوْرٰيةَ وَالْاِنْج۪يلَۙ   ۝   مِنْ قَبْلُ هُدًى لِلنَّاسِ وَاَنْزَلَ الْفُرْقَانَۜ اِنَّ الَّذ۪ينَ كَفَرُوا بِاٰيَاتِ اللّٰهِ لَهُمْ عَذَابٌ شَد۪يدٌۜ وَاللّٰهُ عَز۪يزٌ ذُو انْتِقَامٍ   ۝   اِنَّ اللّٰهَ لَا يَخْفٰى عَلَيْهِ شَيْءٌ فِي الْاَرْضِ وَلَا فِي السَّمَٓاءِۜ   ۝   هُوَ الَّذ۪ي يُصَوِّرُكُمْ فِي الْاَرْحَامِ كَيْفَ يَشَٓاءُۜ لَٓا اِلٰهَ اِلَّا هُوَ الْعَز۪يزُ الْحَك۪يمُ ۝ 
    """, russian: """
   Алиф. Лом Мим. Аллоҳки, Ундан бошқа ҳеч бир илоҳ йўқдир. У Ҳайй ва Қайюмдир  (абадий тирикдир ва яратганларини кузатиб-бошқариб тургувчидир; ҳамма нарса У билан ҳаётини давом эттирур).  (Аллоҳ бу) Китобни сизга аниқ ҳақ ( ва ҳақиқат) билан (тўла ва) ўзидан олдинги (китоб)ларни(нг аслларини) тасдиқловчи этиб нозил қилди. Бундан олдин инсонларни тўғри йўлга бошламоқ учун Тавротни ва Инжилни нозил қилган эди, ва ниҳоят, Фурқонни (ҳақ билан ботилни ажратувчи Қуронни) ҳам нозил қилди. Аллоҳнинг оятларини тан олмаганлар борки, улар учун аниқ шиддатли азоб бордир. Аллоҳ мутлоқ ғолиб ва беомон жазолагувчи - (мазлумларнинг) интиқомини олгувчидир. Шубҳасиз, ерда ва осмонда ҳеч бир нарса Аллоҳга махфий қолмас. Бачадонларда сизларга қандай хоҳласа, ўшандай шакл-суврат бергувчи Удир. Ундан бошқа илоҳ йўқ. (У) мутлақ ғолиб, ҳукм ва ҳикмат соҳибидир  (3/Оли Имрон,  1-6).
 
    """),
    DailyArabicRussianModel(arabic: """
    مَا كَانَ اِبْرٰه۪يمُ يَهُودِيًّا وَلَا نَصْرَانِيًّا وَلٰكِنْ كَانَ حَن۪يفًا مُسْلِمًاۜ وَمَا كَانَ مِنَ الْمُشْرِك۪ينَ ۝ 
    """, russian: """
    Иброҳим на яҳудий эди, на насроний эди. Лекин у Аллоҳни бир деб билган соф - тўғри бир мусулмон эди; (асло) мушриклардан эмас эди  (3/Оли Имрон, 67).
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۜ لَيَجْمَعَنَّكُمْ اِلٰى يَوْمِ الْقِيٰمَةِ لَا رَيْبَ ف۪يهِۜ وَمَنْ اَصْدَقُ مِنَ اللّٰهِ حَد۪يثًا۟ ۝ 
    """, russian: """
    Аллоҳ, (У чин илоҳдирки), Ундан бошқа ҳеч бир илоҳ йўқдир; келишида шак-шубҳа бўлмаган қиёмат кунида сизларни, албатта, тўплагайдир. Аллоҳдан кўра энг тўғри сўзлик ким бор?  (4/Нисо, 87).
    """),
    DailyArabicRussianModel(arabic: """
لَقَدْ كَفَرَ الَّذ۪ينَ قَالُٓوا اِنَّ اللّٰهَ ثَالِثُ ثَلٰثَةٍۢ وَمَا مِنْ اِلٰهٍ اِلَّا اِلٰهٌ وَاحِدٌۜ وَاِنْ لَمْ يَنْتَهُوا عَمَّا يَقُولُونَ لَيَمَسَّنَّ الَّذ۪ينَ كَفَرُوا مِنْهُمْ عَذَابٌ اَل۪يمٌ ۝     
    
    """, russian: """
    "Ҳақиқатан, Аллоҳ учтанинг учинчиси (уч илоҳдан бири(дир)" деганлар (ширкка тушиб), муҳаққақ, кофир бўлдилар. Ҳолбуки, (ибодатга лойиқ) бир илоҳдан бошқа илоҳ йўқ. Агар (бу) айтаётган сўзларидан (ботил этиқодларидан) қайтмасалар, улардан кофир бўлиб қолганларига, албатта, жуда аламли бир азоб етгайдир (5/Моида, 73).

    """),
    DailyArabicRussianModel(arabic: """
    ذٰلِكُمُ اللّٰهُ رَبُّكُمْۚ لَٓا اِلٰهَ اِلَّا هُوَۚ خَالِقُ كُلِّ شَيْءٍ فَاعْبُدُوهُۚ وَهُوَ عَلٰى كُلِّ شَيْءٍ وَك۪يلٌ ۝ 
    """, russian: """
    Ана шу  Аллоҳ сизнинг Раббингиздир. Ундан бошқа ҳеч бир илоҳ (Рабб) йўқ. Ҳамма нарсани яратган Удир. У ҳолда Унга бандалик қилинглар. У ҳамма нарса устидан вакилдир - қудратли тасарруф эгасидир (6/Аном,  102).

    """),
    DailyArabicRussianModel(arabic: """
    اِتَّبِعْ مَٓا اُو۫حِيَ اِلَيْكَ مِنْ رَبِّكَۚ لَٓا اِلٰهَ اِلَّا هُوَۚ وَاَعْرِضْ عَنِ الْمُشْرِك۪ينَ ۝ 
    """, russian: """
    (Эй Расулим!)  Раббингиздан сизга ваҳй қилинган нарсага эргашинг; Ундан бошқа ҳеч бир илоҳ йўқ. (Аллоҳнинг сифатларини, Рабблигини, ҳукм ва ҳукмронлигини бошқаларга тақайдиган) мушриклардан юз ўгиринг!  (6/Аном, 106)
    """),
    DailyArabicRussianModel(arabic: """
    قُلْ يَٓا اَيُّهَا النَّاسُ اِنّ۪ي رَسُولُ اللّٰهِ اِلَيْكُمْ جَم۪يعًاۨ الَّذ۪ي لَهُ مُلْكُ السَّمٰوَاتِ وَالْاَرْضِۚ لَٓا اِلٰهَ اِلَّا هُوَ يُحْي۪ وَيُم۪يتُۖ فَاٰمِنُوا  بِاللّٰهِ وَرَسُولِهِ النَّبِيِّ الْاُمِّيِّ الَّذ۪ي يُؤْمِنُ بِاللّٰهِ وَكَلِمَاتِه۪ وَاتَّبِعُوهُ لَعَلَّكُمْ تَهْتَدُونَ ۝ 
    """, russian: """
    (Эй Расулим!) Айтингки: "Эй Инсонлар! Шубҳасиз, мен сизларнинг  ҳаммангиз учун (юборилган) Аллоҳнинг пайғамбариман. Ул  (Аллоҳ)ки, осмонларнинг ва ернинг мулки ва ҳукмронлиги Уникидир. Ундан бошқа ҳеч бир илоҳ йўқ. У ҳам тирилтирур,  ҳам ўлдирур. У ҳолда Аллоҳга иймон келтиринглар;  Аллоҳга ва Унинг сўзларига (бошқа пайғамбарларга оид хабарларга, уларга тушган  Китобларига ва ўзига туширилган ваҳйга дилдан) ишонадиган, Унинг уммий Пайғамбари бўлган Расулига ҳам иймон келтиринглар. Ва унга эргашинглар, токи тўғри йўлни топгайсизлар" (7/Ароф, 158).
    """),
    DailyArabicRussianModel(arabic: """
    يُنَزِّلُ الْمَلٰٓئِكَةَ بِالرُّوحِ مِنْ اَمْرِه۪ عَلٰى مَنْ يَشَٓاءُ مِنْ عِبَادِه۪ٓ اَنْ اَنْذِرُٓوا اَنَّهُ لَٓا اِلٰهَ اِلَّا اَنَا۬ فَاتَّقُونِ ۝ 
    """, russian: """
    У (Аллоҳ) бандаларидан хоҳлаганига фаришталарни Ўз амри (бўлмиш) ваҳй билан туширур; "(Инсонларни) огоҳлантиринглар, шубҳасиз, Мендан бошқа илоҳ йўқ;  бас, Менга тақво қилинглар (амрларимга мос яшанглар, қарши боришдан сақланинглар)", дея (16/Наҳл,  2).

    """),
    DailyArabicRussianModel(arabic: """
    وَاِنْ تَجْهَرْ بِالْقَوْلِ فَاِنَّهُ يَعْلَمُ السِّرَّ وَاَخْفٰى   ۝   اَللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۜ لَهُ الْاَسْمَٓاءُ الْحُسْنٰى ۝ 
    """, russian: """
    Овозингизни (дуода) баланд қилсангиз (ҳам, паст қилсангиз) ҳам, (Унга бари бирдир), чунки У яширин нарсани ҳам, махфийнинг махфийсини ҳам билур. Аллоҳ улдирки, Ундан бошқа илоҳ йўқдир. Энг гўзал исмлар Уникидир. (20/Тоҳо,  7-8).
    """),
    DailyArabicRussianModel(arabic: """
    وَاَنَا اخْتَرْتُكَ فَاسْتَمِعْ لِمَا يُوحٰى   ۝   اِنَّن۪ٓي اَنَا اللّٰهُ لَٓا اِلٰهَ اِلَّا اَنَا۬ فَاعْبُدْن۪يۙ وَاَقِمِ الصَّلٰوةَ لِذِكْر۪ي ۝ 
    """, russian: """
    "Мен (пайғамбарликка) сени танладим, энди ваҳй қилинадиган нарсани тингла".  Шубҳасиз, мен Ўзим Аллоҳдирман.  Мендан бошқа ҳеч бир илоҳ йўқ. Менга бандалик қил ва Мени зикр қилиш учун тўғри-тўкис намоз ўқи!"  (20/Тоҳо, 13-14).
    """),
    DailyArabicRussianModel(arabic: """
    وَمَٓا اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ اِلَّا نُوح۪ٓي اِلَيْهِ اَنَّهُ لَٓا اِلٰهَ اِلَّا اَنَا۬ فَاعْبُدُونِ ۝ 
    """, russian: """
    Бинобарин, Биз сиздан олдин юборган ҳеч бир пайғамбар йўқки, унга: "Шубҳасиз, Мендан бошқа ҳеч бир илоҳ йўқ, бас, Менга бандалик қилинглар", дея ваҳй қилмаган бўлсак (21/Анбиё, 25).
    """),
    DailyArabicRussianModel(arabic: """
    وَذَا النُّونِ اِذْ ذَهَبَ مُغَاضِبًا فَظَنَّ اَنْ لَنْ نَقْدِرَ عَلَيْهِ فَنَادٰى فِي الظُّلُمَاتِ اَنْ لَٓا اِلٰهَ اِلَّا اَنْتَ سُبْحَانَكَۗ اِنّ۪ي كُنْتُ مِنَ الظَّالِم۪ينَۚ ۝ 
    """, russian: """
    Зуннунни (балиқ эгаси бўмиш Юнусни) ҳам (эсланг). Вақтида у (қавмидан) ғазабланган ҳолда (чиқиб) кетган эди ва Биз уни торликка олмаслигимизни (қутулиб кетишини) гумон қилган эди. Ниҳоят, зулматлар ичида (балиқ қорни, денгиз қари ва кеча  зулматида туриб): "Сендан бошқа илоҳ йўқ, Сен (ҳар қандай нуқсон сифатларидан) поксан. Дарҳақиқат, мен (бу ҳаракатим билан) ўз-ўзимга зулм қилувчилардан бўлдим", деб нидо-илтижо қилди (21/Анбиё, 87).

    """),
    DailyArabicRussianModel(arabic: """
    فَتَعَالَى اللّٰهُ الْمَلِكُ الْحَقُّ لَٓا اِلٰهَ اِلَّا هُوَۚ رَبُّ الْعَرْشِ الْكَر۪يمِ ۝ 
    """, russian: """
Ҳақ ҳукмдор бўлган Аллоҳ беҳад олийдир. Ундан бошқа илоҳ йўқ. (У) буюк-карамли Аршнинг Раббидир (23/Муминун, 116).    
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَ رَبُّ الْعَرْشِ الْعَظ۪يمِ ۝ 
    """, russian: """
    Аллоҳки, Ундан бошқа ҳеч бир илоҳ йўқ,  У буюк  Аршнинг Рабби (эгаси)дир!  (27/Намл, 26).
    """),
    DailyArabicRussianModel(arabic: """
وَلَا تَدْعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَۢ لَٓا اِلٰهَ اِلَّا هُوَ۠ كُلُّ شَيْءٍ هَالِكٌ اِلَّا وَجْهَهُۜ لَهُ الْحُكْمُ وَاِلَيْهِ تُرْجَعُونَ ۝     
    """, russian: """
    Аллоҳ билан бирга бошқа бир илоҳга илтижо-ибодат қилманг!  Ундан бошқа ҳеч бир илоҳ йўқ! Унинг зотидан бошқа (моддий) ҳамма нарса ҳалок бўлгувчидир. Ҳукм ва (мутлақ ҳукмронлик) ёлғиз Уникидир ва сизлар фақат Унгагина қайтарилгайсиз. (28/Қасас, 88).

    """),
    DailyArabicRussianModel(arabic: """
    يَٓا اَيُّهَا النَّاسُ اذْكُرُوا نِعْمَتَ اللّٰهِ عَلَيْكُمْۜ هَلْ مِنْ خَالِقٍ غَيْرُ اللّٰهِ يَرْزُقُكُمْ مِنَ السَّمَٓاءِ وَالْاَرْضِۜ لَٓا اِلٰهَ اِلَّا هُوَۘ فَاَنّٰى تُؤْفَكُونَ ۝ 
    """, russian: """
Эй инсонлар! Аллоҳнинг сизларга бўлган нематини ёд этинглар!  Сизларга осмондан ва ердан ризқ берадиган Аллоҳдан бошқа бир яратгувчи борми?! Ундан бошқа ҳеч бир илоҳ йўқ! У ҳолда қандай (иймондан) ўгирилиб кетмоқдасизлар (ва бошқа борлиқларга сиғинмоқдасизлар)?! 
 (35/Фотир, 3).
    """),
    DailyArabicRussianModel(arabic: """
اِنَّهُمْ كَانُٓوا اِذَا ق۪يلَ لَهُمْ لَٓا اِلٰهَ اِلَّا اللّٰهُ يَسْتَكْبِرُونَۙ ۝     
    """, russian: """
    Чунки уларга (мужрим-гуноҳкорларга): "Аллоҳдан бошқа ҳеч бир илоҳ йўқ"  дейилган вақтда такаббурлик қилар эдилар   (37/Соффат,  35).
    """),
    DailyArabicRussianModel(arabic: """
    قُلْ اِنَّمَٓا اَنَا۬ مُنْذِرٌۗ وَمَا مِنْ اِلٰهٍ اِلَّا اللّٰهُ الْوَاحِدُ الْقَهَّارُۚ ۝ 
    """, russian: """
    (Эй Расулим!) Айтинг: "Мен фақат (Аллоҳ номидан) бир огоҳлантирувчиман!  Ягона ва қаҳр қилгувчи Аллоҳдан бошқа илоҳ йўқ!  (38/Сод, 65).
    """),
    DailyArabicRussianModel(arabic: """
    حٰمٓۜ   ۝   تَنْز۪يلُ الْكِتَابِ مِنَ اللّٰهِ الْعَز۪يزِ الْعَل۪يمِۙ   ۝   غَافِرِ الذَّنْبِ وَقَابِلِ التَّوْبِ شَد۪يدِ الْعِقَابِ ذِي الطَّوْلِۜ لَٓا اِلٰهَ اِلَّا هُوَۜ اِلَيْهِ الْمَص۪يرُ ۝ 
    """, russian: """
    Ҳа.  Мим. Бу Китобнинг нозил қилиниши мутлақ ғолиб ва (ҳамма нарсани) ҳаққоний билгувчи, гуноҳни мағфират қилгувчи, тавбани қабул этгувчи, азоби шиддатли бўлган, ҳам яна лутфу карам соҳиби бўлган Аллоҳ тарафидандир. Ундан бошқа ҳеч бир илоҳ йўқ. Қайтиш фақат Унгадир. (40/Мумин/Ғофир,  1-3).
    """),
    DailyArabicRussianModel(arabic: """
    هُوَ الْحَيُّ لَٓا اِلٰهَ اِلَّا هُوَ فَادْعُوهُ مُخْلِص۪ينَ لَهُ الدّ۪ينَۜ اَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَم۪ينَ ۝ 
    """, russian: """
    У ҳамиша тирикдир. Бошқа ҳеч бир илоҳ йўқ, фақат У (Аллоҳ) бор. Динни ёлғиз Унга хос қилиб, ихлосли холда Унга дуо қилинглар. Ҳамд  (фақатгина) оламлар Рабби бўлган Аллоҳгадир  (40/Мумин/Ғофир, 65).
    """),
    DailyArabicRussianModel(arabic: """
    رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَٓا اِلٰهَ اِلَّا هُوَ فَاتَّخِذْهُ وَك۪يلًا ۝ رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَٓا اِلٰهَ اِلَّا هُوَ فَاتَّخِذْهُ وَك۪يلًا ۝ 
    """, russian: """
    У машриқнинг ва мағрибнинг Раббидир. Ундан бошқа ҳеч бир илоҳ йўқ. Ёлғиз Уни вакийл тутинг (Унга боғланинг ва ёлғиз Унга қуллуқ қилинг)  (73/Музаммил, 9).
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ  ۝   وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ ۝ 
    """, russian: """
    хадиси шарифлар
    
    
    Аллоҳим! Мени ҳалолинг билан қаноатлантир, ҳаром (ризқ)ларингдан узоқлаштир!  Фазлу караминг билан мени бадавлат қил - Ўзингдан ўзгага муҳтож айлама!
    """),
    DailyArabicRussianModel(arabic: """
رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ   ۝   وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ    ۝    وَامْكُرْ لِي وَلَا تَمْكُرْ عَلَيَّ   ۝   وَاهْدِنِي وَيَسِّرِ الْهُدٰى لِي   ۝   وَانْصُرْنِي عَلٰى مَنْ بَغٰى عَلَيَّ   ۝   رَبِّ اجْعَلْنِي لَكَ شَكَّارًا لَكَ ذَكَّارًا لَكَ رَهَّابًا لَكَ مُطِيعًا   ۝   إِلَيْكَ مُخْبِتًا   ۝   إِلَيْكَ أَوَّاهًا مُنِيبًا   ۝   رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي   ۝   وَاهْدِ قَلْبِي وَسَدِّدْ لِسَانِي وَثَبِّتْ حُجَّتِي   ۝   وَاسْلُلْ سَخِيمَةَ قَلْبِي ۝     
    """, russian: """
Ё Раббим! Менга ёрдам бер, менга қарши бўлган (ноаҳл)га ёрдам қилма! Мени ғолиб қил, менга қарши бўлган (ноаҳл)ни устун қилма! Менинг фойдамга чора-тадбир қил, менга қарши бўлган (ноаҳл)ларнинг макру ҳийлаларни барбод қил! Мени тўғри йўлга бошла ва тўғри йўлда (Сенинг йўлингда) бўлмоқни менга осон қил!  Менга зулм қилгувчиларга қарши менга нусрат бер!
Ё Раббим! Мени Ўзингга шукр қилгувчилардан айла, Ўзингдан қўрқувчилардан қил ва (доим) Сенга итоат этгувчилардан айла ва Сенга тавозу этгувчилардан, Сенга қайтгувчилардан - тавба қилгувчилардан айла! Эй Раббим! Тавбамни қабул эт, гуноҳимни юв, дуойимни ижобат қил! Қалбимга ҳидоят насиб эт! Тилимни тўғри қил! Далил-ҳужжатимни собит-мустаҳкам қил. Қалбимдан нафрат туйғусини чиқариб ташла!
    
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا   ۝   وَصَغِيرِنَا وَكَبِيرِنَا    ۝   وَذَكَرِنَا وَأُنْثَانَا   ۝   وَشَاهِدِنَا وَغَائِبِنَا   ۝   اَللّٰهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِه۪ عَلَى الْإِيمَانِ   ۝   وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الْإِسْلَامِ ۝ 
    """, russian: """
    Аллоҳим! Ҳаётдагиларимизни,  ўлганларимизни,  кичикларимизни, катталаримизни,  эркакларимизни, аёлларимизни, ҳозирларимизни ва (бу ерда бўлмаган) ғолибларимизни мағфират қил! Аллоҳим! Сен биздан кимга ҳаёт берган бўлсанг, уни иймонда яшат ва биздан кимни  вафот эттирсанг, уни Исломда вафот эттир!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ أَعِنِّي عَلٰى سَكَرَاتِ الْمَوْتِ ۝ 
    """, russian: """
    Аллоҳим! Ўлим ҳолларида менга ёрдам бер.
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي     ۝    وَمَا أَنْتَ أَعْلَمُ بِه۪ مِنِّي    ۝    اَللّٰهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي وَخَطَئِي وَعَمْدِي   ۝   وَكُلُّ ذٰلِكَ عِنْدِي   ۝   اَللّٰهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ   ۝   وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ   ۝   وَمَا أَنْتَ أَعْلَمُ بِه۪ مِنِّي   ۝   أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ ۝ 
    """, russian: """
    Аллоҳим! Хато - гуноҳларимни, жаҳолат (билан қилган қилмишлар)имни, ҳаддан ошиб қилган (айб) ишларимни ва мендан кўра Ўзинг яхши билган қилмишларимни ва мендан кўра ўзинг яхши билган қилмишларимни кечир! Аллоҳим! Жиддий ва ҳазил (билан қилган иш)ларимни, хатоан ва қасдан қилган қилмишларимники, буларнинг ҳаммаси менда бордик, кечир! Аллоҳим! Олдин қилган ва кейин қиладиган, яширин ва ошкор қилган ва мендан кўра Ўзинг яхши билган гуноҳларимни кечир! Олдинга олувчи  ҳам Сенсан, кейинга қолдирувчи ҳам Сенсан. Сен ҳамма нарсага қодирсан! 
    """),
    DailyArabicRussianModel(arabic: """
لَا إِلٰهَ إِلَّا اللّٰهُ الْحَلِيمُ الْكَرِيمُ   ۝   سُبْحَانَ اللّٰهِ رَبِّ الْعَرْشِ الْعَظِيمِ   ۝   اَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِينَ  ۝   أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ   ۝   وَعَزَائِمَ مَغْفِرَتِكَ   ۝    وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ   ۝   وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ   ۝   لَا تَدَعْ لِي ذَنْبًا إِلَّا غَفَرْتَهُ   ۝   وَلَا هَمًّا إِلَّا فَرَّجْتَهُ   ۝   وَلَا حَاجَةً هِيَ لَكَ رِضًا إِلَّا قَضَيْتَهَا   ۝   يَا أَرْحَمَ الرَّاحِمِينَ ۝     
    """, russian: """
    Ҳалийм (ҳилми-юмшоқлиги беқиёс) ва Карийм (карами чексиз) бўлмиш Аллоҳдан бошқа илоҳ йўқ! Буюк Аршнинг Рабби бўлмиш Аллоҳ (бутун нуқсон сифатларидан) пок ва муназзаҳдир!  Оламлар Рабби бўлмиш Аллоҳга ҳамд бўлсин! Сендан раҳматинг сабабларини, маъфиратинг йўллари-васийлаларини, ҳар бир яхшиликдан ғанимат-нематни қўлга киритмоқни, ҳар бир яхшиликдан саломат-омон бўлмоқни тилайман!  Менда ўзинг кечирмаган бирор гуноҳ, Ўзинг кетказмаган бирор ғам қолдирма, Сенинг ризолиғингга мувофиқ ҳар бир ҳожатимни Ўзинг раво қил, эй раҳмлиларнинг энг раҳмлиси (бўлган Аллоҳим)!

    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ   ۝   وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ ۝ 
    """, russian: """
    Аллоҳим! Берган нематинг йўқ бўлишидан,  берган офиятинг - сиҳат-саломатлик, тинчлик хотиржамлигинг бузилишидан, бирдан келадиган интиқоминг - жазоингдан ва ғазабингни келтирадиган ҳамма нарсадан Ўзингдан паноҳ тилайман!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اهْدِنِي وَسَدِّدْنِي ۝ 
    """, russian: """
    Аллоҳим! Мени ҳидоят қил ва тўғри йўлда менга муваффақият бер! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ   ۝   وَعَافِنِي فِيمَنْ عَافَيْتَ  ۝   وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ   ۝   وَبَارِكْ لِي فِيمَا أَعْطَيْتَ   ۝   وَقِنِي شَرَّ مَا قَضَيْتَ   ۝   فَإِنَّكَ تَقْضِي وَلَا يُقْضٰى عَلَيْكَ  ۝   وَإِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ   ۝   تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ ۝ 
    """, russian: """
    Аллоҳим! Ҳидоят этган (банда)ларинг қатори мени ҳидоят қил!  Офият (тинчлик-омонлик, соғлик-саломатлик) берган (банда)ларинг қатори менга ҳам офият бер!  Дўст тутган бандаларинг қатори мени ҳам дўст тут! Ато этган ҳамма нарсаларингни мен учун ҳам муборак-баракотли қил! Тақдир қилган нарсаларинг ёмонлигидан мени асра!  Албатта, Сен (хоҳлаган нарсангни) тақдир қилурсан ва Сенинг тақдирингга қарши ҳукм қилинмас! Сен дўст тутган (сен ҳимоя қилган) киши ҳор бўлмас! Эй Раббимиз!  Сен (ҳар турли нуқсонлардан поксан) буюксан ва олийсан!
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيمِ   ۝   رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ   ۝   مُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْقُرْاٰنِ الْعَظِيمِ   ۝   أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ   ۝    وَأَنْتَ الْاٰخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ   ۝   وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ   ۝   وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ   ۝   اِقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ ۝     
    """, russian: """
    Аллоҳим! Эй, етти қават осмоннинг ва буюк Аршнинг Рабби! Эй, бизнинг Раббимиз ва ҳамма нарсанинг Рабби! Эй Тавротни,  Инжилни ва Қурони азимни нозил қилган Зот! Сен Ўзидан  олдин ҳеч  нарса мавжуд бўлмаган Аввалсан! Сен ўзидан кейин ҳеч нарса бўлмайдиган Охирсан! Сен ўзидан юқори ҳеч нарса бўлмаган Зоҳирсан! Сен ўзидан ўзга ҳеч нарса бўлмаган Ботинсан!  Бизни қарз юкидан қутқар ва камбағалликдан бизни халос айла(б бадавлат қил)!

    """),
    DailyArabicRussianModel(arabic: """
    اَلْحَمْدُ لِلّٰهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَكَفَانَا وَاٰوَانَا   ۝   فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ ۝ 
    """, russian: """
    Бизга едириб ичирган, ҳожатларимизни қондирган ва бизга манзилу макон берган Аллоҳга ҳамд бўлсин! Ҳожатларини раво қилувчиси ва бошпана берувчиси бўлмаган қанчадан-қанча инсонлар бор!
    """),
  ],
  [
    DailyArabicRussianModel(arabic: """
رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَٓا اُمَّةً مُسْلِمَةً لَكَۖ وَاَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَاۚ اِنَّكَ اَنْتَ التَّوَّابُ الرَّح۪يمُ ۝     
    """, russian: """
    "Эй Раббимиз! Иккимизни ҳам Ўзингга таслим бўлганлардан айла! Зурриётимиздан ҳам Ўзингга  бўйсунган (мусулмон) бир уммат пайдо қил! Бизга ибодат жойлари (ва усуллари)ни кўрсат!  (Бандалик билан йўл қўйган нуқсонларимизни авф айлаб) тавбамизни қабул эт! Чунки Сен тавбаларни кўп қабул қилгувчи ва бениҳоят раҳмли Зотсан!"  (2/Бақара, 128)
    """),

    DailyArabicRussianModel(arabic: """
    وَمِنْهُمْ مَنْ يَقُولُ رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْاٰخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ ۝ 
    """, russian: """
    Улардан базилари эса: "Эй Раббимиз! Бизга дунёда ҳам яхшилик, охиратда ҳам яхшилик ато қил ва бизни дўзах азобидан асра!" - деди  (2/Бақара, 201).

    """),
    DailyArabicRussianModel(arabic: """
لَا يُكَلِّفُ اللّٰهُ نَفْسًا اِلَّا وُسْعَهَاۜ لَهَا مَا كَسَبَتْ وَعَلَيْهَا 
مَااكْتَسَبَتْۜ رَبَّنَا لَا تُؤَاخِذْنَٓا اِنْ نَس۪ينَٓا اَوْ اَخْطَأْنَاۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَٓا اِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذ۪ينَ مِنْ قَبْلِنَاۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِه۪ۚ وَاعْفُ عَنَّا۠ وَاغْفِرْ لَنَا۠ وَارْحَمْنَا۠ اَنْتَ مَوْلٰينَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِر۪ينَ ۝ 
    
    """, russian: """
Аллоҳ бирор кишини (ибодат ва итоатда) кучи етганидан ташқари (ортиқ) нарсага таклиф этмас. (Ҳар кимнинг) қилган (яхши) амали ўз фойдасига, қилмиш (ёмонликлар)и ҳам ўз зараригадир. "Эй Раббимиз! Унутсак ёки (беихтиёр) хато қилсак, бизни сўроққа тутма! Эй Раббимиз! Биздан олдинги (итоатсиз уммат)ларга юклаганинг каби бизларга (қийин, ҳалок этувчи) бир юк юклама! Эй Раббимиз! Кучимиз етмайдиган нарсаларни бизларга кўтартирма! Бизни авф эт, бизни мағфират айла, бизга раҳм қил! Сен Мавломиз (Эгамиз)сан; (Сени танимаган) кофирлар қавми устидан бизларга нусрат бер - ғалаба эҳсон айла!  (2/Бақара, 286).
    
    """),
    DailyArabicRussianModel(arabic: """
    
    """, russian: """
    
    """),
    DailyArabicRussianModel(arabic: """
    
    """, russian: """
    
    """),
    DailyArabicRussianModel(arabic: """
    
    """, russian: """
    
    """),
    DailyArabicRussianModel(arabic: """
    
    """, russian: """
    
    """),
    DailyArabicRussianModel(arabic: """
    
    """, russian: """
    
    """),
    DailyArabicRussianModel(arabic: """
    
    """, russian: """
    
    """),
    DailyArabicRussianModel(arabic: """
    
    """, russian: """
    
    """),
    DailyArabicRussianModel(arabic: """
    
    """, russian: """
    
    """),
    DailyArabicRussianModel(arabic: """
    
    """, russian: """
    
    """),
    DailyArabicRussianModel(arabic: """
    
    """, russian: """
    
    """),

  ],
  [
    DailyArabicRussianModel(arabic: """
وَكَاَيِّنْ مِنْ دَٓابَّةٍ لَا تَحْمِلُ رِزْقَهَاۗ اَللّٰهُ يَرْزُقُهَا وَاِيَّاكُمْۘ وَهُوَ السَّم۪يعُ الْعَل۪يمُ ۝ 
    """, russian: """
    Қанча жонзод (махлуқ) борки,  ўз ризқини (ўзи) кўтара олмас. Уларга ҳам, сизларга ҳам Аллоҳ ризқ берур. У  ҳаққоний эшитгувчидир, билгувчидир  (29/Анкабут, 60).
    """),
  ],
  [
    DailyArabicRussianModel(arabic: """
وَكَاَيِّنْ مِنْ دَٓابَّةٍ لَا تَحْمِلُ رِزْقَهَاۗ اَللّٰهُ يَرْزُقُهَا وَاِيَّاكُمْۘ وَهُوَ السَّم۪يعُ الْعَل۪يمُ ۝ 
    """, russian: """
    Қанча жонзод (махлуқ) борки,  ўз ризқини (ўзи) кўтара олмас. Уларга ҳам, сизларга ҳам Аллоҳ ризқ берур. У  ҳаққоний эшитгувчидир, билгувчидир  (29/Анкабут, 60).
    """),
  ],
  [
    DailyArabicRussianModel(arabic: """
وَكَاَيِّنْ مِنْ دَٓابَّةٍ لَا تَحْمِلُ رِزْقَهَاۗ اَللّٰهُ يَرْزُقُهَا وَاِيَّاكُمْۘ وَهُوَ السَّم۪يعُ الْعَل۪يمُ ۝ 
    """, russian: """
    Қанча жонзод (махлуқ) борки,  ўз ризқини (ўзи) кўтара олмас. Уларга ҳам, сизларга ҳам Аллоҳ ризқ берур. У  ҳаққоний эшитгувчидир, билгувчидир  (29/Анкабут, 60).
    """),
  ],
];
