import 'models/daily_zikr_arab_krill_model.dart';

List<List<DailyArabicRussianModel>> dailyData = [
  [
    DailyArabicRussianModel(arabic:
    """    
اِذْ هَمَّتْ طَٓائِفَتَانِ مِنْكُمْ اَنْ تَفْشَلَاۙ وَاللّٰهُ وَلِيُّهُمَاۜ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ   ۝   وَلَقَدْ نَصَرَكُمُ اللّٰهُ بِبَدْرٍ وَاَنْتُمْ اَذِلَّةٌۚ فَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تَشْكُرُونَ   ۝ 
    """, russian:
    """
    Ўшанда, (Уҳуд ғазотида) сизлардан икки тоифа - Аллоҳ уларнинг мададкори бўлгани ҳолда - қўрқувга тушиб, (лашкарнинг икки қанотидан) орқага чекинишга ниятланган эди. Ҳолбуки, мўминлар фақатгина Аллоҳга таваккал қилмоқларини (ишониб-таянмоқлари) лозимдир. Муҳаққақки, Бадр (ғазоти)да сизлар (аскар ва қурол-яроқ жиҳатидан) заифроқ бўла туриб, Аллоҳ сизларга  ёрдам  бери (ва ғалаба  ато қилди). Бас, Аллоҳга тақво қилинглар - амрига мос яшанглар, токи шукр қилгувчи бўлинглар (3/Оли Имрон, 122-123).
    """),
    DailyArabicRussianModel(arabic: """    
اِنْ يَنْصُرْكُمُ اللّٰهُ فَلَا غَالِبَ لَكُمْۚ وَاِنْ يَخْذُلْكُمْ فَمَنْ ذَا الَّذ۪ي يَنْصُرُكُمْ مِنْ بَعْدِه۪ۜ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ۝ 
    """, russian: """
    Агар Аллоҳ ёрдам берса, баски, сизларнинг устингиздан ғолиб келадиган ҳеч ким бўлмас. Агар (сизлар Аллоҳ ва Унинг Расулига боғлиқликдан узилиб) У сизларни ёрдамсиз қолдирса, ундан кейин сизларга ким ёрдам бера олур? Шундоқ экан, мўминлар фақат Аллоҳга таваккул қилсинлар (суяниб таянсизлар)  (3/Оли Имрон,  160).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّمَا الْمُؤْمِنُونَ الَّذ۪ينَ اِذَا ذُكِرَ اللّٰهُ وَجِلَتْ قُلُوبُهُمْ وَاِذَا تُلِيَتْ عَلَيْهِمْ اٰيَاتُهُ زَادَتْهُمْ ا۪يمَانًا وَعَلٰى رَبِّهِمْ يَتَوَكَّلُونَۚ ۝ 
    """, russian: """
    (Чин манодаги) мўминлар (фақат) ул кишилардирки, Аллоҳнинг номи зикр қилинган вақтда қалблари титрар,  Унинг оятлари уларга тиловат қилинган вақт (бу)  уларнинг иймон (нур)ларини зиёда қилур (қувватлантирур).  Ва (барча ишларида) ўз Раббига таваккул қилурлар-таяниб-суянурлар (8/Анфол, 2).
    """),
    DailyArabicRussianModel(arabic: """
    َلِلّٰهِ غَيْبُ السَّمٰوَاتِ وَالْاَرْضِ وَاِلَيْهِ يُرْجَعُ الْاَمْرُ كُلُّهُ فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِۜ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ ۝ 
    """, russian: """
    Осмонларнинг ва ернинг ғайби(ни билмоқ) Аллоҳга хосдир. Барча ишлар фақатгина Унга қайтарилур. У ҳолда Унга бандалик қилинг, Унга таваккул қилинг - таяниб - суянинг! Раббингиз қилаётган амалларингиздан асло беҳабар эмасдир (11/Ҳуд,  123).
    """),
    DailyArabicRussianModel(arabic: """
    اَلَّذ۪ينَ صَبَرُوا وَعَلٰى رَبِّهِمْ يَتَوَكَّلُونَ
    """, russian: """
    Улар (озор-азиятларга) сабр қилинглар ва ўз Раббингизга таваккул қиладиганлардир (16/Наҳл, 42).
    """),
    DailyArabicRussianModel(arabic: """
    وَتَوَكَّلْ عَلَى الْعَز۪يزِ الرَّح۪يمِۙ ۝ 
    """, russian: """
    Сиз (фақатгина) мутлақ ғолиб ва бениҳоят раҳимли Зот (бўлмиш Аллоҳ)га таваккул қилинг (26/Шуаро,  217).
    """),
    DailyArabicRussianModel(arabic: """
    فَتَوَكَّلْ عَلَى اللّٰهِۜ اِنَّكَ عَلَى الْحَقِّ الْمُب۪ينِ ۝ 
    """, russian: """
    (Эй Расулим!)  бу ҳолда сиз Аллоҳга таваккул қилинг - таяниб - суянинг!  Чунки сиз очиқ ҳақиқат узрадирсиз!  (27/Намл, 79).
    """),
    DailyArabicRussianModel(arabic: """
    وَتَوَكَّلْ عَلَى اللّٰهِۜ وَكَفٰى بِاللّٰهِ وَك۪يلًا ۝ 
    """, russian: """
    Аллоҳга таваккул қилинг! Вакийл ўлароқ Аллоҳ етарлидир! (33/Азҳоб, 3).
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۜ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ۝ 
    """, russian: """
    Аллоҳ шундай Зотки,  Ундан бошқа ҳеч бир илоҳ йўқдир.  Бас, мўминлар фақат Аллоҳга таваккул қилсинлар - таянсинлар (64/Тағобун, 13).
    """),
    DailyArabicRussianModel(arabic: """
    وَمَنْ يَتَّقِ اللّٰهَ يَجْعَلْ لَهُ مَخْرَجًاۙ ۝ وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُۜ وَمَنْ يَتَوَكَّلْ عَلَى اللّٰهِ فَهُوَ حَسْبُهُۜ اِنَّ اللّٰهَ بَالِغُ اَمْرِه۪ۜ قَدْ جَعَلَ اللّٰهُ لِكُلِّ شَيْءٍ قَدْرًا   ۝ 
    """, russian: """
    Ким Аллоҳга тақво қил(иб амалларига юр)са, (Аллоҳ)  уни бир (омонликка) чиқиш йўлини пайдо қилур. Уни ўзи ўйламаган томондан ризқлантириб қўюр. Ким Аллоҳга таваккул қилса -  таянса, У Зот унга етарлидир! Шубҳасизки, Аллоҳ Ўз ишини бажо келтиргувчидир! Аллоҳ ҳамма нарса учун бир ўлчов (бир чегара) муқаррар қилингандир (65/Талоқ, 2-3).
    """),
    DailyArabicRussianModel(arabic: """
    قُلْ هُوَ الرَّحْمٰنُ اٰمَنَّا بِه۪ وَعَلَيْهِ تَوَكَّلْنَاۚ فَسَتَعْلَمُونَ مَنْ هُوَ ف۪ي ضَلَالٍ مُب۪ينٍ  ۝   قُلْ اَرَاَيْتُمْ اِنْ اَصْبَحَ مَٓاؤُ۬كُمْ غَوْرًا فَمَنْ يَأْت۪يكُمْ بِمَٓاءٍ مَع۪ينٍ ۝  
    """, russian: """
    Айтинг: "У (Аллоҳ) Раҳмондир (дунёда барча махлуқотига  раҳм қилиб, немат бергувчидир). Биз Унга иймон келтирдик ва Унинг ўзига таваккул қилдик -  таяндик. Бас, ким очиқ гумроҳликда эканини яқинда билурсизлар! "Айтинг: сўзланглар-чи,  агар сувларингиз ер остига сингиб кетса,  ким сизларга оқар сувни (кашф этиб) келтира олур?! (Албатта, фақат Аллоҳ келтирур!)"  (67/Мулк, 29-30).
    """),
    DailyArabicRussianModel(arabic: """
    حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلٰوةِ الْوُسْطٰى وَقُومُوا لِلّٰهِ قَانِت۪ينَ ۝
    """, russian: """
    Намозларни ва (булар орасида) ўрта намозни (ғайрат билан) бардавом сақланглар;  Аллоҳнинг ҳузурида сидқидилдан бўйин эгган ҳолда (вақтга  ва арконга  риоя этиб) тўлиқ таслимият  билан туринглар (2/Бақара,  238).
    """),
    DailyArabicRussianModel(arabic: """
    وَالَّذ۪ينَ يُؤْمِنُونَ بِالْاٰخِرَةِ يُؤْمِنُونَ بِه۪ وَهُمْ عَلٰى صَلَاتِهِمْ يُحَافِظُونَ ۝ 

    """, russian: """
    Охиратга ишонганлар унга (Қуронга) ҳам ишонурлар ва улар намозларида бардавом бўлурлар (6/Аном, 92).
    """),
    DailyArabicRussianModel(arabic: """
    وَالْحَافِظُونَ لِحُدُودِ اللّٰهِۜ وَبَشِّرِ الْمُؤْمِن۪ينَ ۝ 
    """, russian: """
(У мўминлар) Аллоҳнинг чегараларини (белгилаган ҳукмларини) сақловчилардир. (Ана шундай) мўминларга (жаннатдан) хушхабар беринг! (9/Тавба, 112).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّ رَبّ۪ي عَلٰى كُلِّ شَيْءٍ حَف۪يظٌ ۝
    """, russian: """
    "Раббим ҳамма нарсани сақлаб (кузатиб) тургувчидир" (11/Ҳуд,  57).
    """),
    DailyArabicRussianModel(arabic: """
    وَاِنَّا لَهُ لَحَافِظُونَ ۝ 
    """, russian: """
"Ҳеч шубҳасиз,  биз уни жуда яхши сақлаб - қўриқлаймиз" (12/Юсуф, 12).
    """),
    DailyArabicRussianModel(arabic: """
    فَاللّٰهُ خَيْرٌ حَافِظًاۖ وَهُوَ اَرْحَمُ الرَّاحِم۪ينَ ۝ 
    """, russian: """
    "(Бирон бир кимса эмас) энг яхши муҳофаза қилгувчи Аллоҳдир.  Ва У раҳмлиларнинг энг раҳимлисидир" (12/Юсуф, 64).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَاِنَّا لَهُ لَحَافِظُونَ ۝ 
    """, russian: """
    Муҳаққақки, Зикрни  (Қуронни) Биз  нозил қилдик;  шубҳасиз, уни асрагувчи ҳам фақат билдирмиз (15/Ҳижр, 9).
    """),
    DailyArabicRussianModel(arabic: """    
لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِه۪ يَحْفَظُونَهُ مِنْ اَمْرِ اللّٰهِۜ اِنَّ اللّٰهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتّٰى يُغَيِّرُوا مَا بِاَنْفُسِهِمْۜ وَاِذَٓا اَرَادَ اللّٰهُ بِقَوْمٍ سُٓوءًا فَلَا مَرَدَّ لَهُۚ وَمَا لَهُمْ مِنْ دُونِه۪ مِنْ وَالٍ ۝ 
    """, russian: """
    У (инсон фарзанди)нинг олдида орқасида тақиб этувчи (кузатувчи фаришталар) бордирки, Аллоҳнинг амри или уни муҳофаза қилурлар Муҳаққақки, бир қавм то ўзларини  (ички оламларини) ўзгартир(иб буз)магунича, Аллоҳ уларнинг аҳволларини ўзгартир(иб буз)мас. Аллоҳ (амирларидан юз ўгирмас) бир қавмга бир ёмонликни ирода қилса,  бас, уни орқага қайтариладиган йўқдир. Улар учун Ундан бошқа бир валий (асраб, ёрдам, қилувчи) йўқдир (13/Рад, 11)
    """),
    DailyArabicRussianModel(arabic: """
    وَجَعَلْنَا السَّمَٓاءَ سَقْفًا مَحْفُوظًاۚ وَهُمْ عَنْ اٰيَاتِهَا مُعْرِضُونَ ۝ 
    """, russian: """
Осмонни (қулаб тушишдан ва бузилишдан) муҳофаза этилган бир  шифт қилиб қўйдик. У (инкор этувчи)лар эса Унинг оят - аломатларидан  юз ўгирмоқдалар (21/Анбиё, 32). 
    """),
    DailyArabicRussianModel(arabic: """
    وَرَبُّكَ عَلٰى كُلِّ شَيْءٍ حَف۪يظٌ۟ ۝ 
    """, russian: """
    Раббингиз ҳар бир нарсани кузатиб - сақлаб тургувчидир ( 34/Саба, 21). 
    """),
    DailyArabicRussianModel(arabic: """
وَحِفْظًا مِنْ كُلِّ شَيْطَانٍ مَارِدٍۚ ۝     
    """, russian: """
    Ва (у осмонни) ҳар бир итоатдан чиққан саркаш шайтондан муҳофаза қилиб қўйдик (37/Соффат, 7).
    """),
    DailyArabicRussianModel(arabic: """
    وَزَيَّنَّا السَّمَٓاءَ الدُّنْيَا بِمَصَاب۪يحَۗ وَحِفْظًاۜ  ذٰلِكَ تَقْد۪يرُ الْعَز۪يزِ الْعَل۪يمِ ۝ 
    """, russian: """
    Биз дунё осмонини  (Ерга яқин осмонни) чироқлар билан зийнатладик ва (офатлардан) муҳофаза қилиб қўйдик. Бу мутлақ ғолиб - устун ва (ҳамма нарсани) ҳаққоний билгувчи Зот (Аллоҳ)нинг тақдиридир (41/Фуссилат,  12).
    """),
    DailyArabicRussianModel(arabic: """
    اِنْ كُلُّ نَفْسٍ لَمَّا عَلَيْهَا حَافِظٌۜ ۝ 
    """, russian: """
    Ҳеч бир жон йўқки,  унинг тепасида (уни кўриб кузатиб тургувчи) бир сақловчи -  муҳофиз  (фаришта) бўлмаса!  (86/Ториқ, 4).
    """),
    DailyArabicRussianModel(arabic: """
قُلْ لَنْ يُص۪يبَنَٓا اِلَّا مَا كَتَبَ اللّٰهُ لَنَاۚ هُوَ مَوْلٰينَاۚ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ۝   
    """, russian: """
    Айтингки:  "Аллоҳ биз учун (тақдирда) ёзганидан бошқа нарса бизга асло етмас. Бизнинг Мавломиз (Эгамиз, мададкор,  дўстимиз)дир. Шу боис мўминлар  фақат Аллоҳга таваккул  қилсинглар - суяниб - таянсинлар"  (9/Тавба, 51).
    """),
    DailyArabicRussianModel(arabic: """
    وَاِنْ يَمْسَسْكَ اللّٰهُ بِضُرٍّ فَلَا كَاشِفَ لَهُٓ اِلَّا هُوَۚ وَاِنْ يُرِدْكَ بِخَيْرٍ فَلَا رَٓادَّ لِفَضْلِه۪ۜ يُص۪يبُ بِه۪ مَنْ يَشَٓاءُ مِنْ عِبَادِه۪ۜ وَهُوَ الْغَفُورُ الرَّح۪يمُ ۝ 
    """, russian: """
    Агар Аллоҳ сенга бир зарар етказса, бас, Ўзидан бошқа даф этадиган (ҳеч бир куч) йўқ. Агар сенга бир яхшиликни раво кўрса, Унинг фазлу карамини орқага қайтарадиган ҳеч бир қувват ҳам йўқдир. У бандаларидан хоҳлаганини бунга эриштирур.  У беҳад мағфиратли,  бениҳоят раҳимлидир (10/Юнус, 107).
    """),
    DailyArabicRussianModel(arabic: """
    وَمَا مِنْ دَٓابَّةٍ فِي الْاَرْضِ اِلَّا عَلَى اللّٰهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَاۜ كُلٌّ ف۪ي كِتَابٍ مُب۪ينٍ ۝ 
    """, russian: """
    Ер юзида қимирлаган жон борки, унинг ризқи Аллоҳнинг зиммасидадир.  (Аллоҳ) уларнинг қарор топган жойларини ҳам,  омонат турадиган (вақтинча қоладиган ёки тупроққа топшириладиган) жойларини ҳам билур. Ҳаммаси очиқ  Китобда (Лавҳул - Маҳфузда мавжуд)дир  (11/Ҳуд, 6).
    """),
    DailyArabicRussianModel(arabic: """
    اِنّ۪ي تَوَكَّلْتُ عَلَى اللّٰهِ رَبّ۪ي وَرَبِّكُمْۜ مَا مِنْ دَٓابَّةٍ اِلَّا هُوَ اٰخِذٌ بِنَاصِيَتِهَاۜ اِنَّ رَبّ۪ي عَلٰى صِرَاطٍ مُسْتَق۪يمٍ ۝ 
    """, russian: """
(Ҳуд алайҳиссалом деди:) Шубҳасиз, мен - менинг ҳам Раббим,  сизнинг ҳам Раббингиз бўлган Аллоҳга таваккул қилдим -- суяниб - таяндим!  Ҳеч бир жонзот йўқки, У зот унинг манглайидан  тутган (уни  Ўз ҳукми ва иродаси остига олган) бўлмаса. Шубҳасиз, менинг Раббим тик-тўғри йўлдадир (У одилдир, ҳукм ва тасарруфида ҳаққоният узрадир, ҳеч кимга зулм ва ноҳақлик қилмас) (11/Ҳуд, 56).
"""),
    DailyArabicRussianModel(arabic: """    
وَكَاَيِّنْ مِنْ دَٓابَّةٍ لَا تَحْمِلُ رِزْقَهَاۗ اَللّٰهُ يَرْزُقُهَا وَاِيَّاكُمْۘ وَهُوَ السَّم۪يعُ الْعَل۪يمُ ۝ 
    """, russian: """
    Қанча жонзод (махлуқ) борки,  ўз ризқини (ўзи) кўтара олмас. Уларга ҳам, сизларга ҳам Аллоҳ ризқ берур. У  ҳаққоний эшитгувчидир, билгувчидир  (29/Анкабут, 60).
    """),
    // Todo Start 30
  ],
  [],
  [],
  [],
  [],
  [],
];
