import '../../ui/home/data/models/poem_model.dart';
import '../../ui/zikr/data/models/daily_zikr_arab_krill_model.dart';

List<List<DailyArabicRussianModel>> dailyData = [
  // Monday
  [
    DailyArabicRussianModel(arabic: """
اِذْ هَمَّتْ طَٓائِفَتَانِ مِنْكُمْ اَنْ تَفْشَلَاۙ وَاللّٰهُ وَلِيُّهُمَاۜ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ   ۝   وَلَقَدْ نَصَرَكُمُ اللّٰهُ بِبَدْرٍ وَاَنْتُمْ اَذِلَّةٌۚ فَاتَّقُوا اللّٰهَ لَعَلَّكُمْ تَشْكُرُونَ   ۝ 
    """, russian: """
    Ўшанда, (Уҳуд ғазотида) сизлардан икки тоифа - Аллоҳ уларнинг мададкори бўлгани ҳолда - қўрқувга тушиб, (лашкарнинг икки қанотидан) орқага чекинишга ниятланган эди. Ҳолбуки, мўминлар фақатгина Аллоҳга таваккал қилмоқларини (ишониб-таянмоқлари) лозимдир. Муҳаққақки, Бадр (ғазоти)да сизлар (аскар ва қурол-яроқ жиҳатидан) заифроқ бўла туриб, Аллоҳ сизларга  ёрдам  бери (ва ғалаба  ато қилди). Бас, Аллоҳга тақво қилинглар - амрига мос яшанглар, токи шукр қилгувчи бўлинглар (3/Оли Имрон, 122-123).
    """),
    DailyArabicRussianModel(arabic: """
اِنْ يَنْصُرْكُمُ اللّٰهُ فَلَا غَالِبَ لَكُمْۚ وَاِنْ يَخْذُلْكُمْ فَمَنْ ذَا الَّذ۪ي يَنْصُرُكُمْ مِنْ بَعْدِه۪ۜ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ۝ 
    """, russian: """
    Агар Аллоҳ ёрдам берса, баски, сизларнинг устингиздан ғолиб келадиган ҳеч ким бўлмас. Агар (сизлар Аллоҳ ва Унинг Расулига боғлиқликдан узилиб) У сизларни ёрдамсиз қолдирса, ундан кейин сизларга ким ёрдам бера олур? Шундоқ экан, мўминлар фақат Аллоҳга таваккул қилсинлар (суяниб таянсизлар)  (3/Оли Имрон,  160).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّمَا الْمُؤْمِنُونَ الَّذ۪ينَ اِذَا ذُكِرَ اللّٰهُ وَجِلَتْ قُلُوبُهُمْ وَاِذَا تُلِيَتْ عَلَيْهِمْ اٰيَاتُهُ زَادَتْهُمْ ا۪يمَانًا وَعَلٰى رَبِّهِمْ يَتَوَكَّلُونَۚ ۝ 
    """, russian: """
    (Чин манодаги) мўминлар (фақат) ул кишилардирки, Аллоҳнинг номи зикр қилинган вақтда қалблари титрар,  Унинг оятлари уларга тиловат қилинган вақт (бу)  уларнинг иймон (нур)ларини зиёда қилур (қувватлантирур).  Ва (барча ишларида) ўз Раббига таваккул қилурлар-таяниб-суянурлар (8/Анфол, 2).
    """),
    DailyArabicRussianModel(arabic: """
    َلِلّٰهِ غَيْبُ السَّمٰوَاتِ وَالْاَرْضِ وَاِلَيْهِ يُرْجَعُ الْاَمْرُ كُلُّهُ فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِۜ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ ۝ 
    """, russian: """
    Осмонларнинг ва ернинг ғайби(ни билмоқ) Аллоҳга хосдир. Барча ишлар фақатгина Унга қайтарилур. У ҳолда Унга бандалик қилинг, Унга таваккул қилинг - таяниб - суянинг! Раббингиз қилаётган амалларингиздан асло беҳабар эмасдир (11/Ҳуд,  123).
    """),
    DailyArabicRussianModel(
        arabic: """اَلَّذ۪ينَ صَبَرُوا وَعَلٰى رَبِّهِمْ يَتَوَكَّلُونَ
    """,
        russian: """
    Улар (озор-азиятларга) сабр қилинглар ва ўз Раббингизга таваккул қиладиганлардир (16/Наҳл, 42).
    """),
    DailyArabicRussianModel(
        arabic: """وَتَوَكَّلْ عَلَى الْعَز۪يزِ الرَّح۪يمِۙ ۝""", russian: """
    Сиз (фақатгина) мутлақ ғолиб ва бениҳоят раҳимли Зот (бўлмиш Аллоҳ)га таваккул қилинг (26/Шуаро,  217).
    """),
    DailyArabicRussianModel(arabic: """
    فَتَوَكَّلْ عَلَى اللّٰهِۜ اِنَّكَ عَلَى الْحَقِّ الْمُب۪ينِ ۝ 
    """, russian: """
    (Эй Расулим!)  бу ҳолда сиз Аллоҳга таваккул қилинг - таяниб - суянинг!  Чунки сиз очиқ ҳақиқат узрадирсиз!  (27/Намл, 79).
    """),
    DailyArabicRussianModel(arabic: """
    وَتَوَكَّلْ عَلَى اللّٰهِۜ وَكَفٰى بِاللّٰهِ وَك۪يلًا ۝ 
    """, russian: """
    Аллоҳга таваккул қилинг! Вакийл ўлароқ Аллоҳ етарлидир! (33/Азҳоб, 3).
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۜ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ۝ 
    """, russian: """
    Аллоҳ шундай Зотки,  Ундан бошқа ҳеч бир илоҳ йўқдир.  Бас, мўминлар фақат Аллоҳга таваккул қилсинлар - таянсинлар (64/Тағобун, 13).
    """),
    DailyArabicRussianModel(arabic: """
    وَمَنْ يَتَّقِ اللّٰهَ يَجْعَلْ لَهُ مَخْرَجًاۙ ۝ وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُۜ وَمَنْ يَتَوَكَّلْ عَلَى اللّٰهِ فَهُوَ حَسْبُهُۜ اِنَّ اللّٰهَ بَالِغُ اَمْرِه۪ۜ قَدْ جَعَلَ اللّٰهُ لِكُلِّ شَيْءٍ قَدْرًا   ۝ 
    """, russian: """
    Ким Аллоҳга тақво қил(иб амалларига юр)са, (Аллоҳ)  уни бир (омонликка) чиқиш йўлини пайдо қилур. Уни ўзи ўйламаган томондан ризқлантириб қўюр. Ким Аллоҳга таваккул қилса -  таянса, У Зот унга етарлидир! Шубҳасизки, Аллоҳ Ўз ишини бажо келтиргувчидир! Аллоҳ ҳамма нарса учун бир ўлчов (бир чегара) муқаррар қилингандир (65/Талоқ, 2-3).
    """),
    DailyArabicRussianModel(arabic: """
    قُلْ هُوَ الرَّحْمٰنُ اٰمَنَّا بِه۪ وَعَلَيْهِ تَوَكَّلْنَاۚ فَسَتَعْلَمُونَ مَنْ هُوَ ف۪ي ضَلَالٍ مُب۪ينٍ  ۝   قُلْ اَرَاَيْتُمْ اِنْ اَصْبَحَ مَٓاؤُ۬كُمْ غَوْرًا فَمَنْ يَأْت۪يكُمْ بِمَٓاءٍ مَع۪ينٍ ۝  
    """, russian: """
    Айтинг: "У (Аллоҳ) Раҳмондир (дунёда барча махлуқотига  раҳм қилиб, немат бергувчидир). Биз Унга иймон келтирдик ва Унинг ўзига таваккул қилдик -  таяндик. Бас, ким очиқ гумроҳликда эканини яқинда билурсизлар! "Айтинг: сўзланглар-чи,  агар сувларингиз ер остига сингиб кетса,  ким сизларга оқар сувни (кашф этиб) келтира олур?! (Албатта, фақат Аллоҳ келтирур!)"  (67/Мулк, 29-30).
    """),
    DailyArabicRussianModel(arabic: """
    حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلٰوةِ الْوُسْطٰى وَقُومُوا لِلّٰهِ قَانِت۪ينَ ۝
    """, russian: """
    Намозларни ва (булар орасида) ўрта намозни (ғайрат билан) бардавом сақланглар;  Аллоҳнинг ҳузурида сидқидилдан бўйин эгган ҳолда (вақтга  ва арконга  риоя этиб) тўлиқ таслимият  билан туринглар (2/Бақара,  238).
    """),
    DailyArabicRussianModel(arabic: """
    وَالَّذ۪ينَ يُؤْمِنُونَ بِالْاٰخِرَةِ يُؤْمِنُونَ بِه۪ وَهُمْ عَلٰى صَلَاتِهِمْ يُحَافِظُونَ ۝ 

    """, russian: """
    Охиратга ишонганлар унга (Қуронга) ҳам ишонурлар ва улар намозларида бардавом бўлурлар (6/Аном, 92).
    """),
    DailyArabicRussianModel(arabic: """
    وَالْحَافِظُونَ لِحُدُودِ اللّٰهِۜ وَبَشِّرِ الْمُؤْمِن۪ينَ ۝ 
    """, russian: """
(У мўминлар) Аллоҳнинг чегараларини (белгилаган ҳукмларини) сақловчилардир. (Ана шундай) мўминларга (жаннатдан) хушхабар беринг! (9/Тавба, 112).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّ رَبّ۪ي عَلٰى كُلِّ شَيْءٍ حَف۪يظٌ ۝
    """, russian: """
    "Раббим ҳамма нарсани сақлаб (кузатиб) тургувчидир" (11/Ҳуд,  57).
    """),
    DailyArabicRussianModel(arabic: """
    وَاِنَّا لَهُ لَحَافِظُونَ ۝ 
    """, russian: """
"Ҳеч шубҳасиз,  биз уни жуда яхши сақлаб - қўриқлаймиз" (12/Юсуф, 12).
    """),
    DailyArabicRussianModel(arabic: """
    فَاللّٰهُ خَيْرٌ حَافِظًاۖ وَهُوَ اَرْحَمُ الرَّاحِم۪ينَ ۝ 
    """, russian: """
    "(Бирон бир кимса эмас) энг яхши муҳофаза қилгувчи Аллоҳдир.  Ва У раҳмлиларнинг энг раҳимлисидир" (12/Юсуф, 64).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَاِنَّا لَهُ لَحَافِظُونَ ۝ 
    """, russian: """
    Муҳаққақки, Зикрни  (Қуронни) Биз  нозил қилдик;  шубҳасиз, уни асрагувчи ҳам фақат билдирмиз (15/Ҳижр, 9).
    """),
    DailyArabicRussianModel(arabic: """
لَهُ مُعَقِّبَاتٌ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِه۪ يَحْفَظُونَهُ مِنْ اَمْرِ اللّٰهِۜ اِنَّ اللّٰهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتّٰى يُغَيِّرُوا مَا بِاَنْفُسِهِمْۜ وَاِذَٓا اَرَادَ اللّٰهُ بِقَوْمٍ سُٓوءًا فَلَا مَرَدَّ لَهُۚ وَمَا لَهُمْ مِنْ دُونِه۪ مِنْ وَالٍ ۝ 
    """, russian: """
    У (инсон фарзанди)нинг олдида орқасида тақиб этувчи (кузатувчи фаришталар) бордирки, Аллоҳнинг амри или уни муҳофаза қилурлар Муҳаққақки, бир қавм то ўзларини  (ички оламларини) ўзгартир(иб буз)магунича, Аллоҳ уларнинг аҳволларини ўзгартир(иб буз)мас. Аллоҳ (амирларидан юз ўгирмас) бир қавмга бир ёмонликни ирода қилса,  бас, уни орқага қайтариладиган йўқдир. Улар учун Ундан бошқа бир валий (асраб, ёрдам, қилувчи) йўқдир (13/Рад, 11)
    """),
    DailyArabicRussianModel(arabic: """
    وَجَعَلْنَا السَّمَٓاءَ سَقْفًا مَحْفُوظًاۚ وَهُمْ عَنْ اٰيَاتِهَا مُعْرِضُونَ ۝ 
    """, russian: """
Осмонни (қулаб тушишдан ва бузилишдан) муҳофаза этилган бир  шифт қилиб қўйдик. У (инкор этувчи)лар эса Унинг оят - аломатларидан  юз ўгирмоқдалар (21/Анбиё, 32). 
    """),
    DailyArabicRussianModel(arabic: """
    وَرَبُّكَ عَلٰى كُلِّ شَيْءٍ حَف۪يظٌ۟ ۝ 
    """, russian: """
    Раббингиз ҳар бир нарсани кузатиб - сақлаб тургувчидир ( 34/Саба, 21). 
    """),
    DailyArabicRussianModel(arabic: """
وَحِفْظًا مِنْ كُلِّ شَيْطَانٍ مَارِدٍۚ ۝     
    """, russian: """
    Ва (у осмонни) ҳар бир итоатдан чиққан саркаш шайтондан муҳофаза қилиб қўйдик (37/Соффат, 7).
    """),
    DailyArabicRussianModel(arabic: """
    وَزَيَّنَّا السَّمَٓاءَ الدُّنْيَا بِمَصَاب۪يحَۗ وَحِفْظًاۜ  ذٰلِكَ تَقْد۪يرُ الْعَز۪يزِ الْعَل۪يمِ ۝ 
    """, russian: """
    Биз дунё осмонини  (Ерга яқин осмонни) чироқлар билан зийнатладик ва (офатлардан) муҳофаза қилиб қўйдик. Бу мутлақ ғолиб - устун ва (ҳамма нарсани) ҳаққоний билгувчи Зот (Аллоҳ)нинг тақдиридир (41/Фуссилат,  12).
    """),
    DailyArabicRussianModel(arabic: """
    اِنْ كُلُّ نَفْسٍ لَمَّا عَلَيْهَا حَافِظٌۜ ۝ 
    """, russian: """
    Ҳеч бир жон йўқки,  унинг тепасида (уни кўриб кузатиб тургувчи) бир сақловчи -  муҳофиз  (фаришта) бўлмаса!  (86/Ториқ, 4).
    """),
    DailyArabicRussianModel(arabic: """
قُلْ لَنْ يُص۪يبَنَٓا اِلَّا مَا كَتَبَ اللّٰهُ لَنَاۚ هُوَ مَوْلٰينَاۚ وَعَلَى اللّٰهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ۝   
    """, russian: """
    Айтингки:  "Аллоҳ биз учун (тақдирда) ёзганидан бошқа нарса бизга асло етмас. Бизнинг Мавломиз (Эгамиз, мададкор,  дўстимиз)дир. Шу боис мўминлар  фақат Аллоҳга таваккул  қилсинглар - суяниб - таянсинлар"  (9/Тавба, 51).
    """),
    DailyArabicRussianModel(arabic: """
    وَاِنْ يَمْسَسْكَ اللّٰهُ بِضُرٍّ فَلَا كَاشِفَ لَهُٓ اِلَّا هُوَۚ وَاِنْ يُرِدْكَ بِخَيْرٍ فَلَا رَٓادَّ لِفَضْلِه۪ۜ يُص۪يبُ بِه۪ مَنْ يَشَٓاءُ مِنْ عِبَادِه۪ۜ وَهُوَ الْغَفُورُ الرَّح۪يمُ ۝ 
    """, russian: """
    Агар Аллоҳ сенга бир зарар етказса, бас, Ўзидан бошқа даф этадиган (ҳеч бир куч) йўқ. Агар сенга бир яхшиликни раво кўрса, Унинг фазлу карамини орқага қайтарадиган ҳеч бир қувват ҳам йўқдир. У бандаларидан хоҳлаганини бунга эриштирур.  У беҳад мағфиратли,  бениҳоят раҳимлидир (10/Юнус, 107).
    """),
    DailyArabicRussianModel(arabic: """
    وَمَا مِنْ دَٓابَّةٍ فِي الْاَرْضِ اِلَّا عَلَى اللّٰهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَاۜ كُلٌّ ف۪ي كِتَابٍ مُب۪ينٍ ۝ 
    """, russian: """
    Ер юзида қимирлаган жон борки, унинг ризқи Аллоҳнинг зиммасидадир.  (Аллоҳ) уларнинг қарор топган жойларини ҳам,  омонат турадиган (вақтинча қоладиган ёки тупроққа топшириладиган) жойларини ҳам билур. Ҳаммаси очиқ  Китобда (Лавҳул - Маҳфузда мавжуд)дир  (11/Ҳуд, 6).
    """),
    DailyArabicRussianModel(arabic: """
    اِنّ۪ي تَوَكَّلْتُ عَلَى اللّٰهِ رَبّ۪ي وَرَبِّكُمْۜ مَا مِنْ دَٓابَّةٍ اِلَّا هُوَ اٰخِذٌ بِنَاصِيَتِهَاۜ اِنَّ رَبّ۪ي عَلٰى صِرَاطٍ مُسْتَق۪يمٍ ۝ 
    """, russian: """
(Ҳуд алайҳиссалом деди:) Шубҳасиз, мен - менинг ҳам Раббим,  сизнинг ҳам Раббингиз бўлган Аллоҳга таваккул қилдим -- суяниб - таяндим!  Ҳеч бир жонзот йўқки, У зот унинг манглайидан  тутган (уни  Ўз ҳукми ва иродаси остига олган) бўлмаса. Шубҳасиз, менинг Раббим тик-тўғри йўлдадир (У одилдир, ҳукм ва тасарруфида ҳаққоният узрадир, ҳеч кимга зулм ва ноҳақлик қилмас) (11/Ҳуд, 56).
"""),
    DailyArabicRussianModel(arabic: """
وَكَاَيِّنْ مِنْ دَٓابَّةٍ لَا تَحْمِلُ رِزْقَهَاۗ اَللّٰهُ يَرْزُقُهَا وَاِيَّاكُمْۘ وَهُوَ السَّم۪يعُ الْعَل۪يمُ ۝ 
    """, russian: """
    Қанча жонзод (махлуқ) борки,  ўз ризқини (ўзи) кўтара олмас. Уларга ҳам, сизларга ҳам Аллоҳ ризқ берур. У  ҳаққоний эшитгувчидир, билгувчидир  (29/Анкабут, 60).
    """),
    DailyArabicRussianModel(arabic: """
مَا يَفْتَحِ اللّٰهُ لِلنَّاسِ مِنْ رَحْمَةٍ فَلَا مُمْسِكَ لَهَاۚ وَمَا يُمْسِكْۙ فَلَا مُرْسِلَ لَهُ مِنْ بَعْدِه۪ۜ وَهُوَ الْعَز۪يزُ الْحَك۪يمُ ۝ 
    """, russian: """
Аллоҳ инсонларга Ўз раҳматидан қай нарсани очса (юборса),  уни  ушлаб - тўсиб қолгувчи йўқдир. У қай  нарсани тутиб -  тўсиб қолса, ундан кейин уни қўйиб юборгувчи ҳам йўқдир. У мутлақ ғолиб, ҳукм ва  ҳукмат  соҳибидир. (35/Фотир,  2).
    """),
    DailyArabicRussianModel(
        arabic:
            """وَلَئِنْ سَاَلْتَهُمْ مَنْ خَلَقَ السَّمٰوَاتِ وَالْاَرْضَ لَيَقُولُنَّ اللّٰهُۜ قُلْ اَفَرَاَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللّٰهِ اِنْ اَرَادَنِيَ اللّٰهُ بِضُرٍّ هَلْ هُنَّ كَاشِفَاتُ ضُرِّه۪ٓ اَوْ اَرَادَن۪ي بِرَحْمَةٍ هَلْ هُنَّ مُمْسِكَاتُ رَحْمَتِه۪ۜ قُلْ حَسْبِيَ اللّٰهُۜ عَلَيْهِ يَتَوَكَّلُ الْمُتَوَكِّلُونَ ۝ """,
        russian:
            """Қасамки, агар сиз улардан:  "Осмонларни ва ерни ким яратди?" -- деб сўрсангиз,  албатта: "Аллоҳ",  дерлар. Айтинг:"Ундоқ бўлса, айтинглар-чи, Аллоҳ менга бир зарар беришни хоҳласа, сизлар Аллоҳни  қўйиб ибодат қилаётган (тепасида тўпланиб, сиғинаётган) нарсаларингиз Унинг зарарини  (мендан) кетказа олурларми?! Ёки (Аллоҳ) менга бир рахматни (яхшиликни) раво кўрса, улар Унинг раҳматини тўса олурларми?" Айтинг: "Менга Аллоҳ кифоядир! Таваккул қилгувчилар фақат Унга таваккул қилур(лар)!" (39/Зумар, 38).
Изоҳ. Тавба сурасининг 51-оятидан бошлаб Зумар сурасининг 38-оятигача  бўлган етти оят ҳақида бази валий зотлар: "Ушбу етти оят қироат қилинганида шу кунда агар узулиб ерга тушса ҳам, парво қилмайман, буларнинг қироати баракотидан, албатта, қутулиб қоламан", деганлари нақл қилинади.
"""),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّه۪    ۝    عَاجِلِه۪ وَاٰجِلِه۪    ۝    مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ   ۝   وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّه۪   ۝   عَاجِلِه۪ وَاٰجِلِه۪   ۝   مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ   ۝   اَللّٰهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ   ۝   وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِه۪ عَبْدُكَ وَنَبِيُّكَ   ۝   اَللّٰهُمَّ  إِنِّي أَسْأَلُكَ الْجَنَّةَ   ۝   وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ  ۝   وَأَعُوذُ بِكَ مِنَ النَّارِ   ۝   وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ  ۝   وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا ۝ 
    """, russian: """
    Ҳадиси шарифлар
    
    
 Аллоҳим! Сендан ўзим билган ва билмаган, тез бериладиган ва кейин бериладиган яхшиликнинг барчасини тилайман! Ўзим билган ва билмаган, тез келадиган ва кейин келадиган ёмонликнинг барчасидан Ўзингдан паноҳ тилайман! 
Аллоҳим! Сендан банданг ва пайғамбаринг (ҳазрати Муҳаммад соллаллоҳу  алайҳи ва саллам) тилаган яхшиликларни тилайман!  Банданг  пайғамбаринг (ҳазрати Муҳаммад соллаллоҳу алайҳи ва саллам) Сендан тилаган ёмонликлардан Ўзингдан паноҳ тилайман! 
Сендан жаннатни ва унга яқинлаштирадиган сўз ёки амални (насиб этмоғингни)  тилайман! Дўзах оловидан ва унга яқинлаштирадиган сўз ёки амалдан Ўзингга сиғинаман! Сендан - Ўзинг менга  тақдир қилган ҳар қазо ҳукмини мен учун ҳайрли қилмоғингни тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
لَا إِلٰهَ إِلَّا اللّٰهُ الْعَلِيمُ الْحَلِيمُ   ۝   لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ الْعَرْشِ الْعَظِيمِ  ۝   لَا إِلٰهَ إِلَّا اللّٰهُ رَبُّ السَّمَاوَاتِ وَرَبُّ الْأَرْضِ رَبُّ الْعَرْشِ الْكَرِيمِ ۝ 
    """, russian: """
    Илм ва ҳилм эгаси бўлмиш Аллоҳдан бошқа илоҳ йўқ. Буюк - азаматли Аршнинг Рабби - эгаси бўлмиш Аллоҳдан бошқа илоҳ йўқ. Осмонларнинг Рабби, Ернинг Рабби, олий - карамли Аршнинг  Рабби бўлиш Аллоҳдан бошқа илоҳ йўқ! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الطَّاهِرِ الطَّيِّبِ الْمُبَارَكِ الْأَحَبِّ إِلَيْكَ   ۝   اَلَّذِي إِذَا دُعِيْتَ بِه۪ أَجَبْتَ   ۝    وَإِذَا سُئِلْتَ بِه۪ أَعْطَيْتَ   ۝   وَإِذَا اسْتُرْحِمْتَ بِه۪ رَحِمْتَ   ۝    وَإِذَا اسْتُفْرِجْتَ بِه۪ فَرَّجْتَ ۝ 
    """, russian: """
    Аллоҳим. Сенинг пок, гўзал ва муборак ҳамда Ўзинг учун севимли бўлган исмин ила Сендан тилайман! У исмнинг ила Сенга дуо қилинганида ижобат қилурсан, У исмин ила Сендан сўралганида ато қилурсан, у исминг ила Сендан раҳмат сўралганида раҳмат қилурсан. У исминг ила Сендан мушкуллардан нажот тиланганида мушкулотдан халос қилурсан!
    """),
    DailyArabicRussianModel(
        arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالْاٰخِرَةِ   ۝   اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِينِي وَدُنْيَايَ وَأَهْلِي وَمَالِي   ۝   اَللّٰهُمَّ اسْتُرْ عَوْرَاتِي   ۝   وَاٰمِنْ رَوْعَاتِي   ۝   وَاحْفَظْنِي مِنْ بَيْنِ يَدَيَّ وَمِنْ خَلْفِي   ۝   وَعَنْ يَمِينِي وَعَنْ شِمَالِي وَمِنْ فَوْقِي   ۝   وَأَعُوذُ بِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ۝ 
    """,
        russian:
            """Аллоҳим! Сендан дунё ва охиратда афв ва офият (сиҳат-саломатлик, тинчлик-омонлик) тилайман! Аллоҳим! Динимда ва дунёмда, аҳли оиламда ва  молимда Сендан афв ва офият (сиҳат-саломатлик, тинчлик-омонлик) тилайман!  Аллоҳим! Айбларимни ёп,  мени қўрққан нарсаларимдан (хавфу хатарлардан) эмин айла! Олдимдан, ортимдан, ўнгимдан, сўлимдан ва устимдан мени  муҳофаза қил! Оёқларим остидан ер тойдирмоғидан (балога учрашдан) Ўзингдан паноҳ тилайман!
"""),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَصْبَحْتُ  ۝  أُشْهِدُكَ وَأُشْهِدُ حَمَلَةَ عَرْشِكَ  ۝  وَمَلَائِكَتَكَ وَجَمِيعَ خَلْقِكَ  ۝  أَنَّكَ أَنْتَ اللّٰهُ لَا إِلٰهَ إِلَّا أَنْتَ  ۝  وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ ۝ 
    """, russian: """
    Аллоҳим! Тонгга етишдим! Сени гувоҳ қилурман; Сенинг Аршингни кўтариб турувчи фаришталарни,  (барча) фаришталарингни ва бутун яратганларингни  гувоҳ қилурманки, шуҳбасиз, Сен Аллоҳ (бор)сан, Сендан бошқа илоҳ йўқ ва Муҳаммад Сенинг банданг ва пайғамбарингдир.
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ مُنْزِلَ الْكِتَابِ سَرِيعَ الْحِسَابِ   ۝   اِهْزِمِ الْأَحْزَابَ   ۝   اَللّٰهُمَّ اهْزِمْهُمْ وَزَلْزِلْهُمْ ۝
    """, russian: """
    Эт китоб нозил қилгувчи ва ўта тез  ҳисоб-китоб этгувчи Аллоҳим! Иттифоқчи душман гуруҳларини парчала - мағлуб эт!     Аллоҳим! Уларни мағлуб эт ва уларни титроққа сол!  
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ   ۝   وَوَجَّهْتُ وَجْهِي إِلَيْكَ   ۝    وَفَوَّضْتُ أَمْرِي إِلَيْكَ   ۝    وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ   ۝   رَغْبَةً وَرَهْبَةً إِلَيْكَ   ۝   لَا مَلْجَأَ وَلَا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ   ۝   اٰمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ   ۝   وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ ۝ 
    """, russian: """
    Аллоҳим! Ўзимни Ўзингга таслим этдим, юзимни Сенга қаратдим, ишимни Ўзингга топширдим, Сенга суяндим, умидим ҳам, қўрқувим ҳам Сендандир. Сендан паноҳ топадиган жой фақат Сенсан, Сендан нажот топадиган жой фақат Сенсан! Нозил қилган Китобингга ва юборган Пайғамбарингга иймон келтирдим!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَوْلَجِ وَخَيْرَ الْمَخْرَجِ   ۝   بِسْمِ اللّٰهِ وَلَجْنَا وَبِسْمِ اللّٰهِ خَرَجْنَا   ۝   وَعَلَى اللّٰهِ رَبِّنَا تَوَكَّلْنَا ۝ 
    """, russian: """
    Аллоҳим! Кириш яхшилигини ва чиқиш яхшилигини Сендан тилайман! Аллоҳни исми билан кирдик, Аллоҳнинг исми билан чиқдик! Раббимиз Аллоҳга таваккул қилдик! 
    """),
    DailyArabicRussianModel(
        arabic:
            """اَللّٰهُمَّ رَبَّنَا اٰتِنَا فِي الدُّنْيَا حَسَنَةً  ۝  وَفِي الْاٰخِرَةِ حَسَنَةً  ۝  وَقِنَا عَذَابَ النَّارِ ۝ 
    """,
        russian: """
    Аллоҳим! Эй Раббимиз! Бизга дунёда ҳам яхшилик, оҳиратда ҳам яхшилик ато айла ва бизни дўзах азобидан ўзинг асра!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اغْفِرْ لَنَا   ۝   وَارْحَمْنَا   ۝   وَارْضَ عَنَّا   ۝   وَتَقَبَّلْ مِنَّا   ۝   وَأَدْخِلْنَا الْجَنَّةَ   ۝   وَنَجِّنَا مِنَ النَّارِ   ۝   وَأَصْلِحْ لَنَا شَأْنَنَا كُلَّهُ ۝ 
    """, russian: """
    Аллоҳим! Бизни мағфират қил, бизга раҳм қил, биздан рози бўл ва (яхши ишларимиз, ибодат ва дуоларимизни) биздан қабул эт, бизни жаннатга кирит, бизга дўзахдан нажот бер ва бизнинг ҳар кору ҳолимизни ислоҳ қил! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ  إِنِّي أَعُوذُ بِكَ مِنَ الْفَقْرِ وَالْقِلَّةِ وَالذِّلَّةِ    ۝   وَأَعُوذُ بِكَ مِنْ أَنْ أَظْلِمَ أَوْ أُظْلَمَ ۝ 
    """, russian: """
    Аллоҳим! Қашшоқликдан, йўқчиликдан, зиллат - хорлик - тубанликдан Ўзингдан паноҳ тилайман! Зулм қилишдан ва зулмга учрашдан Ўзингдан паноҳ тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اجْعَلْ سَرِيرَتِي خَيْرًا مِنْ عَلَانِيَتِي   ۝   وَاجْعَلْ عَلَانِيَتِي صَالِحَةً   ۝   اَللّٰهُمَّ  إِنِّي أَسْأَلُكَ مِنْ صَالِحِ مَا تُؤْتِي النَّاسَ مِنَ الْمَالِ وَالْأَهْلِ وَالْوَلَدِ غَيْرِ الضَّالِّ وَلَا الْمُضِلِّ ۝ 
    """, russian: """
    Аллоҳим! Ичимни ташимдан яхшироқ қил ва ташимни ҳам яхши-дуруст қил! Аллоҳим! Мол-мулк, ахли оила, фарзанд борасида - йўлдан озувчи ва йўлдан оздирувчи қилмасдан - инсонларга берганингдан яхшисини бермоғингни Сендан тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ إِنِّى أَعُوذُ بِكَ مِنَ الْجُبْنِ  ۝   وَأَعُوذُ بِكَ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ  ۝   وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا  ۝   وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ ۝
    """, russian: """
    Аллоҳим! Умрнинг энг забун-нохуш ҳолига қайтишдан (мушкул-машаққатли кунларига қадар яшашдан) Ўзингдан паноҳ тилайман! Дунё фитнасидан Ўзингдан паноҳ тилайман!
    
    
                    Таржимон изоҳи:
"Арзали умр"-"умрнинг энг забун-мушкул даври" ифодаси Қурони каримнинг Наҳл сураси,  70-оятида келган.
"Файзул-Фурқон"  изоҳига кўра, умрнинг нохуш, забун-мушкул ва билганларини унутиш, била туриб билмайдиган бўлиб қолиш даври "арзали умр" дейилади. Шунинг учун Пайғамбаримиз соллаллоҳу алайҳи ва саллам Қурон ифодаси билан дуо қилиб, "арзали умр"дан Аллоҳдан паноҳ тилаганлар.
Ҳазрати Икрима (розияллоҳу анҳу)дан келган бир хушхабарга кўра, Қурон ўқишда бардавом бўладиган киши "арзали умр"га тушмайди. 
Ҳазрати Икрима ҳазрати Абдуллоҳ ибн Аббоснинг озод этган қуллари бўлиб, ҳазрати Аббосдан бир қанча ҳадислар ривоят қилганлар розияллоҳу анҳум).

    """),
  ],

  // Tuesday
  [
    DailyArabicRussianModel(arabic: """
   يَٓا اَيُّهَا الَّذ۪ينَ اٰمَنُٓوا اِذَا ضَرَبْتُمْ  ف۪ي سَب۪يلِ اللّٰهِ فَتَبَيَّنُوا وَلَا تَقُولُوا لِمَنْ اَلْقٰٓى اِلَيْكُمُ السَّلَامَ لَسْتَ مُؤْمِنًاۚ تَبْتَغُونَ عَرَضَ الْحَيٰوةِ الدُّنْيَاۘ فَعِنْدَ اللّٰهِ مَغَانِمُ كَث۪يرَةٌۜ كَذٰلِكَ كُنْتُمْ مِنْ قَبْلُ فَمَنَّ اللّٰهُ عَلَيْكُمْ فَتَبَيَّنُواۜ اِنَّ اللّٰهَ كَانَ بِمَا تَعْمَلُونَ خَب۪يرًا ۝ 
   """, russian: """
   Эй иймон келтирганлар! Аллоҳ йўлида (сафарга) чиққан вақтингизда (мўминни кофирдан ажратмоқ учун) ҳамма нарсани  яхшилаб текширинглар. Сизларга салом берган (мусулмон эканлигини билдирган) кишига - дунё ҳаётининг ўткинчи манфаатини истаб - дарҳол: "Сен мўмин эмассан" деманглар. Чунки Аллоҳнинг ҳузуридаги ўлжалар беҳад кўпдир. (Унутмангларки,) сизлар ҳам олдин шундай эдингизлар ва Аллоҳ сизларга (иймонни) лутфу иноят қилди. У ҳолда яхшилаб текшириб - аниқланглар (шошиб ҳукм қилманглар). Шубҳасизки, Аллоҳ барча аммалларингиздан ҳабардор бўлган Зотдир (4/Нисо, 94).
   """),
    DailyArabicRussianModel(arabic: """
    يَهْد۪ي  بِهِ  اللّٰهُ  مَنِ اتَّبَعَ  رِضْوَانَهُ  سُبُلَ  السَّلَامِ وَيُخْرِجُهُمْ مِنَ الظُّلُمَاتِ اِلَى النُّورِ بِاِذْنِه۪ وَيَهْد۪يهِمْ اِلٰى صِرَاطٍ مُسْتَق۪يمٍ ۝ 
    """, russian: """
    Аллоҳ у (Қурон) билан Ўз ризосига  интилганларни омонлик - саломат йўлларига эриштирур, уларни Ўз изни билан қоронғуликлардан ёруғликларга чиқарур ва тўғри йўлга ҳидоят қилур (5/Моида, 16).
    """),
    DailyArabicRussianModel(arabic: """
    وَاِذَا جَٓاءَكَ الَّذ۪ينَ يُؤْمِنُونَ بِاٰيَاتِنَا فَقُلْ سَلَامٌ عَلَيْكُمْ كَتَبَ رَبُّكُمْ عَلٰى نَفْسِهِ الرَّحْمَةَۙ اَنَّهُ مَنْ عَمِلَ مِنْكُمْ سُٓوءًا بِجَهَالَةٍ ثُمَّ تَابَ مِنْ بَعْدِه۪ وَاَصْلَحَ فَاَنَّهُ غَفُورٌ رَح۪يمٌ ۝
    """, russian: """
    (Эй Расулим!) Бизнинг оятларимизга ишонганлар сизнинг ҳузурингизга келган вақтида айтингки: "Саломун алайкум (Сизларга Аллоҳнинг саломи бўлсин)! Сизлардан кимки билмасдан бир ёмонлик (бир гувоҳ) қилса-ю, сўнг ортидан тавба қилса  ва ўзини тузатса, Раббингиз (унга) раҳмат қилишни Ўз зиммасига ёзгандир. Чунки У беҳад мағфиратли ва бениҳоят раҳмлидир" (6/Аном,  54).
    """),
    DailyArabicRussianModel(arabic: """
  وَبَيْنَهُمَا حِجَابٌۚ وَعَلَى الْاَعْرَافِ رِجَالٌ يَعْرِفُونَ كُلًّا بِس۪يمٰيهُمْۚ وَنَادَوْا اَصْحَابَ الْجَنَّةِ اَنْ سَلَامٌ عَلَيْكُمْ لَمْ يَدْخُلُوهَا وَهُمْ يَطْمَعُونَ ۝ 
    """, russian: """
    Икки (томон) ўртасида бир парда (бўлган девор) бордир. Арофнинг (деворнинг баланд тепалари) устида эса (жаннатийлар ва дўзахийларнинг) ҳар бирини сиймоларидан танийдиган кишилар бордир. Улар жаннат аҳлига: "Саломун алайкум (Сизларга Аллоҳнинг саломи бўлсин)!" - деб нидо қилурларки, ўзлари беҳад орзу қилганлари ҳолда ҳали унга (жаннатга) кирмаган кишилардир (7/Ароф, 46).
    """),
    DailyArabicRussianModel(arabic: """
    دَعْوٰيهُمْ ف۪يهَا سُبْحَانَكَ اللّٰهُمَّ وَتَحِيَّتُهُمْ ف۪يهَا سَلَامٌۚ وَاٰخِرُ دَعْوٰيهُمْ اَنِ الْحَمْدُ لِلّٰهِ رَبِّ الْعَالَم۪ينَ۟ ۝ 
    """, russian: """
    Уларнинг у ердаги дуолари "Субҳанакаллоҳумма" ("Аллоҳим! Сени, ҳар қандай нуқсонлардан пок ва муназзаҳ эканлигингни олқишлаб, ёд этурмиз!") дейишдир. У ерда (бир - бирларига яхшилик ва омонлик) тилаклари "Салом!"дир ва дуоларининг охири эса: "Алаҳамдулиллаҳи Раббил-оламийн!" ("Бутун оламлар Рабби бўлган Аллоҳга ҳамд бўлсин!") дейишдир. (10/Юнус, 10).
    """),
    DailyArabicRussianModel(arabic: """
    وَلَقَدْ جَٓاءَتْ رُسُلُنَٓا اِبْرٰه۪يمَ بِالْبُشْرٰى قَالُوا سَلَامًاۜ قَالَ سَلَامٌۚ فَمَا لَبِثَ اَنْ جَٓاءَ بِعِجْلٍ حَن۪يذٍ ۝
    """, russian: """
    Қасамки, бизнинг элчиларимиз (фаришталар) Иброҳимга (бир фарзанд ҳақидаги) хушҳабар билан келдилар, "Салом!" дедилар. У ҳам "Салом!" деди. Кўп ўтмасдан (уларга) қовурулган бир бузоқни келтирди (11/Ҳуд,  69).
"""),
    DailyArabicRussianModel(arabic: """
    سَلَامٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِۜ ۝ 
    """, russian: """
    (Фаришталар:  "Дин учун дунёнинг завқ ва қийинчиликларига) сабр қилганларингиз сабабли сизларга салом бўлсин, дунё диёрининг (яхши) оқибати нақадар гўзалдир!" (дерлар)  (13/Рад, 24).
    """),
    DailyArabicRussianModel(arabic: """
    وَاُدْخِلَ الَّذ۪ينَ اٰمَنُوا وَعَمِلُوا الصَّالِحَاتِ جَنَّاتٍ تَجْر۪ي مِنْ تَحْتِهَا الْاَنْهَارُ خَالِد۪ينَ ف۪يهَا بِاِذْنِ رَبِّهِمْۜ تَحِيَّتُهُمْ ف۪يهَا سَلَامٌ ۝ 
    """, russian: """
    Иймон келтириб, солиҳ (савобли) амаллар қилганлар ўз Раббининг изни билан ўзлари абадий қоладиган, остидан анҳорлар оқиб турадиган жаннатларга киритилажаклар. У ерда уларнинг (бир-бирларига) тилак,  илтифот ва дуолари (Салом!"дир (омонлик тилашдир)  (14/Иброҳим,  23).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّ الْمُتَّق۪ينَ ف۪ي جَنَّاتٍ وَعُيُونٍۜ   ۝   اُدْخُلُوهَا بِسَلَامٍ اٰمِن۪ينَ   ۝ 
    """, russian: """
    Тақво эгалари (Аллоҳнинг амрларига мос яшаб, шайтонга ва шайтонлашган шахсларга эргашишдан сақланган зотлар) эса жаннатларда ва чашмалар(нинг бошлари)дадирлар. (Уларга: "Эй тақво эгалари!) Унга саломатлик билан, тинч-эмин ҳолда киринглар!" - (дейилур)  (15/Ҳижр,  45-46).
    """),
    DailyArabicRussianModel(arabic: """
    اَلَّذ۪ينَ تَتَوَفّٰيهُمُ الْمَلٰٓئِكَةُ طَيِّب۪ينَۙ يَقُولُونَ سَلَامٌ عَلَيْكُمُۙ ادْخُلُوا الْجَنَّةَ بِمَا كُنْتُمْ تَعْمَلُونَ ۝ 
    """, russian: """
    Улар - яхши ва пок ҳолларида малоикалар жонларини оладиган кишилардир. (Фаришталар уларга:)  Сизларга салом бўлсин! Қилган амалларингиз туфайли киринглар жаннатга!" - дерлар   (16/Наҳл, 32).
    """),
    DailyArabicRussianModel(arabic: """
    وَالسَّلَامُ عَلَيَّ يَوْمَ وُلِدْتُ وَيَوْمَ اَمُوتُ وَيَوْمَ اُبْعَثُ حَيًّا ۝ 
    """, russian: """
    (Ийсо алайҳиссалом деди:) Туғилган куним ҳам, ўладиган куним ҳам, қайта тириладиган кунимда ҳам (Аллоҳдан) менга саломдир (омонликдир)!"  (19/Марям, 33).
    """),
    DailyArabicRussianModel(arabic: """
    قَالَ سَلَامٌ عَلَيْكَۚ سَاَسْتَغْفِرُ لَكَ رَبّ۪يۜ اِنَّهُ كَانَ ب۪ي حَفِيًّا ۝ 
    """, russian: """
    (Иброҳим) деди: "Сенга салом бўлсин (саломат бўл)! Сен учун Раббимдан мағфират тилагайман. Чунки У менга кўп лутфкордир"  (19/Марям,  47).
    """),
    DailyArabicRussianModel(arabic: """
    لَا يَسْمَعُونَ ف۪يهَا لَغْوًا اِلَّا سَلَامًاۜ وَلَهُمْ رِزْقُهُمْ ف۪يهَا بُكْرَةً وَعَشِيًّا ۝ 
    """, russian: """
    У ерда (жаннатда) улар беҳуда бир сўз эшитмаслар, фақат салом (омонлик) сўзларини  (эшитурлар). У ерда тонг ва шомда уларнинг ризқлари ҳам бордир  (19/Марям,  62).
    """),
    DailyArabicRussianModel(arabic: """
    فَأْتِيَاهُ فَقُولَٓا اِنَّا رَسُولَا رَبِّكَ فَاَرْسِلْ مَعَنَا بَن۪ٓي اِسْرَٓاء۪يلَ وَلَا تُعَذِّبْهُمْۜ قَدْ جِئْنَاكَ بِاٰيَةٍ مِنْ رَبِّكَۜ وَالسَّلَامُ عَلٰى مَنِ اتَّبَعَ الْهُدٰى ۝ 
    """, russian: """
    (Эй Мусо ва Ҳорун!)  Дарҳол унинг (Фиравннинг элчиларимиз. Бани Исроилни биз билан юбор ва уларга азоб берма! Биз Раббингиздан сенга бир мўъжиза келтирдик. Ҳидоятга эргашганларга салом (ва саодат) бўлгай!  (20/Тоҳо,  47).
    """),
    DailyArabicRussianModel(arabic: """
    قُلْنَا يَا نَارُ كُون۪ي بَرْدًا وَسَلَامًا عَلٰٓى اِبْرٰه۪يمَۙ ۝ 
    """, russian: """
    Биз: "Эй олов! Иброҳим учун салқин ва саломатлик бўл!" - дедик  (21/Анбиё, 69).
    """),
    DailyArabicRussianModel(arabic: """
    قُلْنَا يَا نَارُ كُون۪ي بَرْدًا وَسَلَامًا عَلٰٓى اِبْرٰه۪يمَۙ ۝ 
    """, russian: """
    Раҳмоннинг (ҳос) бандалари ул кишилардирки, ер юзида тавозу билан юрурлар ва жоҳиллар уларга сўз қотганда (талашмасдан):   "Саломат бўлинг!" де(б ўту)рлар  (25/Фурқон, 63).
    """),
    DailyArabicRussianModel(arabic: """
    اُو۬لٰٓئِكَ يُجْزَوْنَ الْغُرْفَةَ بِمَا صَبَرُوا وَيُلَقَّوْنَ ف۪يهَا تَحِيَّةً وَسَلَامًاۙ ۝ 
    """, russian: """
    Ана ўшалар (саналган ҳислатларга эга бўлган ҳолда Раҳмон бўлмиш Аллоҳга бандалик вазифасини бажарувчилар) сабрлари сабабли жаннатнинг энг юксак мавқе(лар)и билан мукофотланурлар ва у ерда табрик (омонлик тилаклари) ва салом билан қарши олинурлар (25/Фурқон,  75).
    """),
    DailyArabicRussianModel(arabic: """
    قُلِ الْحَمْدُ لِلّٰهِ وَسَلَامٌ عَلٰى عِبَادِهِ الَّذ۪ينَ اصْطَفٰىۜ آٰللّٰهُ خَيْرٌ اَمَّا يُشْرِكُونَۜ ۝ 
    """, russian: """
    (Эй Расулим!) Айтинг: "Аллоҳга ҳамд бўлсин! Унинг танлаган (пайғамбар) бандаларига салом бўлсин! Аллоҳ яхшироқми ёки у (мушрик)лар шерик қилаётган (Аллоҳнинг ўрнига ўзлари боғлиқлик кўрсатаётган) нарсаларми?!"  (27/Намл,  59).

    """),
    DailyArabicRussianModel(arabic: """
    وَاِذَا سَمِعُوا اللَّغْوَ اَعْرَضُوا عَنْهُ وَقَالُوا لَنَٓا اَعْمَالُنَا وَلَكُمْ اَعْمَالُكُمْۘ سَلَامٌ عَلَيْكُمْۘ لَا نَبْتَغِي الْجَاهِل۪ينَ ۝ 
    """, russian: """
    Улар (бундан олдин Китоб берилган ва Қуронга ишонган зотлар) беҳуда-бефойда сўз эшитган вақтларида ундан юз ўгирурлар ва: "Бизнинг амалларимиз - бизга, сизларнинг амалларингиз - сизга!  Саломат бўлинглар!  Биз жоҳил(лик қилувчи)ларни истамасмиз (жоҳил кишилар билан ўтириб-турмасмиз, биродарлик қилмасмиз)!" - дерлар (28/Қасас,  55).
    """),
    DailyArabicRussianModel(arabic: """
    تَحِيَّتُهُمْ يَوْمَ يَلْقَوْنَهُ سَلَامٌۚ وَاَعَدَّ لَهُمْ اَجْرًا كَر۪يمًا ۝
    """, russian: """
    (Мўминлар) Унга етишадиган кунда (Аллоҳнинг) уларга илтифоти "Салом!"дир. (Аллоҳ) уларга шарафли мукофот таёрлаб қўйгандир (33/Аҳзоб, 44).
    """),
    DailyArabicRussianModel(arabic: """سَلَامٌ قَوْلًا مِنْ رَبٍّ رَح۪يمٍ ۝ 
    """, russian: """
    Беҳад раҳмли Рабби тарафидан (уларга) айтиладиган сўз - "Салом!"дир. (36/Ёсин, 58)
    """),
    DailyArabicRussianModel(arabic: """
    وَس۪يقَ الَّذ۪ينَ اتَّقَوْا رَبَّهُمْ اِلَى الْجَنَّةِ زُمَرًاۜ حَتّٰى اِذَا جَٓاؤُ۫هَا وَفُتِحَتْ اَبْوَابُهَا وَقَالَ لَهُمْ خَزَنَتُهَا سَلَامٌ عَلَيْكُمْ طِبْتُمْ فَادْخُلُوهَا خَالِد۪ينَ ۝ 
    """, russian: """
    Ўз Раббига тақво қилганлар (Ундан қўрқиб, амрига мувофиқ яшаганлар) эса гуруҳ-гуруҳ ҳолда жаннатга олиб борилур! Ниҳоят, улар у жойга келиб, унинг  эшиклари очилганида (жаннат) соқчилари уларга:  "Сизларга (Аллоҳдан) салом бўлсин! (Қандай) поксизлар! Бас,  абадий қолувчи бўлган ҳолингизда киринглар у ерга!" - дерлар (39/Зумар, 73).

    """),
    DailyArabicRussianModel(arabic: """
    فَاصْفَحْ عَنْهُمْ وَقُلْ سَلَامٌۜ فَسَوْفَ يَعْلَمُونَ ۝ 
    """, russian: """
    (Аллоҳ:) "Энди сиз уларни (иймон келтирмаганларни) тарк этинг ва: "Саломат бўлинглар" - денг. Бас, яқинда билурлар! (деди)  (43/Зухруф, 89).
    """),
    DailyArabicRussianModel(arabic: """
    اُدْخُلُوهَا بِسَلَامٍۜ ذٰلِكَ يَوْمُ الْخُلُودِ ۝ 
    """, russian: """
    (Уларга:) "У ерга саломатлик ила кирингиз! Бу абадийлик кунидир" (дейилур)  (50/Қоф, 34).

    """),
    DailyArabicRussianModel(arabic: """
    اِذْ دَخَلُوا عَلَيْهِ فَقَالُوا سَلَامًاۜ قَالَ سَلَامٌۚ قَوْمٌ مُنْكَرُونَ ۝ 
    """, russian: """
    Ёд этинг, вақтики улар (фаришталар) унинг ҳузурига кирдилар ва: "Салом!" - дедилар, у (Иброҳим) ҳам (жавобан): "Салом! (Булар) нотаниш қавм-ку!" - деди (51/Зориёт, 25).
    """),
    DailyArabicRussianModel(arabic: """
    لَا يَسْمَعُونَ ف۪يهَا لَغْوًا وَلَا تَأْث۪يمًاۙ   ۝   اِلَّا ق۪يلًا سَلَامًا سَلَامًا   ۝ 
    """, russian: """
    У ерда беҳад ва гуноҳ сўз эшитмаслар (ва сўзламаслар); фақат (эшитадиган) сўзлари - "Салом, салом"дир  (56/Воқеа,  25-26).
    """),
    DailyArabicRussianModel(arabic: """
    فَسَلَامٌ لَكَ مِنْ اَصْحَابِ الْيَم۪ينِ ۝ 
    """, russian: """
    "Эй (бахтиёрлардан бўлган) ўнг томон  эгаси! Сенга салом бўлсин (сен омонликдасан)!" (дейилур)  (56/Воқеа, 91).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّٓا اَنْزَلْنَاهُ ف۪ي لَيْلَةِ الْقَدْرِۚ ۝ 
وَمَٓا اَدْرٰيكَ مَا لَيْلَةُ الْقَدْرِۜ ۝ 
لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ اَلْفِ شَهْرٍۜ ۝ 
تَنَزَّلُ الْمَلٰٓئِكَةُ وَالرُّوحُ ف۪يهَا بِاِذْنِ رَبِّهِمْۚ مِنْ كُلِّ اَمْرٍۙ ۛ ۝
سَلَامٌ۠ ۛ هِيَ حَتّٰى مَطْلَعِ الْفَجْرِ ۝ 
    """, russian: """
Бисмиллаҳир-Раҳманир-Роҳийм
    
Дарҳақиқат, Биз уни (Қуронни) Қадр кечасида нозил қилдик.  Қадр кечаси нималигини (унинг фазилат ва шарафини) сиз қандай билурсиз? Қадр кечаси (қадр кечасига эга бўлмаган) минг ойдан яхшироқдир.  У кечада Малоикалар ва Руҳ ўз Раббининг изни билан (келгуси йилга қадар бўладиган ҳикматли) ҳар бир иш учун тушгайдир. У (кеча) то тонг отгунича (ибодат аҳлига) саломдир (раҳмат, омонлик, тинчлик, баракотдир)  (97/Қадр, 1-5).
    """),
    DailyArabicRussianModel(arabic: """
   
 اَللّٰهُمَّ  فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ   ۝   عَالِمَ الْغَيْبِ وَالشَّهَادَةِ   ۝   رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ    ۝    أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا أَنْتَ   ۝   أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي   ۝   وَشَرِّ الشَّيْطَانِ وَشِرْكِه۪ ۝ 
    """, russian: """
    Ҳадиси шарифлар 
    
    
    Эй инсонлар ва ерни илк яратган, ғойиб ва ошкорни билгувчи Аллоҳим! Эй ҳамма нарсанинг Рабби-эгаси ва ягона ҳукмрони! Гувоҳлик бераманки, Сендан бошқа илоҳ йўқдир. Нафсим шарридан, шайтон шарридан ва унинг ширк(ка дават қилиши)идан Ўзингдан паноҳ тилайман! 
    """),
    DailyArabicRussianModel(arabic: """"    
َللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا عَمِلْتُ   ۝   وَ مِنْ شَرِّ مَا لَمْ أَعْمَلْ ۝ 
    """, russian: """
    Аллоҳим! Шу маҳалгача қилган амалларим шарридан ва ҳали қилмаган амалларим шарридан Ўзингдан паноҳ тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَدْمِ   ۝   وَأَعُوذُ بِكَ مِنَ التَّرَدِّي   ۝   وَأَعُوذُ بِكَ مِنَ الْغَرَقِ وَالْحَرَقِ وَالْهَرَمِ   ۝   وَأَعُوذُ بِكَ أَنْ يَتَخَبَّطَنِيَ الشَّيْطَانُ عِنْدَ الْمَوْتِ   ۝   وَأَعُوذُ بِكَ أَنْ أَمُوتَ فِي سَبِيلِكَ مُدْبِرًا   ۝   وَأَعُوذُ بِكَ أَنْ أَمُوتَ لَدِيغًا ۝ 

    """, russian: """
    Аллоҳим! Харобалар остида қолишдан Ўзингдан паноҳ тилайман!  Баландлардан йиқилишдан Ўзингдан паноҳ тилайман! Сувда ғарқ бўлишдан, ёнғиндан ва (қўл-оёқдан  қолиб, бировга муҳтож бўлишдек) ёмон қариликдан Ўзингдан паноҳ тилайман!  Ўлим олдидаги шайтоннинг тасир кучидан Ўзингдан паноҳ тилайман! Сенинг йўлингдан юз ўгирган ҳолда ўлишдан Ўзингдан паноҳ тилайман! Махлуқотларнинг чақиб-заҳарлаши билан ўлишдан Ўзингдан паноҳ тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَعُوذُ بِوَجْهِكَ الْكَرِيمِ   ۝   وَكَلِمَاتِكَ التَّامَّةِ مِنْ شَرِّ مَا أَنْتَ اٰخِذٌ بِنَاصِيَتِه۪   ۝   اَللّٰهُمَّ أَنْتَ تَكْشِفُ الْمَغْرَمَ وَالْمَأْثَمَ   ۝   اَللّٰهُمَّ لَا يُهْزَمُ جُنْدُكَ   ۝   وَلَا يُخْلَفُ وَعْدُكَ   ۝    وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ   ۝   سُبْحَانَكَ وَبِحَمْدِكَ ۝ 
    """, russian: """
    Аллоҳим! Сен (жазолаш учун) маҳкам тутадиган нарсалар ёмонлигидан карамли Зотингга ва мукаммал (бенуқсон) калималарингга сиғинаман! Аллоҳим! Қарз юкини ва гуноҳларни фақат Сен бартараф қилурсан! Аллоҳим! Сенинг лашкарларинг мағлуб қилинмас! Сенинг вадангга қарши иш бўлмас! Ҳеч бир шон-шарафни бергувчи Сенсан! Сен (нуқсон сифатларидан) пок ва муназзаҳсан, дея тасбиҳ ила Сенга ҳамд айтурман!
Таржимон изоҳи: Дуодаги "Охизун биносиятиҳ" ифодаси Қурондандир,  Аллоҳ таоло айтади (маноси) "Йўқ! (Тўхтасин у!) Агар у (куфридан ва бу аҳволидан) қайтмаса, қасамки,  Биз (уни) манглайидан (ушлаб), ўша ёлғончи, гуноҳкор манглай (соч)идан тутиб,  (жаҳаннамга) судрагаймиз. (96/Алақ, 15-16).
    """),
    DailyArabicRussianModel(arabic: """
    أَعُوذُ بِكَلِمَاتِ اللّٰهِ التَّامَّةِ مِنْ غَضَبِه۪ وَشَرِّ عِبَادِه۪    ۝   وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِ ۝ 
    """, russian: """
    Аллоҳнинг ғазабидан, бандаларнинг ёмонлигидан, келиб - кетгувчи шайтонларнинг васвасаларидан ва менга яқинлашишларидан Аллоҳнинг мукаммал -- бекам-кўст калималарига сиғинаман! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا   ۝    وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ   ۝   فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ   ۝    وَارْحَمْنِي   ۝   إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ ۝ 
    """, russian: """
    Аллоҳим! Мен ўз-ўзимга кўп зулм қилдим! Гуноҳларни мағфират қилгувчи эса фақат Сенсан! Бас, (чексиз лутфинг ила) Ўз ҳузурингдан бўлган бир мағфират билан мени мағфират қил ва менга раҳм қил, чунки Сен беҳад мағфиратли, бениҳоят раҳмли Зотсан! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ الْهُدٰى وَالتُّقٰى وَالْعَفَافَ وَالْغِنٰى ۝
    """, russian: """
    Аллоҳим! Сендан ҳидоят, тақво, иффат ва (кўнгил) бойлиг(ини) тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ  إِنِّي أَعُوذُ بِكَ مِنَ الْجُوعِ   ۝    فَإِنَّهُ بِئْسَ الضَّجِيعُ   ۝   وَأَعُوذُ بِكَ مِنَ الْخِيَانَةِ   ۝   فَإِنَّهَا بِئْسَتِ الْبِطَانَةُ ۝ 
    """, russian: """
    Аллоҳим! Очликдан  Сендан паноҳ тилайман, чунки очлик (бетоқат қилувчи) қандай ёмон ҳолдир! Ҳиёнатдан Ўзингдан паноҳ тилайман, чунки у қандай ёмон бир фельдир!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ  إِنِّي أَسْأَلُكَ الثَّبَاتَ فِي الْأَمْرِ   ۝   وَأَسْأَلُكَ عَزِيمَةَ الرُّشْدِ   ۝   وَأَسْأَلُكَ شُكْرَ نِعْمَتِكَ وَحُسْنَ عِبَادَتِكَ  ۝   وَأَسْأَلُكَ لِسَانًا صَادِقًا وَقَلْبًا سَلِيمًا   ۝   وَأَعُوذُ بِكَ مِنْ شَرِّ مَا تَعْلَمُ   ۝   وَأَسْأَلُكَ مِنْ خَيْرِ مَا تَعْلَمُ   ۝   وَأَسْتَغْفِرُكَ مِمَّا تَعْلَمُ   ۝   إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ ۝ 
    """, russian: """
    Аллоҳим! Сендан иш(ларим)да сабот тилайман! Ва Сендан тўгриликда - ҳақ йўлда азимат тилайман! Сендан нематларингга  шукр қилмоқ, Ўзингга яхши ва гўзал ибодат қилмоқ учун ёрдам тилайман! Сендан тўғри - ростгўй бир тил ва қалби салим -  (ширк, нифоқ, ирим ва ғиллу ғашликдан холи) соғлом бир қалб тилайман! Сен (мен ҳақимда) билган нарсаларинг шарридан Сендан паноҳ тилайман! Сен (мен ҳақимда) билган нарсаларнинг хайрлисини Сендан тилайман!  Сен (мен ҳақимда) билган гуноҳлардан Ўзингдан мағфират тилайман! Албатта, Сен ғайбларни - яширин нарсаларни билгувчисан!
    """),
    DailyArabicRussianModel(arabic: """
   اَللّٰهُمَّ إِنِّي أَسْأَلُكَ حُبَّكَ   ۝   وَحُبَّ مَنْ يُحِبُّكَ   ۝   وَالْعَمَلَ الَّذِي يُبَلِّغُنِي حُبَّكَ   ۝   اَللّٰهُمَّ اجْعَلْ حُبَّكَ   ۝    أَحَبَّ إِلَيَّ مِنْ نَفْسِي وَأَهْلِي وَمِنَ الْمَاءِ الْبَارِدِ ۝  
    """, russian: """
    Аллоҳим! Сени севмоқни, Сени севганларни севмоқни ва Сенинг муҳаббатингга етказадиган амалларни севмоқни Сендан тилайман! Аллоҳим! Ўз муҳаббатингни менга жонимдан, аҳли оиламдан  ва муздек сувдан ҳам кўра севимли қил!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلًا مُتَقَبَّلاً ۝ 
    """, russian: """
    Аллоҳим! Сендан фойдали илм, пок-ҳалол ризқ ва қабул бўладиган амал тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ   ۝   وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ ۝ 
    """, russian: """
    Аллоҳим! Мени (ҳақиқий) тавба қилгувчилардан ва поклангувчилардан айла!
    """),
    DailyArabicRussianModel(arabic: """
    بِسْمِ اللّٰهِ تَوَكَّلْتُ عَلَى اللّٰهِ   ۝   لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ ۝ 
    """, russian: """
    Аллоҳнинг исми билан; Аллоҳга таваккул қилдим. Бутун куч ва қувват фақат Аллоҳдандир (Унинг лутфу эҳсони биландир)! 
    """),
    DailyArabicRussianModel(arabic: """
    اَلْحَمْدُ لِلّٰهِ الَّذِي كَفَانِي وَاٰوَانِي وَأَطْعَمَنِي وَسَقَانِي   ۝    وَالَّذِي مَنَّ عَلَيَّ فَأَفْضَلَ   ۝   وَالَّذِي أَعْطَانِي فَأَجْزَلَ   ۝   اَلْحَمْدُ لِلّٰهِ عَلٰى كُلِّ حَالٍ   ۝   اَللّٰهُمَّ رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ وَإِلٰهَ كُلِّ شَيْءٍ   ۝   أَعُوذُ بِكَ مِنَ النَّارِ ۝ 
    """, russian: """
    Ҳожатларимни қондирган, менга бошпана берган, едирган ва ичирган Аллоҳга ҳамд бўлсин!  Менга немат берган - икром айлаган ва нематини - икромини мўл қилган, менга ато қилган ва атосини мўл қилган Аллоҳга ҳамд бўлсин! Ҳар ҳол учун Аллоҳга ҳамд бўлсин! Эй ҳамма нарсанинг Рабби ва эгаси-ҳукмрони, эй ҳамма нарсанинг илоҳи! Дўзах оловидан Ўзингга сиғинаман! (Ўзинг асра!)
    """),
    DailyArabicRussianModel(arabic: """
    اَلْحَمْدُ لِلّٰهِ الَّذِي عَافَانِي فِي جَسَدِي   ۝   وَرَدَّ عَلَيَّ رُوحِي   ۝   وَأَذِنَ لِي بِذِكْرِه۪ ۝
    """, russian: """
    Жасадимга офият - сиҳат-саломатлик, омонлик берган, руҳимни менга қайтарган, Ўз зикрини менга насиб этган Аллоҳга ҳамд бўлсин! 
    """),
    DailyArabicRussianModel(arabic: """
    أَعُوذُ بِكَلِمَاتِ اللّٰهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ   ۝    وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ ۝ 
    """, russian: """
    Ҳар турли шайтон ва заҳарли махлуқлардан, бутун ёмон (суқ ва) кўзлардан Аллоҳнинг мукаммал - бекам-кўст калималарига сиғинаман!
    """),
  ],
  // Wendesday
  [
    DailyArabicRussianModel(arabic: """
    وَاِلٰهُكُمْ اِلٰهٌ وَاحِدٌۚ لَٓا اِلٰهَ اِلَّا هُوَ الرَّحْمٰنُ الرَّح۪يمُ ۝ 
    """, russian: """
  Сизларнинг илоҳингиз бир илоҳ (Аллоҳ)дир. Ундан бошқа (ҳеч бир) илоҳ йўқ. У Раҳмондир (дунёда бутун махлуқотига марҳамат қилгувчидир), Рахиймдир (охиратда фақат мўминларга раҳмат қилгувчидир)  (2/Бақара,  163).  
    """),
    DailyArabicRussianModel(arabic: """
    َللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۚ اَلْحَيُّ الْقَيُّومُۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌۜ لَهُ مَا فِي السَّمٰوَاتِ وَمَا فِي الْاَرْضِۜ مَنْ ذَا الَّذ۪ي يَشْفَعُ عِنْدَهُٓ اِلَّا بِاِذْنِه۪ۜ يَعْلَمُ مَا بَيْنَ اَيْد۪يهِمْ وَمَا خَلْفَهُمْۚ وَلَا يُح۪يطُونَ بِشَيْءٍ مِنْ عِلْمِه۪ٓ اِلَّا بِمَا شَٓاءَۚ وَسِعَ كُرْسِيُّهُ السَّمٰوَاتِ وَالْاَرْضَۚ وَلَا يَؤُ۫دُهُ حِفْظُهُمَاۚ وَهُوَ الْعَلِيُّ الْعَظ۪يمُ   ۝   لَٓا اِكْرَاهَ فِي الدّ۪ينِ قَدْ تَبَيَّنَ الرُّشْدُ مِنَ الْغَيّۚ فَمَنْ يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِنْ بِاللّٰهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقٰىۗ لَا انْفِصَامَ لَهَاۜ وَاللّٰهُ سَم۪يعٌ عَل۪يمٌ   ۝   اَللّٰهُ وَلِيُّ الَّذ۪ينَ اٰمَنُواۙ يُخْرِجُهُمْ مِنَ الظُّلُمَاتِ اِلَى النُّورِۜ وَالَّذ۪ينَ كَفَرُٓوا اَوْلِيَٓاؤُ۬هُمُ الطَّاغُوتُۙ يُخْرِجُونَهُمْ مِنَ النُّورِ اِلَى الظُّلُمَاتِۜ اُو۬لٰٓئِكَ اَصْحَابُ النَّارِۚ هُمْ ف۪يهَا خَالِدُونَ۟ ۝ 
    """, russian: """
    Аллоҳ шундай бир илоҳки, ундан бошқа ҳеч бир илоҳ йўқ. У Ҳайй ва Қайюмдир (абадий тирик ва яратганларини сақлаб, кузатиб тургувчидир ва ҳамма нарса ҳаётини У билан давом эттирур). Уни на бир мудроқ (ғафлат) ва на бир уйқу тутар. Осмонларда ва ерда бор нарсалар(нинг ҳаммаси) фақат Уникидир. Унинг изни бўлмагунича, Унинг ҳузурида ким шафоат қила олур? Бандаларининг олдидаги ва ортидаги (ўтмиш ва келажакларини, қилган ва қилажак ишларини, дунё ва охиратга оид) нарсаларини У билур. Улар Унинг илмидан фақар У хоҳлаган миқдоридан бошқа бир нарсани қамрай олмаслар. Унинг Курсиси (қудрати, мулки, салтанати ва ҳукмронлиги) осмонларни ва ерни қамрагандир; уларни муҳофаза қилиб туриш Унга оғир келмас.  У беҳад олийдир, бениҳоят буюкдир. Дин(га киришда - иймон келтириш)да мажбурлаш йўқ. Тўғрилик билан эгрилик (иймон билан куфр, ҳақ билан ботил) очиқ - аён бўлди. Бас, кимки тоғутни (Аллоҳдан узоқлаштирувчи ва Унинг амрларини бажаришдан ман этувчиларни) инкор қилиб, Аллоҳга иймон келтирса, энди у ҳеч узулиши (мумкин) бўлмаган мустаҳкам ҳалқага ёпишгандир. Аллоҳ (ҳамма нарсани) ҳаққоний эшитгувчидир, билгувчидир.Аллоҳ иймон келтирганларни дўсти ва мададкоридир; уларни (куфр, ширк, даҳрийлик ва ҳар турли ботил ҳаёт ва тушунчалар каби) қоронғуликлардан ёруғликка чиқарур. Кофирларнинг дўстлари эса тоғут (Аллоҳдан узоқлаштирувчи ва Унинг амрларини бажаришдан ман этувчилар)дирки, улар эса уларни ёруғликдан (нурли йўлдан) қоронғуликларга чиқарур. Ана ўшалар олов (дўзах) аҳлидирлар, улар у ерда абадий қолурлар (2/Бақара,  255-257).
    """),
    DailyArabicRussianModel(arabic: """
    الٓم    ۝   اَللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۙ الْحَيُّ الْقَيُّومُۜ   ۝   نَزَّلَ عَلَيْكَ الْكِتَابَ بِالْحَقِّ مُصَدِّقًا لِمَا بَيْنَ يَدَيْهِ وَاَنْزَلَ التَّوْرٰيةَ وَالْاِنْج۪يلَۙ   ۝   مِنْ قَبْلُ هُدًى لِلنَّاسِ وَاَنْزَلَ الْفُرْقَانَۜ اِنَّ الَّذ۪ينَ كَفَرُوا بِاٰيَاتِ اللّٰهِ لَهُمْ عَذَابٌ شَد۪يدٌۜ وَاللّٰهُ عَز۪يزٌ ذُو انْتِقَامٍ   ۝   اِنَّ اللّٰهَ لَا يَخْفٰى عَلَيْهِ شَيْءٌ فِي الْاَرْضِ وَلَا فِي السَّمَٓاءِۜ   ۝   هُوَ الَّذ۪ي يُصَوِّرُكُمْ فِي الْاَرْحَامِ كَيْفَ يَشَٓاءُۜ لَٓا اِلٰهَ اِلَّا هُوَ الْعَز۪يزُ الْحَك۪يمُ ۝ 
    """, russian: """
   Алиф. Лом Мим. Аллоҳки, Ундан бошқа ҳеч бир илоҳ йўқдир. У Ҳайй ва Қайюмдир  (абадий тирикдир ва яратганларини кузатиб-бошқариб тургувчидир; ҳамма нарса У билан ҳаётини давом эттирур).  (Аллоҳ бу) Китобни сизга аниқ ҳақ ( ва ҳақиқат) билан (тўла ва) ўзидан олдинги (китоб)ларни(нг аслларини) тасдиқловчи этиб нозил қилди. Бундан олдин инсонларни тўғри йўлга бошламоқ учун Тавротни ва Инжилни нозил қилган эди, ва ниҳоят, Фурқонни (ҳақ билан ботилни ажратувчи Қуронни) ҳам нозил қилди. Аллоҳнинг оятларини тан олмаганлар борки, улар учун аниқ шиддатли азоб бордир. Аллоҳ мутлоқ ғолиб ва беомон жазолагувчи - (мазлумларнинг) интиқомини олгувчидир. Шубҳасиз, ерда ва осмонда ҳеч бир нарса Аллоҳга махфий қолмас. Бачадонларда сизларга қандай хоҳласа, ўшандай шакл-суврат бергувчи Удир. Ундан бошқа илоҳ йўқ. (У) мутлақ ғолиб, ҳукм ва ҳикмат соҳибидир  (3/Оли Имрон,  1-6).
 
    """),
    DailyArabicRussianModel(arabic: """
    مَا كَانَ اِبْرٰه۪يمُ يَهُودِيًّا وَلَا نَصْرَانِيًّا وَلٰكِنْ كَانَ حَن۪يفًا مُسْلِمًاۜ وَمَا كَانَ مِنَ الْمُشْرِك۪ينَ ۝ 
    """, russian: """
    Иброҳим на яҳудий эди, на насроний эди. Лекин у Аллоҳни бир деб билган соф - тўғри бир мусулмон эди; (асло) мушриклардан эмас эди  (3/Оли Имрон, 67).
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۜ لَيَجْمَعَنَّكُمْ اِلٰى يَوْمِ الْقِيٰمَةِ لَا رَيْبَ ف۪يهِۜ وَمَنْ اَصْدَقُ مِنَ اللّٰهِ حَد۪يثًا۟ ۝ 
    """, russian: """
    Аллоҳ, (У чин илоҳдирки), Ундан бошқа ҳеч бир илоҳ йўқдир; келишида шак-шубҳа бўлмаган қиёмат кунида сизларни, албатта, тўплагайдир. Аллоҳдан кўра энг тўғри сўзлик ким бор?  (4/Нисо, 87).
    """),
    DailyArabicRussianModel(arabic: """
لَقَدْ كَفَرَ الَّذ۪ينَ قَالُٓوا اِنَّ اللّٰهَ ثَالِثُ ثَلٰثَةٍۢ وَمَا مِنْ اِلٰهٍ اِلَّا اِلٰهٌ وَاحِدٌۜ وَاِنْ لَمْ يَنْتَهُوا عَمَّا يَقُولُونَ لَيَمَسَّنَّ الَّذ۪ينَ كَفَرُوا مِنْهُمْ عَذَابٌ اَل۪يمٌ ۝     
    
    """, russian: """
    "Ҳақиқатан, Аллоҳ учтанинг учинчиси (уч илоҳдан бири(дир)" деганлар (ширкка тушиб), муҳаққақ, кофир бўлдилар. Ҳолбуки, (ибодатга лойиқ) бир илоҳдан бошқа илоҳ йўқ. Агар (бу) айтаётган сўзларидан (ботил этиқодларидан) қайтмасалар, улардан кофир бўлиб қолганларига, албатта, жуда аламли бир азоб етгайдир (5/Моида, 73).

    """),
    DailyArabicRussianModel(arabic: """
    ذٰلِكُمُ اللّٰهُ رَبُّكُمْۚ لَٓا اِلٰهَ اِلَّا هُوَۚ خَالِقُ كُلِّ شَيْءٍ فَاعْبُدُوهُۚ وَهُوَ عَلٰى كُلِّ شَيْءٍ وَك۪يلٌ ۝ 
    """, russian: """
    Ана шу  Аллоҳ сизнинг Раббингиздир. Ундан бошқа ҳеч бир илоҳ (Рабб) йўқ. Ҳамма нарсани яратган Удир. У ҳолда Унга бандалик қилинглар. У ҳамма нарса устидан вакилдир - қудратли тасарруф эгасидир (6/Аном,  102).

    """),
    DailyArabicRussianModel(arabic: """
    اِتَّبِعْ مَٓا اُو۫حِيَ اِلَيْكَ مِنْ رَبِّكَۚ لَٓا اِلٰهَ اِلَّا هُوَۚ وَاَعْرِضْ عَنِ الْمُشْرِك۪ينَ ۝ 
    """, russian: """
    (Эй Расулим!)  Раббингиздан сизга ваҳй қилинган нарсага эргашинг; Ундан бошқа ҳеч бир илоҳ йўқ. (Аллоҳнинг сифатларини, Рабблигини, ҳукм ва ҳукмронлигини бошқаларга тақайдиган) мушриклардан юз ўгиринг!  (6/Аном, 106)
    """),
    DailyArabicRussianModel(arabic: """
    قُلْ يَٓا اَيُّهَا النَّاسُ اِنّ۪ي رَسُولُ اللّٰهِ اِلَيْكُمْ جَم۪يعًاۨ الَّذ۪ي لَهُ مُلْكُ السَّمٰوَاتِ وَالْاَرْضِۚ لَٓا اِلٰهَ اِلَّا هُوَ يُحْي۪ وَيُم۪يتُۖ فَاٰمِنُوا  بِاللّٰهِ وَرَسُولِهِ النَّبِيِّ الْاُمِّيِّ الَّذ۪ي يُؤْمِنُ بِاللّٰهِ وَكَلِمَاتِه۪ وَاتَّبِعُوهُ لَعَلَّكُمْ تَهْتَدُونَ ۝ 
    """, russian: """
    (Эй Расулим!) Айтингки: "Эй Инсонлар! Шубҳасиз, мен сизларнинг  ҳаммангиз учун (юборилган) Аллоҳнинг пайғамбариман. Ул  (Аллоҳ)ки, осмонларнинг ва ернинг мулки ва ҳукмронлиги Уникидир. Ундан бошқа ҳеч бир илоҳ йўқ. У ҳам тирилтирур,  ҳам ўлдирур. У ҳолда Аллоҳга иймон келтиринглар;  Аллоҳга ва Унинг сўзларига (бошқа пайғамбарларга оид хабарларга, уларга тушган  Китобларига ва ўзига туширилган ваҳйга дилдан) ишонадиган, Унинг уммий Пайғамбари бўлган Расулига ҳам иймон келтиринглар. Ва унга эргашинглар, токи тўғри йўлни топгайсизлар" (7/Ароф, 158).
    """),
    DailyArabicRussianModel(arabic: """
    يُنَزِّلُ الْمَلٰٓئِكَةَ بِالرُّوحِ مِنْ اَمْرِه۪ عَلٰى مَنْ يَشَٓاءُ مِنْ عِبَادِه۪ٓ اَنْ اَنْذِرُٓوا اَنَّهُ لَٓا اِلٰهَ اِلَّا اَنَا۬ فَاتَّقُونِ ۝ 
    """, russian: """
    У (Аллоҳ) бандаларидан хоҳлаганига фаришталарни Ўз амри (бўлмиш) ваҳй билан туширур; "(Инсонларни) огоҳлантиринглар, шубҳасиз, Мендан бошқа илоҳ йўқ;  бас, Менга тақво қилинглар (амрларимга мос яшанглар, қарши боришдан сақланинглар)", дея (16/Наҳл,  2).

    """),
    DailyArabicRussianModel(arabic: """
    وَاِنْ تَجْهَرْ بِالْقَوْلِ فَاِنَّهُ يَعْلَمُ السِّرَّ وَاَخْفٰى   ۝   اَللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۜ لَهُ الْاَسْمَٓاءُ الْحُسْنٰى ۝ 
    """, russian: """
    Овозингизни (дуода) баланд қилсангиз (ҳам, паст қилсангиз) ҳам, (Унга бари бирдир), чунки У яширин нарсани ҳам, махфийнинг махфийсини ҳам билур. Аллоҳ улдирки, Ундан бошқа илоҳ йўқдир. Энг гўзал исмлар Уникидир. (20/Тоҳо,  7-8).
    """),
    DailyArabicRussianModel(arabic: """
    وَاَنَا اخْتَرْتُكَ فَاسْتَمِعْ لِمَا يُوحٰى   ۝   اِنَّن۪ٓي اَنَا اللّٰهُ لَٓا اِلٰهَ اِلَّا اَنَا۬ فَاعْبُدْن۪يۙ وَاَقِمِ الصَّلٰوةَ لِذِكْر۪ي ۝ 
    """, russian: """
    "Мен (пайғамбарликка) сени танладим, энди ваҳй қилинадиган нарсани тингла".  Шубҳасиз, мен Ўзим Аллоҳдирман.  Мендан бошқа ҳеч бир илоҳ йўқ. Менга бандалик қил ва Мени зикр қилиш учун тўғри-тўкис намоз ўқи!"  (20/Тоҳо, 13-14).
    """),
    DailyArabicRussianModel(arabic: """
    وَمَٓا اَرْسَلْنَا مِنْ قَبْلِكَ مِنْ رَسُولٍ اِلَّا نُوح۪ٓي اِلَيْهِ اَنَّهُ لَٓا اِلٰهَ اِلَّا اَنَا۬ فَاعْبُدُونِ ۝ 
    """, russian: """
    Бинобарин, Биз сиздан олдин юборган ҳеч бир пайғамбар йўқки, унга: "Шубҳасиз, Мендан бошқа ҳеч бир илоҳ йўқ, бас, Менга бандалик қилинглар", дея ваҳй қилмаган бўлсак (21/Анбиё, 25).
    """),
    DailyArabicRussianModel(arabic: """
    وَذَا النُّونِ اِذْ ذَهَبَ مُغَاضِبًا فَظَنَّ اَنْ لَنْ نَقْدِرَ عَلَيْهِ فَنَادٰى فِي الظُّلُمَاتِ اَنْ لَٓا اِلٰهَ اِلَّا اَنْتَ سُبْحَانَكَۗ اِنّ۪ي كُنْتُ مِنَ الظَّالِم۪ينَۚ ۝ 
    """, russian: """
    Зуннунни (балиқ эгаси бўмиш Юнусни) ҳам (эсланг). Вақтида у (қавмидан) ғазабланган ҳолда (чиқиб) кетган эди ва Биз уни торликка олмаслигимизни (қутулиб кетишини) гумон қилган эди. Ниҳоят, зулматлар ичида (балиқ қорни, денгиз қари ва кеча  зулматида туриб): "Сендан бошқа илоҳ йўқ, Сен (ҳар қандай нуқсон сифатларидан) поксан. Дарҳақиқат, мен (бу ҳаракатим билан) ўз-ўзимга зулм қилувчилардан бўлдим", деб нидо-илтижо қилди (21/Анбиё, 87).

    """),
    DailyArabicRussianModel(arabic: """
    فَتَعَالَى اللّٰهُ الْمَلِكُ الْحَقُّ لَٓا اِلٰهَ اِلَّا هُوَۚ رَبُّ الْعَرْشِ الْكَر۪يمِ ۝ 
    """, russian: """
Ҳақ ҳукмдор бўлган Аллоҳ беҳад олийдир. Ундан бошқа илоҳ йўқ. (У) буюк-карамли Аршнинг Раббидир (23/Муминун, 116).    
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَ رَبُّ الْعَرْشِ الْعَظ۪يمِ ۝ 
    """, russian: """
    Аллоҳки, Ундан бошқа ҳеч бир илоҳ йўқ,  У буюк  Аршнинг Рабби (эгаси)дир!  (27/Намл, 26).
    """),
    DailyArabicRussianModel(arabic: """
وَلَا تَدْعُ مَعَ اللّٰهِ اِلٰهًا اٰخَرَۢ لَٓا اِلٰهَ اِلَّا هُوَ۠ كُلُّ شَيْءٍ هَالِكٌ اِلَّا وَجْهَهُۜ لَهُ الْحُكْمُ وَاِلَيْهِ تُرْجَعُونَ ۝     
    """, russian: """
    Аллоҳ билан бирга бошқа бир илоҳга илтижо-ибодат қилманг!  Ундан бошқа ҳеч бир илоҳ йўқ! Унинг зотидан бошқа (моддий) ҳамма нарса ҳалок бўлгувчидир. Ҳукм ва (мутлақ ҳукмронлик) ёлғиз Уникидир ва сизлар фақат Унгагина қайтарилгайсиз. (28/Қасас, 88).

    """),
    DailyArabicRussianModel(arabic: """
    يَٓا اَيُّهَا النَّاسُ اذْكُرُوا نِعْمَتَ اللّٰهِ عَلَيْكُمْۜ هَلْ مِنْ خَالِقٍ غَيْرُ اللّٰهِ يَرْزُقُكُمْ مِنَ السَّمَٓاءِ وَالْاَرْضِۜ لَٓا اِلٰهَ اِلَّا هُوَۘ فَاَنّٰى تُؤْفَكُونَ ۝ 
    """, russian: """
Эй инсонлар! Аллоҳнинг сизларга бўлган нематини ёд этинглар!  Сизларга осмондан ва ердан ризқ берадиган Аллоҳдан бошқа бир яратгувчи борми?! Ундан бошқа ҳеч бир илоҳ йўқ! У ҳолда қандай (иймондан) ўгирилиб кетмоқдасизлар (ва бошқа борлиқларга сиғинмоқдасизлар)?! 
 (35/Фотир, 3).
    """),
    DailyArabicRussianModel(arabic: """
اِنَّهُمْ كَانُٓوا اِذَا ق۪يلَ لَهُمْ لَٓا اِلٰهَ اِلَّا اللّٰهُ يَسْتَكْبِرُونَۙ ۝     
    """, russian: """
    Чунки уларга (мужрим-гуноҳкорларга): "Аллоҳдан бошқа ҳеч бир илоҳ йўқ"  дейилган вақтда такаббурлик қилар эдилар   (37/Соффат,  35).
    """),
    DailyArabicRussianModel(arabic: """
    قُلْ اِنَّمَٓا اَنَا۬ مُنْذِرٌۗ وَمَا مِنْ اِلٰهٍ اِلَّا اللّٰهُ الْوَاحِدُ الْقَهَّارُۚ ۝ 
    """, russian: """
    (Эй Расулим!) Айтинг: "Мен фақат (Аллоҳ номидан) бир огоҳлантирувчиман!  Ягона ва қаҳр қилгувчи Аллоҳдан бошқа илоҳ йўқ!  (38/Сод, 65).
    """),
    DailyArabicRussianModel(arabic: """
    حٰمٓۜ   ۝   تَنْز۪يلُ الْكِتَابِ مِنَ اللّٰهِ الْعَز۪يزِ الْعَل۪يمِۙ   ۝   غَافِرِ الذَّنْبِ وَقَابِلِ التَّوْبِ شَد۪يدِ الْعِقَابِ ذِي الطَّوْلِۜ لَٓا اِلٰهَ اِلَّا هُوَۜ اِلَيْهِ الْمَص۪يرُ ۝ 
    """, russian: """
    Ҳа.  Мим. Бу Китобнинг нозил қилиниши мутлақ ғолиб ва (ҳамма нарсани) ҳаққоний билгувчи, гуноҳни мағфират қилгувчи, тавбани қабул этгувчи, азоби шиддатли бўлган, ҳам яна лутфу карам соҳиби бўлган Аллоҳ тарафидандир. Ундан бошқа ҳеч бир илоҳ йўқ. Қайтиш фақат Унгадир. (40/Мумин/Ғофир,  1-3).
    """),
    DailyArabicRussianModel(arabic: """
    هُوَ الْحَيُّ لَٓا اِلٰهَ اِلَّا هُوَ فَادْعُوهُ مُخْلِص۪ينَ لَهُ الدّ۪ينَۜ اَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَم۪ينَ ۝ 
    """, russian: """
    У ҳамиша тирикдир. Бошқа ҳеч бир илоҳ йўқ, фақат У (Аллоҳ) бор. Динни ёлғиз Унга хос қилиб, ихлосли холда Унга дуо қилинглар. Ҳамд  (фақатгина) оламлар Рабби бўлган Аллоҳгадир  (40/Мумин/Ғофир, 65).
    """),
    DailyArabicRussianModel(arabic: """
    رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَٓا اِلٰهَ اِلَّا هُوَ فَاتَّخِذْهُ وَك۪يلًا ۝ رَبُّ الْمَشْرِقِ وَالْمَغْرِبِ لَٓا اِلٰهَ اِلَّا هُوَ فَاتَّخِذْهُ وَك۪يلًا ۝ 
    """, russian: """
    У машриқнинг ва мағрибнинг Раббидир. Ундан бошқа ҳеч бир илоҳ йўқ. Ёлғиз Уни вакийл тутинг (Унга боғланинг ва ёлғиз Унга қуллуқ қилинг)  (73/Музаммил, 9).
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ  ۝   وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ ۝ 
    """, russian: """
    хадиси шарифлар
    
    
    Аллоҳим! Мени ҳалолинг билан қаноатлантир, ҳаром (ризқ)ларингдан узоқлаштир!  Фазлу караминг билан мени бадавлат қил - Ўзингдан ўзгага муҳтож айлама!
    """),
    DailyArabicRussianModel(arabic: """
رَبِّ أَعِنِّي وَلَا تُعِنْ عَلَيَّ   ۝   وَانْصُرْنِي وَلَا تَنْصُرْ عَلَيَّ    ۝    وَامْكُرْ لِي وَلَا تَمْكُرْ عَلَيَّ   ۝   وَاهْدِنِي وَيَسِّرِ الْهُدٰى لِي   ۝   وَانْصُرْنِي عَلٰى مَنْ بَغٰى عَلَيَّ   ۝   رَبِّ اجْعَلْنِي لَكَ شَكَّارًا لَكَ ذَكَّارًا لَكَ رَهَّابًا لَكَ مُطِيعًا   ۝   إِلَيْكَ مُخْبِتًا   ۝   إِلَيْكَ أَوَّاهًا مُنِيبًا   ۝   رَبِّ تَقَبَّلْ تَوْبَتِي وَاغْسِلْ حَوْبَتِي وَأَجِبْ دَعْوَتِي   ۝   وَاهْدِ قَلْبِي وَسَدِّدْ لِسَانِي وَثَبِّتْ حُجَّتِي   ۝   وَاسْلُلْ سَخِيمَةَ قَلْبِي ۝     
    """, russian: """
Ё Раббим! Менга ёрдам бер, менга қарши бўлган (ноаҳл)га ёрдам қилма! Мени ғолиб қил, менга қарши бўлган (ноаҳл)ни устун қилма! Менинг фойдамга чора-тадбир қил, менга қарши бўлган (ноаҳл)ларнинг макру ҳийлаларни барбод қил! Мени тўғри йўлга бошла ва тўғри йўлда (Сенинг йўлингда) бўлмоқни менга осон қил!  Менга зулм қилгувчиларга қарши менга нусрат бер!
Ё Раббим! Мени Ўзингга шукр қилгувчилардан айла, Ўзингдан қўрқувчилардан қил ва (доим) Сенга итоат этгувчилардан айла ва Сенга тавозу этгувчилардан, Сенга қайтгувчилардан - тавба қилгувчилардан айла! Эй Раббим! Тавбамни қабул эт, гуноҳимни юв, дуойимни ижобат қил! Қалбимга ҳидоят насиб эт! Тилимни тўғри қил! Далил-ҳужжатимни собит-мустаҳкам қил. Қалбимдан нафрат туйғусини чиқариб ташла!
    
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا   ۝   وَصَغِيرِنَا وَكَبِيرِنَا    ۝   وَذَكَرِنَا وَأُنْثَانَا   ۝   وَشَاهِدِنَا وَغَائِبِنَا   ۝   اَللّٰهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِه۪ عَلَى الْإِيمَانِ   ۝   وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الْإِسْلَامِ ۝ 
    """, russian: """
    Аллоҳим! Ҳаётдагиларимизни,  ўлганларимизни,  кичикларимизни, катталаримизни,  эркакларимизни, аёлларимизни, ҳозирларимизни ва (бу ерда бўлмаган) ғолибларимизни мағфират қил! Аллоҳим! Сен биздан кимга ҳаёт берган бўлсанг, уни иймонда яшат ва биздан кимни  вафот эттирсанг, уни Исломда вафот эттир!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ أَعِنِّي عَلٰى سَكَرَاتِ الْمَوْتِ ۝ 
    """, russian: """
    Аллоҳим! Ўлим ҳолларида менга ёрдам бер.
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي وَإِسْرَافِي فِي أَمْرِي     ۝    وَمَا أَنْتَ أَعْلَمُ بِه۪ مِنِّي    ۝    اَللّٰهُمَّ اغْفِرْ لِي جِدِّي وَهَزْلِي وَخَطَئِي وَعَمْدِي   ۝   وَكُلُّ ذٰلِكَ عِنْدِي   ۝   اَللّٰهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ   ۝   وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ   ۝   وَمَا أَنْتَ أَعْلَمُ بِه۪ مِنِّي   ۝   أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ وَأَنْتَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ ۝ 
    """, russian: """
    Аллоҳим! Хато - гуноҳларимни, жаҳолат (билан қилган қилмишлар)имни, ҳаддан ошиб қилган (айб) ишларимни ва мендан кўра Ўзинг яхши билган қилмишларимни ва мендан кўра ўзинг яхши билган қилмишларимни кечир! Аллоҳим! Жиддий ва ҳазил (билан қилган иш)ларимни, хатоан ва қасдан қилган қилмишларимники, буларнинг ҳаммаси менда бордик, кечир! Аллоҳим! Олдин қилган ва кейин қиладиган, яширин ва ошкор қилган ва мендан кўра Ўзинг яхши билган гуноҳларимни кечир! Олдинга олувчи  ҳам Сенсан, кейинга қолдирувчи ҳам Сенсан. Сен ҳамма нарсага қодирсан! 
    """),
    DailyArabicRussianModel(arabic: """
لَا إِلٰهَ إِلَّا اللّٰهُ الْحَلِيمُ الْكَرِيمُ   ۝   سُبْحَانَ اللّٰهِ رَبِّ الْعَرْشِ الْعَظِيمِ   ۝   اَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِينَ  ۝   أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ   ۝   وَعَزَائِمَ مَغْفِرَتِكَ   ۝    وَالْغَنِيمَةَ مِنْ كُلِّ بِرٍّ   ۝   وَالسَّلَامَةَ مِنْ كُلِّ إِثْمٍ   ۝   لَا تَدَعْ لِي ذَنْبًا إِلَّا غَفَرْتَهُ   ۝   وَلَا هَمًّا إِلَّا فَرَّجْتَهُ   ۝   وَلَا حَاجَةً هِيَ لَكَ رِضًا إِلَّا قَضَيْتَهَا   ۝   يَا أَرْحَمَ الرَّاحِمِينَ ۝     
    """, russian: """
    Ҳалийм (ҳилми-юмшоқлиги беқиёс) ва Карийм (карами чексиз) бўлмиш Аллоҳдан бошқа илоҳ йўқ! Буюк Аршнинг Рабби бўлмиш Аллоҳ (бутун нуқсон сифатларидан) пок ва муназзаҳдир!  Оламлар Рабби бўлмиш Аллоҳга ҳамд бўлсин! Сендан раҳматинг сабабларини, маъфиратинг йўллари-васийлаларини, ҳар бир яхшиликдан ғанимат-нематни қўлга киритмоқни, ҳар бир яхшиликдан саломат-омон бўлмоқни тилайман!  Менда ўзинг кечирмаган бирор гуноҳ, Ўзинг кетказмаган бирор ғам қолдирма, Сенинг ризолиғингга мувофиқ ҳар бир ҳожатимни Ўзинг раво қил, эй раҳмлиларнинг энг раҳмлиси (бўлган Аллоҳим)!

    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ   ۝   وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ ۝ 
    """, russian: """
    Аллоҳим! Берган нематинг йўқ бўлишидан,  берган офиятинг - сиҳат-саломатлик, тинчлик хотиржамлигинг бузилишидан, бирдан келадиган интиқоминг - жазоингдан ва ғазабингни келтирадиган ҳамма нарсадан Ўзингдан паноҳ тилайман!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اهْدِنِي وَسَدِّدْنِي ۝ 
    """, russian: """
    Аллоҳим! Мени ҳидоят қил ва тўғри йўлда менга муваффақият бер! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ   ۝   وَعَافِنِي فِيمَنْ عَافَيْتَ  ۝   وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ   ۝   وَبَارِكْ لِي فِيمَا أَعْطَيْتَ   ۝   وَقِنِي شَرَّ مَا قَضَيْتَ   ۝   فَإِنَّكَ تَقْضِي وَلَا يُقْضٰى عَلَيْكَ  ۝   وَإِنَّهُ لَا يَذِلُّ مَنْ وَالَيْتَ   ۝   تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ ۝ 
    """, russian: """
    Аллоҳим! Ҳидоят этган (банда)ларинг қатори мени ҳидоят қил!  Офият (тинчлик-омонлик, соғлик-саломатлик) берган (банда)ларинг қатори менга ҳам офият бер!  Дўст тутган бандаларинг қатори мени ҳам дўст тут! Ато этган ҳамма нарсаларингни мен учун ҳам муборак-баракотли қил! Тақдир қилган нарсаларинг ёмонлигидан мени асра!  Албатта, Сен (хоҳлаган нарсангни) тақдир қилурсан ва Сенинг тақдирингга қарши ҳукм қилинмас! Сен дўст тутган (сен ҳимоя қилган) киши ҳор бўлмас! Эй Раббимиз!  Сен (ҳар турли нуқсонлардан поксан) буюксан ва олийсан!
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيمِ   ۝   رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ   ۝   مُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ وَالْقُرْاٰنِ الْعَظِيمِ   ۝   أَنْتَ الْأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ   ۝    وَأَنْتَ الْاٰخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ   ۝   وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ   ۝   وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ   ۝   اِقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ ۝     
    """, russian: """
    Аллоҳим! Эй, етти қават осмоннинг ва буюк Аршнинг Рабби! Эй, бизнинг Раббимиз ва ҳамма нарсанинг Рабби! Эй Тавротни,  Инжилни ва Қурони азимни нозил қилган Зот! Сен Ўзидан  олдин ҳеч  нарса мавжуд бўлмаган Аввалсан! Сен ўзидан кейин ҳеч нарса бўлмайдиган Охирсан! Сен ўзидан юқори ҳеч нарса бўлмаган Зоҳирсан! Сен ўзидан ўзга ҳеч нарса бўлмаган Ботинсан!  Бизни қарз юкидан қутқар ва камбағалликдан бизни халос айла(б бадавлат қил)!

    """),
    DailyArabicRussianModel(arabic: """
    اَلْحَمْدُ لِلّٰهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَكَفَانَا وَاٰوَانَا   ۝   فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ ۝ 
    """, russian: """
    Бизга едириб ичирган, ҳожатларимизни қондирган ва бизга манзилу макон берган Аллоҳга ҳамд бўлсин! Ҳожатларини раво қилувчиси ва бошпана берувчиси бўлмаган қанчадан-қанча инсонлар бор!
    """),
  ],

  // Thursday
  [
    DailyArabicRussianModel(arabic: """
رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِنْ ذُرِّيَّتِنَٓا اُمَّةً مُسْلِمَةً لَكَۖ وَاَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَاۚ اِنَّكَ اَنْتَ التَّوَّابُ الرَّح۪يمُ ۝     
    """, russian: """
    "Эй Раббимиз! Иккимизни ҳам Ўзингга таслим бўлганлардан айла! Зурриётимиздан ҳам Ўзингга  бўйсунган (мусулмон) бир уммат пайдо қил! Бизга ибодат жойлари (ва усуллари)ни кўрсат!  (Бандалик билан йўл қўйган нуқсонларимизни авф айлаб) тавбамизни қабул эт! Чунки Сен тавбаларни кўп қабул қилгувчи ва бениҳоят раҳмли Зотсан!"  (2/Бақара, 128)
    """),
    DailyArabicRussianModel(arabic: """
    وَمِنْهُمْ مَنْ يَقُولُ رَبَّنَٓا اٰتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْاٰخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ ۝ 
    """, russian: """
    Улардан базилари эса: "Эй Раббимиз! Бизга дунёда ҳам яхшилик, охиратда ҳам яхшилик ато қил ва бизни дўзах азобидан асра!" - деди  (2/Бақара, 201).

    """),
    DailyArabicRussianModel(arabic: """
لَا يُكَلِّفُ اللّٰهُ نَفْسًا اِلَّا وُسْعَهَاۜ لَهَا مَا كَسَبَتْ وَعَلَيْهَا 
مَااكْتَسَبَتْۜ رَبَّنَا لَا تُؤَاخِذْنَٓا اِنْ نَس۪ينَٓا اَوْ اَخْطَأْنَاۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَٓا اِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذ۪ينَ مِنْ قَبْلِنَاۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِه۪ۚ وَاعْفُ عَنَّا۠ وَاغْفِرْ لَنَا۠ وَارْحَمْنَا۠ اَنْتَ مَوْلٰينَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِر۪ينَ ۝ 
    
    """, russian: """
Аллоҳ бирор кишини (ибодат ва итоатда) кучи етганидан ташқари (ортиқ) нарсага таклиф этмас. (Ҳар кимнинг) қилган (яхши) амали ўз фойдасига, қилмиш (ёмонликлар)и ҳам ўз зараригадир. "Эй Раббимиз! Унутсак ёки (беихтиёр) хато қилсак, бизни сўроққа тутма! Эй Раббимиз! Биздан олдинги (итоатсиз уммат)ларга юклаганинг каби бизларга (қийин, ҳалок этувчи) бир юк юклама! Эй Раббимиз! Кучимиз етмайдиган нарсаларни бизларга кўтартирма! Бизни авф эт, бизни мағфират айла, бизга раҳм қил! Сен Мавломиз (Эгамиз)сан; (Сени танимаган) кофирлар қавми устидан бизларга нусрат бер - ғалаба эҳсон айла!  (2/Бақара, 286).
    
    """),
    DailyArabicRussianModel(arabic: """
رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ اِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةًۚ اِنَّكَ اَنْتَ الْوَهَّابُ   ۝   رَبَّنَٓا اِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لَا رَيْبَ ف۪يهِۜ اِنَّ اللّٰهَ لَا يُخْلِفُ الْم۪يعَادَ۟ ۝ 

    """, russian: """
    (Улар дерларки:) "Эй Раббимиз! Бизни тўғри йўлга бошлаганингдан кейин қалбимизни (ҳақдан) оздирма! Бизга ўз ҳузурингдан раҳмат бахш айла! Шубҳасиз, Сен эҳсони энг кўп Зотсан!"  "Эй Раббимиз! Муҳаққақки, Сен инсонларни (келишидан асло) шубҳа  бўлмаган бир Кунда тўплагувчисан. Ҳеч шубҳасиз, Аллоҳ вадасидан қайтмас"  (3/Оли Имрон, 8-9).

    """),
    DailyArabicRussianModel(arabic: """
    اَلَّذ۪ينَ يَقُولُونَ رَبَّنَٓا اِنَّنَٓا اٰمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِۚ ۝
    """, russian: """
    (У тақво эгалари:)  "Эй Раббимиз" Биз ҳақиқатан иймон келтирдик, бас, бизнинг гуноҳларимизни кечир ва бизни дўзах азобидан асрагил!" дерлар (3/Оли Имрон, 16).

    """),
    DailyArabicRussianModel(arabic: """
    قُلِ اللّٰهُمَّ مَالِكَ الْمُلْكِ تُؤْتِي الْمُلْكَ مَنْ تَشَٓاءُ وَتَنْزِعُ الْمُلْكَ مِمَّنْ تَشَٓاءُۘ وَتُعِزُّ مَنْ تَشَٓاءُ وَتُذِلُّ مَنْ تَشَٓاءُۜ بِيَدِكَ الْخَيْرُۜ اِنَّكَ عَلٰى كُلِّ شَيْءٍ قَد۪يرٌ   ۝   تُولِجُ الَّيْلَ فِي النَّهَارِ وَتُولِجُ النَّهَارَ فِي الَّيْلِۘ وَتُخْرِجُ الْحَيَّ مِنَ الْمَيِّتِ وَتُخْرِجُ الْمَيِّتَ مِنَ الْحَيّۘ وَتَرْزُقُ مَنْ تَشَٓاءُ بِغَيْرِ حِسَابٍ ۝ 
    """, russian: """
    (Эй Расулим!) Айтинг: "Эй мулк (ва ҳукмронлик) эгаси бўлган Аллоҳим! Сен мулкни (подаҳоҳликни) хоҳлаган бандангга берурсан, хоҳлаган бандангдан мулкни (подшоҳликни) тортиб олурсан, хоҳлаган бандангни азиз қилурсан, хоҳлаган бандангни хор қилурсан, (ҳар турли) хайр-яхшилик ёлғиз Сенинг  қўлингдадир. Шубҳасиз,  Сен ҳамма нарсага қодирсан". "Сен кечани(нг соатларидан) кундузга киритурсан (кундузларни узайтирурсан), кундузни(нг соатларидан) эса кечага киритурсан (кечаларни узайтирурсан), ўликдан тирикни чиқарурсан, тирикдан эса ўликни чиқарурсан, хоҳлаган бандангга беҳисоб ризқ берурсан" (3/Оли Имрон, 26-27).

    """),
    DailyArabicRussianModel(arabic: """
رَبَّنَٓا اٰمَنَّا بِمَٓا اَنْزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِد۪ينَ ۝     
    """, russian: """
    "Эй Раббимиз! Биз - Сен нозил қилган нарсага (Китобга) иймон келтирдик ва Расулига эргашдик; бас, бизни шаходат келтирувчилар билан бирга ёзгил!"  (3/Оли Имрон, 53).
    """),
    DailyArabicRussianModel(arabic: """
    يَٓا اَيُّهَا الَّذ۪ينَ اٰمَنُوا لَا تَتَّخِذُوا الْكَافِر۪ينَ اَوْلِيَٓاءَ مِنْ دُونِ الْمُؤْمِن۪ينَۜ اَتُر۪يدُونَ اَنْ تَجْعَلُوا لِلّٰهِ عَلَيْكُمْ سُلْطَانًا مُب۪ينًا ۝ 
    """, russian: """
    Эй (ҳақиқий) иймон эгалари! Мўминларни қўйиб, кофирларни валий (дўст, сирдош ва сардор) тутманглар! (Бу ишни қилиб) Аллоҳ ҳузурида ўз зарарингизга (ўшалардан эканингизни кўрсатадиган) очиқ ҳужжат беришни хоҳлайсизларми? (4/Нисо,  144).

    """),
    DailyArabicRussianModel(arabic: """
قُلْ اِنَّن۪ي هَدٰين۪ي رَبّٓي اِلٰى صِرَاطٍ مُسْتَق۪يمٍۚ د۪ينًا قِيَمًا مِلَّةَ اِبْرٰه۪يمَ حَن۪يفًاۚ وَمَا كَانَ مِنَ الْمُشْرِك۪ينَ   ۝   قُلْ اِنَّ صَلَات۪ي وَنُسُك۪ي وَمَحْيَايَ وَمَمَات۪ي لِلّٰهِ رَبِّ الْعَالَم۪ينَۙ   ۝   لَا شَر۪يكَ لَهُۚ وَبِذٰلِكَ اُمِرْتُ وَاَنَا۬ اَوَّلُ الْمُسْلِم۪ينَ ۝     
    """, russian: """
    Айтингки: "Албатта, Мен Раббим тўғри йўлга - ҳақтўғри бир дин бўлмиш Иброҳимнинг ҳаниф (тавҳид)  динига бошлаган кишидирман. У мушриклардан эмас эди". Айтингки: "Менинг намозим, ибодатларим, ҳаётим ва мамотим  бутун оламларнинг Рабби бўлган Аллоҳ учундир. Унинг ҳеч бир шериги йўқдир. Менга буюрилган нарса шудир. Мен (бу умматда) мусулмонларнинг аввалидирман"  (6/Аном, 161-163).
    """),
    DailyArabicRussianModel(arabic: """
    قَالَ رَبِّ اغْفِرْ ل۪ي وَلِاَخ۪ي وَاَدْخِلْنَا ف۪ي رَحْمَتِكَۘ وَاَنْتَ اَرْحَمُ الرَّاحِم۪ينَ۟ ۝ 
    """, russian: """
    (Мусо қавмининг қилмишидан ғамгин бўлиб:) "Эй Раббимиз! Мени ва акамни кечир, бизни раҳматингга дохил айла! Сен раҳмлиларнинг энг раҳмлисисан!" - деди (7/Ароф, 151).

    """),
    DailyArabicRussianModel(arabic: """
اَنْتَ وَلِيُّنَا فَاغْفِرْ لَنَا وَارْحَمْنَا وَاَنْتَ خَيْرُ الْغَافِر۪ينَ ۝     
    """, russian: """
    "Сен бизнинг валийимиз (Эгамиз, чин дўстимиз)сан, бас, бизларни кечир ва бизларга раҳм айла. Сен кечиргувчиларнинг энг яхшисисан"  (7/Ароф, 155).

    """),
    DailyArabicRussianModel(arabic: """
وَاكْتُبْ لَنَا ف۪ي هٰذِهِ الدُّنْيَا حَسَنَةً وَفِي الْاٰخِرَةِ اِنَّا هُدْنَٓا اِلَيْكَۜ ۝ 
    """, russian: """
    "Бизга бу дунёда ҳам, охиратда ҳам яхшилик насиб эт. Шубҳасиз, биз тавба қилиб, Ўзингга қайтдик"  (7/Ароф, 156).
    """),
    DailyArabicRussianModel(arabic: """
فَقَالُوا عَلَى اللّٰهِ تَوَكَّلْنَاۚ رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلْقَوْمِ الظَّالِم۪ينَۙ ۝     
    """, russian: """
    Шунда улар дедилар: "Биз фақат Аллоҳга таваккул қилдик (суяниб-таяндик). Эй Раббимиз! Золим қавм(нинг зулмига учратиш) билан бизни имтиҳон (сабаби) қилма!" (10/Юнус, 85).

    """),
    DailyArabicRussianModel(arabic: """
    رَبِّ قَدْ اٰتَيْتَن۪ي مِنَ الْمُلْكِ وَعَلَّمْتَن۪ي مِنْ تَأْو۪يلِ الْاَحَاد۪يثِۚ فَاطِرَ السَّمٰوَاتِ وَالْاَرْضِ اَنْتَ وَلِـّ۪ي فِي الدُّنْيَا وَالْاٰخِرَةِۚ تَوَفَّن۪ي مُسْلِمًا وَاَلْحِقْن۪ي بِالصَّالِح۪ينَ 
    """, russian: """
    "Эй Раббим! Муҳаққақ, Сен менга мулк (ва салтанат) бердинг ва менга тушлар табирини ўргатдинг! Эй осмонларни ва ерни яратган Зот!  Сен дунёю охиратда менинг валийим (эгам, чин дўстим)сан! Менинг жонимни мусулмон ҳолимда ол ва мени солиҳ (мўмин)лар қаторига қўшгил!" (12/Юсуф, 101).
(Ҳар бир мусулмоннинг энг буюк орзуси комил иймон билан Аллоҳга қайтиш бўлмоғи лозим. Аллоҳ таоло ҳам шуни хоҳлаётир (қаранг: Нисо сураси, 102-оят, Тағобун сураси, 16-оят).  Бу эса фақатгина тақво билан - Аллоҳнинг амрларига мос яшаш билан бўлади.)

    """),
    DailyArabicRussianModel(arabic: """
رَبَّنَٓا اِنَّكَ تَعْلَمُ مَا نُخْف۪ي وَمَا نُعْلِنُۜ وَمَا يَخْفٰى عَلَى اللّٰهِ مِنْ شَيْءٍ فِي الْاَرْضِ وَلَا فِي السَّمَٓاءِ   ۝   اَلْحَمْدُ لِلّٰهِ الَّذ۪ي وَهَبَ ل۪ي عَلَى الْكِبَرِ اِسْمٰع۪يلَ وَاِسْحٰقَۜ اِنَّ رَبّ۪ي لَسَم۪يعُ الدُّعَٓاءِ   ۝   رَبِّ اجْعَلْن۪ي مُق۪يمَ الصَّلٰوةِ وَمِنْ ذُرِّيَّت۪يۗ رَبَّنَا وَتَقَبَّلْ دُعَٓاءِ   ۝   رَبَّنَا اغْفِرْ ل۪ي وَلِوَالِدَيَّ وَلِلْمُؤْمِن۪ينَ يَوْمَ يَقُومُ الْحِسَابُ۟ ۝     
    """, russian: """
"Эй Раббимиз! Дарҳақиқат, Сен яширган нарсаларимизни ҳам, ошкор қилган нарсаларимизни ҳам билурсан. Ерда ва осмонда   ҳеч бир нарса Аллоҳга махфий қолмас". "Кексалик ҳолимга қарамай, менга Исмоилни ва Исҳоқни ато этган Аллоҳга ҳамд бўлсин! Шубҳасиз, Раббим дуони (албатта)  эшитгувчидир (қабул этгувчидир)". "Эй Раббимиз! Мени ва зурриётимдан (келадиганларни) ҳам намозни тўкис адо этгувчилардан айла!  Эй Раббимиз! Дуоимни қабул эт!" "Эй Раббимиз! Ҳисоб кўриладиган қуёмат кунида мени, ота-онамни ва бутун мўминларни мағфират қил!" (14/Иброҳим, 38-41).
    
    """),
    DailyArabicRussianModel(arabic: """
    َقُلْ رَبِّ اَدْخِلْن۪ي مُدْخَلَ صِدْقٍ وَاَخْرِجْن۪ي مُخْرَجَ صِدْقٍ وَاجْعَلْ ل۪ي مِنْ لَدُنْكَ سُلْطَانًا نَص۪يرًا ۝ 
    """, russian: """
    Айтинг: "Ё Рабби! (Ҳижрат қилиб кирадиган жойимга) мени тўғрилик (ва ризолик) билан кирит.  (Чиқадиган жойимдан ҳам) мени тўғрилик (ризолик) чиқиши билан чиқар. Менга Ўз ҳузурингдан ёрдам қилгувчи бир қувват (иқтидор) ато эт!" (17/Исро, 80).
    """),
    DailyArabicRussianModel(arabic: """
قَالَ رَبِّ اشْرَحْ ل۪ي صَدْر۪يۙ   ۝   وَيَسِّرْ ل۪ٓي اَمْر۪يۙ   ۝   وَاحْلُلْ عُقْدَةً مِنْ لِسَان۪يۙ   ۝   يَفْقَهُوا قَوْل۪يۖ ۝     
    """, russian: """
    (Мусо) деди: "Эй Раббим! Менинг кўнглимни кенг қил. Менинг ишимни осон қил. Тилимдан тугунни еч, токи сўзимни яхши тушунсинлар (20/Тоҳо, 25-28).

    """),
    DailyArabicRussianModel(arabic: """
    رَبِّ فَلَا تَجْعَلْن۪ي فِي الْقَوْمِ الظَّالِم۪ينَ ۝ 
    """, russian: """
    "Эй Раббим! Мени у золимлар қавми ичида қолдирма!"  (23/Муминун, 94).
    """),
    DailyArabicRussianModel(arabic: """
قَالُوا رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَٓالّ۪ينَ   ۝   رَبَّنَٓا اَخْرِجْنَا مِنْهَا فَاِنْ عُدْنَا فَاِنَّا ظَالِمُونَ ۝     
    """, russian: """
    Айтинг: "Эй Раббим! Шайтонларнинг васвасаларидан (талқинларидан) Сендан паноҳ тилайман! Эй Раббим! Уларнинг менинг олдимда ҳозир бўлишларидан Сендан паноҳ тилайман!" (23/Муминун, 97-98).

    """),
    DailyArabicRussianModel(arabic: """
    اِنَّهُ كَانَ فَر۪يقٌ مِنْ عِبَاد۪ي يَقُولُونَ رَبَّنَٓا اٰمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَاَنْتَ خَيْرُ الرَّاحِم۪ينَۚ ۝ 
    """, russian: """
    Менинг бандаларимдан бир тоифа:  "Эй Раббимиз! Биз иймон келтирдик, бизни мағфират қил ва бизга раҳм қил, Сен раҳм қилгувчиларнинг энг яхшисисан!"- дейдилар. (23/Муминун, 109).

    """),
    DailyArabicRussianModel(arabic: """
وَقُلْ رَبِّ اغْفِرْ وَارْحَمْ وَاَنْتَ خَيْرُ الرَّاحِم۪ينَ ۝     
    """, russian: """
Айтинг: "Эй Раббим! Мағфират қил, раҳм қил! Сен раҳм қилгувчиларнинг энг яхшишисан!" (23/Муминун, 118).
    
    """),
    DailyArabicRussianModel(arabic: """
    وَعِبَادُ الرَّحْمٰنِ الَّذ۪ينَ يَمْشُونَ عَلَى الْاَرْضِ هَوْنًا وَاِذَا خَاطَبَهُمُ الْجَاهِلُونَ قَالُوا سَلَامًا   ۝   وَالَّذ۪ينَ يَب۪يتُونَ لِرَبِّهِمْ سُجَّدًا وَقِيَامًا  ۝ 
    """, russian: """
    Раҳмоннинг  (хос) бандалари ул кишилардики, ер юзида тавозу билан (енгил) юрурлар  ва жоҳиллар уларга сўз қотганда (талашмасдан): "Саломат бўлинг!" де(б ўту)рлар. Уларки, кечаларини Раббиларига сажда қилган ҳолда  ва қиёмда турган ҳолда (бедор) ўтказурлар. (25/Фурқон,  63-64).

    """),
    DailyArabicRussianModel(arabic: """
وَالَّذ۪ينَ يَقُولُونَ رَبَّنَا هَبْ لَنَا مِنْ اَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ اَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّق۪ينَ اِمَامًا   ۝   اُو۬لٰٓئِكَ يُجْزَوْنَ الْغُرْفَةَ بِمَا صَبَرُوا وَيُلَقَّوْنَ ف۪يهَا تَحِيَّةً وَسَلَامًاۙ   ۝   خَالِد۪ينَ ف۪يهَاۜ حَسُنَتْ مُسْتَقَرًّا وَمُقَامًا   ۝   قُلْ مَا يَعْبَؤُ۬ا بِكُمْ رَبّ۪ي لَوْلَا دُعَٓاؤُ۬كُمْۚ فَقَدْ كَذَّبْتُمْ فَسَوْفَ يَكُونُ لِزَامًا   ۝     
    """, russian: """
Уларки: Эй Раббимиз! Бизга жуфтларимиздан ва зурриётларимиздан кўзлар(имизнинг) нури (бўладиган яхши авлодлар) эҳсон айла ва бизни  муттақийларга (ёмонликдан сақланувчи зорларга) пешво айлагил!" дерлар. Ана ўшалар (саналган ҳислатларга эга бўлган ҳолда Раҳмон бўлмиш Аллоҳга бандалик вазифасини бажарувчилар) сабрлари сабабли жаннатнинг энг юксак мавқе(лар)и билан мукофотланурлар ва у ерда табрик (омонлик тилаклари) ва салом билан қарши олинурлар. У ерда абадий қолурлар. (У) қандай гўзал қароргоҳ  ва қандай гўзал мақомдир! (Эй Расулим!) Айтинг: "(Эй барча инсонлар!) Дуо (ва ибодат)ларингиз бўлмаса, Раббим сизларга не деб қиймат-этибор берсин!  (Эй кофирлар!) Сизлар эса (Аллоҳ  ва Унинг Расули билдирган нарсаларни) ёлғонга чиқардингизлар. Бас, шу сабабли (бу гуноҳ ва унинг жазоси) бўйнингизга ўралур (ёқангиздан олур)!" (25/Фурқон,  74-77).
    
    """),
    DailyArabicRussianModel(arabic: """
    رَبِّ هَبْ ل۪ي حُكْمًا وَاَلْحِقْن۪ي بِالصَّالِح۪ينَۙ   ۝   وَاجْعَلْ ل۪ي لِسَانَ صِدْقٍ فِي الْاٰخِر۪ينَۙ   ۝   وَاجْعَلْن۪ي مِنْ وَرَثَةِ جَنَّةِ النَّع۪يمِۙ   ۝ 
    """, russian: """
    Эй Раббим! Менга ҳикмат (ва комиллик) ато қил ва мени солиҳлар (зумраси)га қўш! Менга (ўзимдан) кейин келадиган (уммат)лар орасида яхшилик  билан ёд этмоқни насиб айла! Мени Наим жаннатининг ворисларидан қил!  (26/шуаро, 83-85).

    """),
    DailyArabicRussianModel(arabic: """
    وَلَا تُخْزِن۪ي يَوْمَ يُبْعَثُونَۙ   ۝   يَوْمَ لَا يَنْفَعُ مَالٌ وَلَا بَنُونَۙ   ۝   اِلَّا مَنْ اَتَى اللّٰهَ بِقَلْبٍ سَل۪يمٍۜ   ۝ 
    """, russian: """
    (Инсонлар) қайта  тирил(иб қабрлардан турғизил)адиган кунда  мени шарманда қилма! У кун на мол-дунё фойда берур ва на ўғиллар!  Фақат Аллоҳга қалби салим билан (комил иймон, соф дил билан) келганлар фойда кўрур!" (26/Шуаро, 87-89).
    """),
    DailyArabicRussianModel(arabic: """
    رَبِّ هَبْ ل۪ي مِنَ الصَّالِح۪ينَ ۝ 
    """, russian: """
    "Эй Раббим! Менга солиҳлардан (бўлган фарзанд) эҳсон айла!"  (37/Соффат, 100).
    """),
    DailyArabicRussianModel(arabic: """
    رَبِّ اغْفِرْ ل۪ي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِن۪ينَ وَالْمُؤْمِنَاتِۜ وَلَا تَزِدِ الظَّالِم۪ينَ اِلَّا تَبَارًا ۝ 
    """, russian: """
    "Эй Раббим! Мени, ота-онамни ва мўмин ҳолида менинг уйимга (масжидга ёки кемамга) кирган кишиларни ҳамда (то қиёматгача келадиган  барча) мўмин ва мўминаларни мағфират қил! Золимларга эса ҳалокатдан бошқа нарсани зиёда қилма!"  (71/Нуҳ,  28).
    """),
    DailyArabicRussianModel(arabic: """
    قُلْ اَعُوذُ بِرَبِّ الْفَلَقِۙ   ۝   مِنْ شَرِّ مَا خَلَقَۙ  ۝   وَمِنْ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ   ۝   وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِۙ   ۝   وَمِنْ شَرِّ حَاسِدٍ اِذَا حَسَدَ   ۝ 
    """, russian: """
    Бисмиллаҳир-Роҳманир-Роҳийм.
(Эй Расулим!) Айтингки: "Мен (отаётган) тонг Раббисидан, Ўзи яратган нарсаларнинг ёмонлигидан, қоронғу чўккан вақтдаги кечанинг (қарида қилинган ишлар) ёмонлигидан, тугунларга дам солувчи (сеҳр-жоду қилувчи)ларнинг ёмонлигидан, ҳасад қил(а бошла)ганида ҳасадчининг ёмонлигидан Ўзига сиғиниб паноҳ тилайман!"   (113/ал-Фалақ, 1-5).

    """),
    DailyArabicRussianModel(arabic: """
قُلْ اَعُوذُ بِرَبِّ النَّاسِۙ   ۝   مَلِكِ النَّاسِۙ  ۝   اِلٰهِ النَّاسِۙ   ۝   مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِۙ   ۝   اَلَّذ۪ي يُوَسْوِسُ ف۪ي صُدُورِ النَّاسِۙ   ۝   مِنَ الْجِنَّةِ وَالنَّاسِ   ۝     
    """, russian: """
Бисмиллаҳир-Роҳманир-Роҳийм.
(Эй Расулим!) Айтингки: "Мен инсонлар Раббисидан, инсонлар Малики (подшоҳлар подшоси ва Эгаси)дан, инсонлар Илоҳи (бўлмиш Аллоҳ)дан, (ўзи) жин (шайтон)лардан  ва инсонлардан бўлиб, инсонларнинг кўнглига васваса соладиган (гуноҳга ташвиш этадиган, ибодатлардан чалғитадиган, Аллоҳдан паноҳ тилаганда ортга чекинадиган) яширин васваса қилувчининг ёмонлигидан Ўзига сиғиниб паноҳ тилайман!" (114/ан-Нос, 1-6).
    
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ إِنّ۪ى أَعُوذُ بِكَ مِنَ الشِّقَاقِ وَالنِّفَاقِ وَسُوءِ الْأَخْلَاقِ ۝     
    """, russian: """
    Ҳадиси шарифлар 

Аллоҳим! Ҳақдан айрилмоқдан, нифоқдан - мунофиқликдан (икки юзламаликдан) ва ёмон ахлоқдан Ўзингдан паноҳ тилайман! 

    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْعَجْزِ، وَالْكَسَلِ، وَالْجُبْنِ، وَالْبُخْلِ، وَالْهَرَمِ، وَعَذَابِ الْقَبْرِ   ۝   اَللّٰهُمَّ اٰتِ نَفْسِي تَقْوَاهَا، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلَاهَا  ۝   اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ   ۝   وَمِنْ قَلْبٍ لَا يَخْشَعُ   ۝   وَمِنْ نَفْسٍ لَا تَشْبَعُ   ۝   وَمِنْ دُعَاءٍ لَا يُسْمَعُ ۝ 
    """, russian: """
    Аллоҳим!  Фойдасиз илмдан, (Сендан) қўрқмайдиган қалбдан, тўймас нафсдан, қабул бўлмайдиган дуодан Ўзингдан паноҳ тилайман!

    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ اغْفِرْ لِي ذَنْبِي   ۝   وَوَسِّعْ لِي فِي دَارِي   ۝   وَبَارِكْ لِي فِيمَا رَزَقْتَنِي ۝     
    """, russian: """
Аллоҳим!  Гуноҳимни мағфират қил, уйимда менга кенглик - мўллик бер, Ўзинг ризқ қилиб берган нарсани менга баракотли қил!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ أَلِّفْ بَيْنَ قُلُوبِنَا   ۝   وَأَصْلِحْ ذَاتَ بَيْنِنَا   ۝   وَاهْدِنَا سُبُلَ السَّلَامِ   ۝   وَنَجِّنَا مِنَ الظُّلُمَاتِ إِلَى النُّورِ    ۝   وَجَنِّبْنَا الْفَوَاحِشَ مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ   ۝   وَبَارِكْ لَنَا فِي أَسْمَاعِنَا وَأَبْصَارِنَا وَقُلُوبِنَا وَأَزْوَاجِنَا وَذُرِّيَّاتِنَا   ۝   وَتُبْ عَلَيْنَا   ۝   إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ   ۝   وَاجْعَلْنَا شَاكِرِينَ لِنِعْمَتِكَ   ۝   مُثْنِينَ بِهَا قَابِلِيهَا  ۝   وَأَتِمَّهَا عَلَيْنَا ۝ 
    """, russian: """
    Аллоҳим!  Қалбларимиз ўртасида улфат - дўстлик пайдо қил (бирлаштир), орамиздаги келишмовчиликларни ислоҳ эт, бизни саломат - омонлиқ йўлларига бошла, бизни зулматдан - қоронғуликдан қутқариб,  нурга - ёруғликка етказ! Бизни ошкор ва яширин ёмонлик-бузуқликлардан йироқ қил!  Қулоқларимизни, кўзларимизни,   қалбларимизни, жуфти ҳалолларимизни, зурриётларимиз - фарзандларимизни биз учун баракотли - муборак (ва хайрли) қил! Тавбаларимизни қабул эт, албатта, Сен тавбаларни қабул этгувчи, бениҳоят раҳмли Зотсан! Бизни нематларингга шукр қилгувчи, уларни қабул этиб (қадрлаб), Ўзингга (ҳамду) сано айтувчи бандаларингдан қил! Уларни (охиратда) бизга макаммал қилиб бер! 
    """),
    DailyArabicRussianModel(arabic: """
    لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ   ۝   أَعَزَّ جُنْدَهُ وَنَصَرَ عَبْدَهُ وَغَلَبَ الْأَحْزَابَ وَحْدَهُ   ۝   فَلَا شَيْءَ بَعْدَهُ ۝ 
    """, russian: """
    Бир Аллоҳдан бошқа илоҳ йўқ. (У) лашкарини азиз - ғолиб қилган, бандасига нусрат берган, якка Ўзи гуруҳлар устидан ғолиб бўлган Зотдир! Ундан бошқа ҳеч нарса йўқдир!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ لَكَ أَسْلَمْتُ   ۝   وَبِكَ اٰمَنْتُ   ۝   وَعَلَيْكَ تَوَكَّلْتُ   ۝    وَإِلَيْكَ أَنَبْتُ   ۝   وَبِكَ خَاصَمْتُ   ۝   اَللّٰهُمَّ اِنِّى أَعُوذُ بِعِزَّتِكَ   ۝   لَا إِلٰهَ إِلَّا أَنْتَ أَنْ تُضِلَّنِي   ۝   أَنْتَ الْحَيُّ الَّذِي لَا يَمُوتُ   ۝   وَالْجِنُّ وَالْإِنْسُ يَمُوتُونَ ۝
    """, russian: """
    Аллоҳим!  (Фақат) Сенга таслим бўлдим, Сенга иймон келтирдим, Сенга  таваккул қилдим, Сенга юзландим ва фақат Сен(инг ёрдаминг) билан душманга қарши мужодала қилдим! Аллоҳим! Иззатингга сиғинаман, Сендан бошқа илоҳ йўқ, мени тўғри йўлдан оздирма! Жинлар ва инсонлар ўлурлар, ўлмайдиган (абадий) тирик Зот фақат Сенсан! 

    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ أَحْسَنْتَ خَلْقِي فَأَحْسِنْ خُلُقِي ۝ 
    """, russian: """
    Аллоҳим! Хилқатимни гўзал қилдинг, хулқимни ҳам гўзал қил!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ  إِنَّكَ عَفُوٌّ كَرِيمٌ  ۝  تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي ۝ 
    """, russian: """
    Аллоҳим! Албатта, Сен авф  этгувчисан, авф этишни севарсан, бас, мени авф эт! 

    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللّٰهُ الَّذِي لَا  إِلٰهَ  إِلَّا  أَنْتَ   ۝    اَلْأَحَدُ  الصَّمَدُ   الَّذِي   لَمْ  يَلِدْ وَلَمْ يُولَدْ   ۝   وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ ۝
    """, russian: """
    Аллоҳим! Сен Ўзидан ўзга илоҳ бўлмаган Аллоҳсан, бунга гувоҳлик беришим сабабли Сендан тилайман! Сен туғмаган (фарзанд тутмаган) ва туғилмаган (ота-она, ўғил-қиз тутишдан пок ва муназзаҳ), тенги - ўхшаш ва муқобили бўлмаган Аҳад ва Самадсан - якка-ягона ва ҳеч нарсага ҳожати бўлмаган азалий ва абадий Зотсан!
    """),
    DailyArabicRussianModel(arabic: """
لَا إِلٰهَ إِلَّا اللّٰهُ وَحْدَهُ لَا شَرِيكَ لَهُ   ۝   لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ   ۝   وَهُوَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ  ۝   لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ    
لَا إِلٰهَ إِلَّا اللّٰهُ   ۝   وَلَا نَعْبُدُ إِلَّا إِيَّاهُ   ۝   لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ   ۝   لَا إِلٰهَ إِلَّا اللّٰهُ مُخْلِصِينَ لَهُ الدِّينَ   ۝  وَلَوْ كَرِهَ الْكَافِرُونَ ۝ 
    
    """, russian: """
Аллоҳдан бошқа илоҳ йўқ, у якка-ягона, шериги йўқ, мулк - ҳукмронлик Уникидир, ҳамд Унга   хосдир. У ҳамма нарсага қодирдур. Бутун куч ва қувват Аллоҳга тегишлидир. Аллоҳдан бошқа илоҳ йўқ. Биз фақат Унгагина ибодат қилурмиз. Немаф Уникидир, фазлу карам Уникидир, гўзал (ҳамду) сано Унга хосдир. Аллоҳдан бошқа илоҳ йўқ, кофирлар ёқтирмасада, (мўминлар) динни Унга холис қил(иб сидқидилдан саю ҳаракат қил)урлар (ва иймонларига ҳеч нарсани аралаштирмаслар)    
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَوَسْوَسَةِ الصَّدْرِ وَشَتَاتِ الْأَمْرِ  ۝   اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا يَجِيءُ بِهِ الرِّيحُ ۝ 
    """, russian: """
    Аллоҳим! Қабр азобидан, кўнгил (нафс) васвасасидан ва ишларнинг парокандалигидан Ўзингдан паноҳ тилайман! Аллоҳим! Шамол келтирадиган офат шарридан Ўзингдан паноҳ тилайман! 

    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي ۝
    """, russian: """
Аллоҳим! Оёқ остимдан бир балога учрашдан Сенинг азаматинг - улуғлигингдан паноҳ тилайман!    
    """),
  ],

  // Friday
  [
    DailyArabicRussianModel(arabic: """
    بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِيمِ ۝ 
اَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَم۪ينَۙ ۝ 
مَالِكِ يَوْمِ الدّ۪ينِۜ ۝ 
اِيَّاكَ نَعْبُدُ وَاِيَّاكَ نَسْتَع۪ينُۜ ۝ 
اِهْدِنَا الصِّرَاطَ الْمُسْتَق۪يمَۙ ۝ 
صِرَاطَ الَّذ۪ينَ اَنْعَمْتَ عَلَيْهِمْۙ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّٓالّ۪ينَ ۝ 
    """, russian: """
Раҳмон ва Раҳийм (бехад меҳрибон ва бениҳоят раҳмли) Аллоҳ номи билан (бошлайман).
Ҳамд (мақтов ва мақталишнинг барча тури) оламларнинг (ягона) Рабби бўлмиш Аллоҳгадир.  (У) Раҳмондир (дунёда бутун махлуқотига кўп марҳамат қилгувчидур),  Раҳиймдир (охиратда фақат мўминларга раҳм қилиб, мағфират этгувчидир).  Дин кунининг (охиратда ҳисоб ва жавоб - жази ва мукофот кўриш кунининг) молики - ҳукмронидир. ( Эй Раббимиз!)  Ёлғиз сенга (ибодат ва итоат ила) бандалик қилгаймиз ва ( ҳар ҳол ва эҳтиёжларимизда) фақат Сендан мадад кутиб ёрдам тилагаймиз. Бизни тўғри йўлга (Исломга) бошла ( Ислом билан яшат). Ўзинг (лутфингдан) немат берган (яхши) кишиларнинг йўлига (бошла); (амрларингга осий бўлиб)  ғазабингга учраганларнинг ва адашганларнинг (йўлига) эмас. ( Омин...)  (1/Фотиха, 1-7)
    
    """),
    DailyArabicRussianModel(arabic: """
اَلْحَمْدُ لِلّٰهِ الَّذ۪ي خَلَقَ السَّمٰوَاتِ وَالْاَرْضَ وَجَعَلَ الظُّلُمَاتِ وَالنُّورَۜ ثُمَّ الَّذ۪ينَ كَفَرُوا بِرَبِّهِمْ يَعْدِلُونَ  ۝  هُوَ الَّذ۪ي خَلَقَكُمْ مِنْ ط۪ينٍ ثُمَّ قَضٰٓى اَجَلًاۜ وَاَجَلٌ مُسَمًّى عِنْدَهُ ثُمَّ اَنْتُمْ تَمْتَرُونَ  ۝  وَهُوَ اللّٰهُ فِي السَّمٰوَاتِ وَفِي الْاَرْضِۜ يَعْلَمُ سِرَّكُمْ وَجَهْرَكُمْ وَيَعْلَمُ مَا تَكْسِبُونَ  ۝     
    """, russian: """
    Ҳамд бўлсин, осмонларни ва ерни яратган ҳамда қоронғиликларни ва ёруғликни бор қилган Аллоҳга. (Шундоқ бўла туриб) кейин яна куфр келтирганлар  (бошқаларни) ўз Раббиларига тенг тутарлар. У сизларни (олдин) лойдан яратган, кейин (эса) бир ажал (муддат) белгилаб кўйган Зотдир. Унинг хузурида яна ажали мусаммо (қиёмат билан боғлиқ муддат) бордир. (Бу ҳақиқатдан) кейин ҳам сизлар ҳали (қайта тирилишдан) шубҳа қилурсизлар! Осмонларда ҳам, ерда ҳам ҳақиқий илоҳ ( ва мабуд) фақат Аллоҳдир. (У) сир тутган нарсаларингизни ҳам, ошкор қилган нарсаларингизни ҳам билур. (Яхшиликми, ёмонликми) қилган касб-корларингизни ҳам билур (6/Анъом,1-3).

    """),
    DailyArabicRussianModel(arabic: """
    وَنَزَعْنَا مَا ف۪ي صُدُورِهِمْ مِنْ غِلٍّ تَجْر۪ي مِنْ تَحْتِهِمُ الْاَنْهَارُۚ وَقَالُوا الْحَمْدُ لِلّٰهِ الَّذ۪ي هَدٰينَا لِهٰذَا وَمَا كُنَّا لِنَهْتَدِيَ لَوْلَٓا اَنْ هَدٰينَا اللّٰهُۚ لَقَدْ جَٓاءَتْ رُسُلُ رَبِّنَا بِالْحَقّۜ وَنُودُٓوا اَنْ تِلْكُمُ الْجَنَّةُ اُو۫رِثْتُمُوهَا بِمَا كُنْتُمْ تَعْمَلُونَ ۝ 
    """, russian: """
    Уларнинг кўксидан гина ва ҳасад (ғиллу ғаш) жинсидан неки бор бўлса, суғириб ташлармиз.  (Кўшкларининг)  остидан анхорлар оқиб турар экан: " Бизни  бунга эриштирган Аллоҳга ҳамд бўлсин!  Агар Аллоҳ бизни тўғри йўлга бошламаса эди, биз ўзимизча (бунга) эриша олмас эдик. Қасамки, Раббимизнинг пайғамбарлари жақиқатни келтирганлар",  дерлар. (Уларга:)   "Мана бу, (дунёда) қилган (яхши) амалларингиз туфайли сизлар ворис қилинган жаннатдир!" деб нидо қилинур   (7/Ароф, 43).

    """),
    DailyArabicRussianModel(arabic: """
دَعْوٰيهُمْ ف۪يهَا سُبْحَانَكَ اللّٰهُمَّ وَتَحِيَّتُهُمْ ف۪يهَا سَلَامٌۚ وَاٰخِرُ دَعْوٰيهُمْ اَنِ الْحَمْدُ لِلّٰهِ رَبِّ الْعَالَم۪ينَ۟ ۝     
    """, russian: """
Уларнинг у ердаги (жаннатларидаги) дуолари "Субҳанакаллоҳумма" 
("Аллоҳим! Сени, ҳар қандай нуқсонлардан пок ва муназзах деб олқишлаб, ёд этурмиз!") дейишдир. У ерда (бир-бирларига яхшилик ва омонлик) тилаклари "Салом!"дир ва дуоларининг охири эса: "Алаҳамдулиллаҳи Раббил-оламийн!" ("Бутун оламлар Рабби бўлган Аллоҳга ҳамд бўлсин!") дейишдир  
(10/Юнус, 10).
    
    """),
    DailyArabicRussianModel(arabic: """
    وَيُسَبِّحُ الرَّعْدُ بِحَمْدِه۪ وَالْمَلٰٓئِكَةُ مِنْ خ۪يفَتِه۪ۚ وَيُرْسِلُ الصَّوَاعِقَ فَيُص۪يبُ بِهَا مَنْ يَشَٓاءُ وَهُمْ يُجَادِلُونَ فِي اللّٰهِۚ وَهُوَ شَد۪يدُ الْمِحَالِۜ ۝ 
    """, russian: """
    (Осмондаги) момақалдироқ Унга ҳамд ила тасбиҳ айтур ва фаришталар ҳам ундан қўрққанларидан (тасбиҳ айтурлар). У (ишонмаган)лар Аллоҳ хақида тортишиб турганларида У чақмоқларни юборур ва улар билан хоҳлаганини урар. У жавоб зарбаси ғоят қаттиқ Зотдир
  (13/Рад, 13).

    """),
    DailyArabicRussianModel(arabic: """
    فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُنْ مِنَ السَّاجِد۪ينَۙ  وَاعْبُدْ رَبَّكَ حَتّٰى يَأْتِيَكَ الْيَق۪ينُ ۝ 
    """, russian: """
Алҳол, Раббингизга ҳамд ила тасбиҳ айтинг ("Субҳаноллоҳи ва биҳамдих" денг) ва сажда қилгувчилардан бўлинг. Сизга (келиши) анниқ бўлган нарса (ўлим) келгунича Раббингизга ибодат қилинг (ва бутун амрларига итоат этинг!) (15/Хижр, 98-99).    
    """),
    DailyArabicRussianModel(arabic: """
    تُسَبِّحُ لَهُ السَّمٰوَاتُ السَّبْعُ وَالْاَرْضُ وَمَنْ ف۪يهِنَّ وَاِنْ مِنْ شَيْءٍ اِلَّا يُسَبِّحُ بِحَمْدِه۪ وَلٰكِنْ لَا تَفْقَهُونَ تَسْب۪يحَهُمْۜ اِنَّهُ كَانَ حَل۪يمًا غَفُورًا ۝ 
    """, russian: """
    Етти (қават) осмон, ер ва улардаги бир жону жонзотлар Унга тасбиҳ айтур. Унга ҳамд ила тасбих айтмайдиган ҳеч бир нарса йўқдир.  Лекин сизлар уларнинг тасбиҳларини англамассизлар. Дарҳақиқат, У ҳалиймдир, (жазога шошилмас ва) бениҳоят мағфиратлидир  (12/Исро, 44).

    """),
    DailyArabicRussianModel(arabic: """
يَوْمَ يَدْعُوكُمْ فَتَسْتَج۪يبُونَ بِحَمْدِه۪ وَتَظُنُّونَ اِنْ لَبِثْتُمْ اِلَّا قَل۪يلًا۟ ۝     
    """, russian: """
    У кун (Аллоҳ) сизларни чақирур, сизлар эса дарҳол ҳамд айтган ҳолда Унинг чақириғига (шошиб) эргашурсизлар ва (қиёматнинг дахшати сабабли, қабрларингизда) фақат озгина (вақт) қолганингизни гумон қилурсизлар   (17/Исро,  52).

    """),
    DailyArabicRussianModel(arabic: """
    وَقُلِ الْحَمْدُ لِلّٰهِ الَّذ۪ي لَمْ يَتَّخِذْ وَلَدًا وَلَمْ يَكُنْ لَهُ شَر۪يكٌ فِي الْمُلْكِ وَلَمْ يَكُنْ لَهُ وَلِيٌّ مِنَ الذُّلِّ وَكَبِّرْهُ تَكْب۪يرًا ۝ 
    """, russian: """
    "Ҳеч бир фарзанд тутмаган, мулкида (ҳукмронлигида) шериги бўлмаган, ожизлиги йўқлиги сабабли ҳам бирор ёрдамчига эхтиёжи бўлмаган Аллоҳга ҳамд бўлсин!"- денг ва Унга такбир келтиринг (буюклигини элон қилинг)!  (17/ Исро,  111).

    """),
    DailyArabicRussianModel(arabic: """
    اَلْحَمْدُ لِلّٰهِ الَّذ۪ٓي اَنْزَلَ عَلٰى عَبْدِهِ الْكِتَابَ وَلَمْ يَجْعَلْ لَهُ عِوَجًا ۔  قَيِّمًا لِيُنْذِرَ بَأْسًا شَد۪يدًا مِنْ لَدُنْهُ وَيُبَشِّرَ الْمُؤْمِن۪ينَ الَّذ۪ينَ يَعْمَلُونَ الصَّالِحَاتِ اَنَّ لَهُمْ اَجْرًا حَسَنًاۙ  مَاكِث۪ينَ ف۪يهِ اَبَدًاۙ ۝ 
    """, russian: """
Аллоҳга ҳамд бўлсинки, бандаси (Муҳаммад алайҳиссаломга) орасида ҳеч бир эгрилик пайдо қилмасдан ва тўғри бир дастур этиб (бу) Китобни, ҳам Ўзи тарафидан келадиган қаттиқ азобдан (кофирларни ва гуноҳкорларни) қўрқитсин деб, ҳам солиҳ амаллар (савобли ишлар)  қиладиган мўминларга (энг) гўзал мукофот бўлган (ва) ўзлари унда абадий қоладиган жаннат ҳушхабарини берсин,  деб нозил қилди (18/Каҳф, 1-3).

    """),
    DailyArabicRussianModel(arabic: """
    فَاصْبِرْ عَلٰى مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَاۚ وَمِنْ اٰنَٓائِ الَّيْلِ فَسَبِّحْ وَاَطْرَافَ النَّهَارِ لَعَلَّكَ تَرْضٰى ۝
    """, russian: """
У ҳолда (уларнинг) айтаётган нарсаларига сабр қилинг. Қуёш чиқишидан олдин (тонгда) ва ботишидан олдин (аср вақтида) Раббингизга ҳамду ила тасбиҳ айтинг. Кечанинг (белгили) соатларида (шом ва хуфтонда) ҳамда кундузнинг атрофларида (пешинда) ҳам тасбиҳ айтинг (намоз ўқинг), токи (натижадан) рози бўлгайсиз (20/Тоҳо, 130).    
    """),
    DailyArabicRussianModel(arabic: """
    وَتَوَكَّلْ عَلٰى الْحَيِّ الَّذ۪ي لَا يَمُوتُ وَسَبِّحْ بِحَمْدِه۪ۜ وَكَفٰى بِه۪ بِذُنُوبِ عِبَادِه۪ خَب۪يرًاۚ ۝
    """, russian: """
    Асло ўлмайдиган, абадий тирик Зотга (Аллоҳга) таваккул қилинг - таяниб - суянинг, Унга ҳамду ила тасбиҳ айтинг. Бандаларининг гуноҳларидан Унинг хабардор эканлиги ўзи кифоядир 
 (25/Фурқон,  58).

    """),
    DailyArabicRussianModel(arabic: """
    وَلَقَدْ اٰتَيْنَا دَاوُ۫دَ وَسُلَيْمٰنَ عِلْمًاۚ وَقَالَا الْحَمْدُ لِلّٰهِ الَّذ۪ي فَضَّلَنَا عَلٰى كَث۪يرٍ مِنْ عِبَادِهِ الْمُؤْمِن۪ينَ ۝ 
    """, russian: """
    Қасамки,  Биз Довудга ва Сулаймонга илм бердик ва улар: "Бизни мўмин бандаларининг кўпларидан афзал-устун қилган Аллоҳга ҳамд бўлсин!" -- дедилар
(27/Намл,  15).

    """),
    DailyArabicRussianModel(arabic: """
    وَهُوَ اللّٰهُ لَٓا اِلٰهَ اِلَّا هُوَۜ لَهُ الْحَمْدُ فِي الْاُو۫لٰى وَالْاٰخِرَةِۘ وَلَهُ الْحُكْمُ وَاِلَيْهِ تُرْجَعُونَ ۝ 
    """, russian: """
    Ул Аллоҳки, Ундан бошқа ҳеч бир илоҳ йўқдир. Аввалу охирда (дунёю охиратда) ҳамд унга хосдир. Ҳукм ёлғиз Уникидир. Ва сизлар фақат Унгагина қайтарилгайсизлар  
(28/Қасас,  70).


    """),
    DailyArabicRussianModel(arabic: """
وَلَئِنْ سَاَلْتَهُمْ مَنْ نَزَّلَ مِنَ السَّمَٓاءِ مَٓاءً فَاَحْيَا بِهِ الْاَرْضَ مِنْ بَعْدِ مَوْتِهَا لَيَقُولُنَّ اللّٰهُۜ قُلِ الْحَمْدُ لِلّٰهِۜ بَلْ اَكْثَرُهُمْ لَا يَعْقِلُونَ۟ ۝     
    """, russian: """
Агар улардан: " Осмондан сув тушириб, у орқали ўлганидан кейин ерни ким тирилтирди?" -  деб сўрасангиз, улар, албатта: "Аллоҳ" , дерлар. Сиз: " Бутун ҳамд Аллоҳгадир!"- денг. Фақат уларнинг кўпи ақлни ишлатмаслар (29/Анкабут,  63).
    
    """),
    DailyArabicRussianModel(arabic: """
    وَلَهُ الْحَمْدُ فِي السَّمٰوَاتِ وَالْاَرْضِ وَعَشِيًّا وَح۪ينَ تُظْهِرُونَ ۝ 
    """, russian: """
    Осмонларда ва ерда ҳамд Унга хосдир. Яна (сизлар) кундузнинг охирида (асрда) ва пешин вақтига кирганингизда ҳам (намоз ўқиб, Аллоҳга тасбиҳ айтинглар) 
(30/Рум,  18).

    """),
    DailyArabicRussianModel(arabic: """
    اِنَّمَا يُؤْمِنُ بِاٰيَاتِنَا الَّذ۪ينَ اِذَا ذُكِّرُوا بِهَا خَرُّوا سُجَّدًا وَسَبَّحُوا بِحَمْدِ رَبِّهِمْ وَهُمْ لَا يَسْتَكْبِرُونَ ۝
    """, russian: """
Бизнинг оятларимизга фақат ўзларига насиҳат қилинганида мутакаббирлик қилмасдан, саждага йиқиладиган  ва Раббиларига ҳамди билан тасбиҳ айтадиган кишилар иймон келтирур (САЖДА ояти)   (32/Сажда,  15).    
    """),
    DailyArabicRussianModel(arabic: """
    اَلْحَمْدُ لِلّٰهِ الَّذ۪ي لَهُ مَا فِي السَّمٰوَاتِ وَمَا فِي الْاَرْضِ وَلَهُ الْحَمْدُ فِي الْاٰخِرَةِۜ وَهُوَ الْحَك۪يمُ الْخَب۪يرُ ۝ 
    """, russian: """
    Ҳамд осмонлардаги бор нарсалар ва ердаги бор нарсалар (тамоман) Ўзиники бўлган Аллоҳ учундир. Охиратда ҳам ҳамд фақат Унгадир. У ҳукм ва ҳикмат соҳибидир, (ҳамма нарсадан) ҳаққоний хабардордир 
(34/Саба,  1).

    """),
    DailyArabicRussianModel(arabic: """
اَلْحَمْدُ لِلّٰهِ فَاطِرِ السَّمٰوَاتِ وَالْاَرْضِ جَاعِلِ الْمَلٰٓئِكَةِ رُسُلًا اُو۬ل۪ٓي اَجْنِحَةٍ مَثْنٰى وَثُلٰثَ وَرُبَاعَۜ يَز۪يدُ فِي الْخَلْقِ مَا يَشَٓاءُۜ اِنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَد۪يرٌ ۝     
    """, russian: """
    Осмонларни ва ерни йўқдан яратган, фаришталарни иккитадан, учтадан, тўрттадан қаноти бор элчилар қилган Аллоҳга ҳамд бўлсин! У яратишда хоҳлаган нарсасини (хоҳлаган миқдорда) зиёда қилур. (Ҳар кимни алоҳидан шакл-шамоилда, гўзаллик ва хислатда яратур.) Ҳеч шубҳасиз, Аллоҳ ҳамма нарсага қодирдир  
(35=Фотир,  1)
    """),
    DailyArabicRussianModel(arabic: """
    وَقَالُوا الْحَمْدُ لِلّٰهِ الَّذ۪ٓي اَذْهَبَ عَنَّا الْحَزَنَۜ اِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌۙ ۝ 
    """, russian: """
    Айтурлар: "Биздан қайғуни кетказган Аллоҳга ҳамд бўлсин! Дарҳақиқат, Раббимиз беҳад мағфиратлидир,  шукрнинг бадалини мўл-кўл бергувчидир"
  (35/Фотир, 34).

    """),
    DailyArabicRussianModel(arabic: """
سُبْحَانَ رَبِّكَ رَبِّ الْعِزَّةِ عَمَّا يَصِفُونَۚ  ۝    وَسَلَامٌ عَلٰى الْمُرْسَل۪ينَۚ  ۝    وَالْحَمْدُ لِلّٰهِ رَبِّ الْعَالَم۪ينَ  ۝     
    """, russian: """
Иззат ва қудрат Эгаси бўлмиш Раббингиз улар тақаган сифатлардан пок ва муназзахдир! Юборилган пайғамбарларга салом бўлсин! Оламлар Рабби бўлмиш Аллоҳга ҳамд бўлсин! (37/Соффат,  180-182).
    
    """),
    DailyArabicRussianModel(arabic: """
    فَلِلّٰهِ الْحَمْدُ رَبِّ السَّمٰوَاتِ وَرَبِّ الْاَرْضِ رَبِّ الْعَالَم۪ينَ  وَلَهُ الْكِبْرِيَٓاءُ فِي السَّمٰوَاتِ وَالْاَرْضِۖ وَهُوَ الْعَز۪يزُ الْحَك۪يمُ ۝ 
    """, russian: """
    У холда, (бутун) ҳамд осмонлар Рабби, ернинг Рабби ва бутун оламлар Рабби бўлмиш Аллоҳ учундир! Осмонларда ва ерда буюклик-улуғлик фақат Унга хосдир. У мутлақ ғолибдир, ҳукм ва ҳикмат соҳибидир!
 (45/Жосия,  36-37). 

    """),
    DailyArabicRussianModel(arabic: """
فَاصْبِرْ عَلٰى مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ الْغُرُوبِۚ   ۝  وَمِنَ الَّيْلِ فَسَبِّحْهُ وَاَدْبَارَ السُّجُودِ ۝     
    """, russian: """
(Эй Расулим!) Уларнинг сўзларига сабр қилинг.  Қуёш чиқишидан олдин ва ботишидан олдин(ги вақтларда) Раббингизга ҳамд ила тасбиҳ айтинг (намоз ўқинг). Яна кечанинг бир қисмида(ги намозларда) ва саждаларда (намозлар) ортидан Унга тасбих айтинг (50/Қоф,  39-40).
 Изоҳ. Намозлар ортидан тасбиҳ айтмоқ Субҳаналлоҳ, Алаҳамдулиллоҳ, Аллоҳу акбар демоқдир ("Файзул-Фурқон").
    
    """),
    DailyArabicRussianModel(arabic: """
    وَاصْبِرْ لِحُكْمِ رَبِّكَ فَاِنَّكَ بِاَعْيُنِنَا وَسَبِّحْ بِحَمْدِ رَبِّكَ ح۪ينَ تَقُومُۙ  ۝  وَمِنَ الَّيْلِ فَسَبِّحْهُ وَاِدْبَارَ النُّجُومِ ۝ 
    """, russian: """
    Ва сиз Раббингиз ҳукмига сабр қилинг. Чунки сиз Бизнинг кузатувимиз остида (панохимизда)сиз. (Ҳар) турган вақтингизда Раббингизга ҳамд ила тасбиҳ айтинг.  Яна кечанингбир қисмида ва юлдузлар ғойиб бўлиб кетганидан  кейин (тонг-саҳар вақти) Унга тасбиҳ айтинг (52/Тур,   48-49).
Яни: "Бир жамоат орасидан турганда, уоки уйқудан турганда,  ёхуд намозга қиём қилганда, ёки Аллоҳ учун бўладиган бошқа хайрли ишларда ҳамд ва тасбиҳ айтинг". Чунки ҳазрати Росуруллоҳ соллаллоҳу  алайҳи ва саллам бир  мажлисдан турганларида: "Субҳанакаллоҳумма ва биҳамдик. Ашҳаду ан-ла илаҳа илла анта, астағфирука ва атубу илайк", - дер эдилар  ("Файзул-Фурқон").
    """),
    DailyArabicRussianModel(arabic: """
يُسَبِّحُ لِلّٰهِ مَا فِى السَّمٰوَاتِ وَمَا فِى الْأَرْضِۚ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُۘ وَهُوَ عَلٰى كُلِّ شَىْءٍ قَد۪يرٌ ۝     
    """, russian: """
    Осмонлардаги бор нарсалар ва ердаги бор нарсалар(нинг ҳаммаси) Аллоҳга тасбиҳ айтур (Унинг беҳад буюк, пок ва муназзах эканини олқишлаб ёд этур). Ҳукмронлик фақат Уникидир, ҳамд фақатгина Унга хосдир. У ҳамма нарсага қодирдур (64/Тағобун,  1).

    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ لَكَ الْحَمْدُ  ۝  أَنْتَ نُورُ السَّمَاوَاتِ وَالْأَرْضِ ۝  وَلَكَ الْحَمْدُ أَنْتَ قَيَّامُ السَّمَاوَاتِ وَالْأَرْضِ ۝  وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَنْ فِيهِنَّ  ۝  أَنْتَ الْحَقُّ وَوَعْدُكَ الْحَقُّ وَقَوْلُكَ الْحَقُّ  ۝  وَلِقَاؤُكَ حَقٌّ وَالْجَنَّةُ حَقٌّ وَالنَّارُ حَقٌّ وَالسَّاعَةُ حَقٌّ  ۝  اَللّٰهُمَّ لَكَ أَسْلَمْتُ  ۝   وَبِكَ اٰمَنْتُ  ۝  وَعَلَيْكَ تَوَكَّلْتُ  ۝  وَإِلَيْكَ أَنَبْتُ   ۝  وَبِكَ خَاصَمْتُ  ۝  وَإِلَيْكَ حَاكَمْتُ  ۝  فَاغْفِرْ لِي مَا قَدَّمْتُ وَأَخَّرْتُ  ۝  وَأَسْرَرْتُ وَأَعْلَنْتُ  ۝  أَنْتَ إِلٰهِي لَا إِلٰهَ إِلَّا أَنْتَ ۝ 
    """, russian: """
    Ҳадиси Шарифлар 


Аллоҳим! Ҳамд ёлғиз Сенга хосдир. Сен осмонларнинг ва ернинг нурисан. Ҳамд ёлғиз Сенга хосдир. Сен осмонларни ва ерни тик тутиб тургувчисан. Ҳамд ёлғиз Сенга хосдир. Сен Осмонларнинг, ернинг ва уларнинг ичидаги нарсаларнинг Рабби - тарбият қилгувчисисан. Сен Ҳақсан, Сенинг ваданг ҳақдир, Сенинг сўзинг ҳақдир,  Сенинг дийдоринг ҳақдир, жаннат ҳақдир, дўзах ҳам ҳақдир. Қиёмат ҳақдир. (Пайғамбарлар ҳақдир.)* Эй Аллоҳим! Сенга таслим бўлдим. Сенга иймон келтирдим. Сенга таваккул 
қилдим - суяниб-таяндим! Сенга йўналдим. Сенинг ёрдаминг ила душманларга қарши мужодала қилдим. Ҳақимни излашда сенинг ҳукминг - ҳокимлигингга бош урдим. Олдинги қилган, кейинги қиладиган гуноҳларимни, пинҳон қилган ва ошкор қилган хатоларимни мағфират қил! Илоҳим Сенсан! Сендан бошқа илоҳ йўқ! 
    
*Изоҳ. "Пайғамбарлар ҳам ҳақдир" деган жумла " Саҳиҳи Бухорий"да мавжуд. 

    """),
    DailyArabicRussianModel(arabic: """
    اَلْحَمْدُ لِلّٰهِ حَمْدًا كَثِيرًا طَيِّـبًا مُبَارَكاً فِيهِ مُبَارَكًا عَلَيْهِ  ۝  كَمَا يُحِبُّ رَبُّنَا وَيَرْضٰى ۝
    """, russian: """
    Раббимизнинг Ўзи хохлаганидек ва рози бўлганидек, кўпдан-кўп, пок-гўзал ва муборак холда баракот келтирувчи ҳамд ила Аллоҳга ҳамд бўлсин!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي  ۝   وَعَلِّمْنِي مَا يَنْفَعُنِي  ۝   وَزِدْنِي عِلْمًا  ۝ اَلْحَمْدُ لِلّٰهِ عَلٰى كُلِّ حَالٍ ۝  وَأَعُوذُ بِاللّٰهِ مِنْ حَالِ أَهْلِ النَّارِ ۝ 
    """, russian: """
    Аллоҳим!  Ўзинг,  менга ўргатган илминг ила мени манфаатлантир. Менга фойдали илмни талим қил. Илмимни зиёда қил. Ҳар қандай холда Аллоҳга ҳамд бўлсин! Дўзах  аҳлининг холига тушишдан Аллоҳдан паноҳ тилайман!
    """),
    DailyArabicRussianModel(arabic: """
    يَا رَبِّ لَكَ الْحَمْدُ   ۝    كَمَا يَنْبَغِى لِجَلَالِ وَجْهِكَ وَلِعَظِيمِ سُلْطَانِكَ ۝ 
    """, russian: """
    Ё Раббим! Зотинг жалоли-буюклиги ва салтанатинг азамати-улуғлиги тақозо этганчалик Сенга ҳамд бўлсин.
    """),
    DailyArabicRussianModel(arabic: """
    اَلْحَمْدُ لِلّٰهِ عَدَدَ مَا خَلَقَ ۝  وَالْحَمْدُ لِلّٰهِ مِلْءَ مَا خَلَقَ  ۝  وَالْحَمْدُ لِلّٰهِ عَدَدَ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ  ۝   وَالْحَمْدُ لِلّٰهِ مِلْءَ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ  ۝  وَالْحَمْدُ لِلّٰهِ عَدَدَ مَا أَحْصٰى كِتَابُهُ  ۝  وَالْحَمْدُ لِلّٰهِ مِلْءَ مَا أَحْصٰى كِتَابُهُ  ۝  وَالْحَمْدُ لِلّٰهِ عَدَدَ كُلِّ شَيْءٍ  ۝  وَالْحَمْدُ لِلّٰهِ مِلْءَ كُلِّ شَيْءٍ  ۝  وَسُبْحَانَ اللّٰهِ مِثْلَهَا ۝ 
    """, russian: """
    Яратганларининг  саноғича Аллоҳга ҳамд бўлсин. Яратганларининг тўлиғича Аллоҳга ҳамд бўлсин. Осмондагиларнинг ва ердагиларнинг саноғича Аллоҳга ҳамд бўлсин. Осмондагиларнинг ва ердагиларнинг тўлиғича Аллоҳга ҳамд бўлсин. Китоби санаган нарсаларнинг саноғича Аллоҳга ҳамд бўлсин. Китоби санаган нарсаларнинг тўлиғича Аллоҳга ҳамд бўлсин. Хамма нарсанинг саноғича Аллоҳга ҳамд бўлсин. Ҳамма нарсанинг тўлиғича Аллоҳга ҳамд бўлсин. Яна шунинг мислича Субҳоналлоҳ дея Аллоҳга тасбиҳ бўлсин.
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ لَكَ الْحَمْدُ كُلُّهُ  ۝  وَلَكَ الْمُلْكُ كُلُّهُ  ۝  بِيَدِكَ الْخَيْرُ كُلُّهُ  ۝  إِلَيْكَ يُرْجَعُ الْأَمْرُ كُلُّهُ عَلَانِيَتُهُ وَسِرُّهُ  ۝  فَأَهْلٌ أَنْ تُحْمَدَ  ۝  إِنَّكَ عَلٰى كُلِّ شَيْءٍ قَدِيرٌ  ۝  اَللّٰهُمَّ اغْفِرْ لِي جَمِيعَ مَا مَضٰى مِنْ ذُنُوبِي  ۝  وَاعْصِمْنِي فِيمَا بَقِيَ مِنْ عُمْرِي ۝  وَارْزُقْنِي عَمَلًا زَاكِيًا تَرْضٰى بِه۪ عَنِّي ۝ 

    """, russian: """
    Аллоҳим! Ўтган бутун гуноҳларимни мағфират қил. Қолган умримда мени (ёмонликлардан ва ёмон нарсалардан) Ўзинг асра. Ўзинг рози ва хушнуд бўладиган гўзал амалларни менга насиб айла!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اجْعَلْنِي مِنَ الَّذِينَ إِذَا أَحْسَنُوا اِسْتَبْشَرُوا  ۝  وَإِذَا أَسَاءُوا اِسْتَغْفَرُو ۝ 
    """, russian: """
    Аллоҳим! Мени - қачон гўзал - яхши амал қилсам, хурсанд бўладиган, қачон ёмон иш қилсам, (Ўзингдан) мағфират тилайдиганлардан қил!
    """),
    DailyArabicRussianModel(arabic: """
    بِسْمِ اللّٰهِ تَوَكَّلْتُ عَلٰى اللّٰهِ  ۝  اَللّٰهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نَزِلَّ أَوْ نَضِلَّ  ۝  أَوْ نَظْلِمَ  أَوْ نُظْلَمَ   ۝  أَوْ نَجْهَلَ أَوْ يُجْهَلَ عَلَيْنَا ۝
    """, russian: """
    Аллоҳнинг исми билан, Аллоҳга тавакул қилдим. Эй Аллоҳим! Зиллатга -- хорлик - тубанликка тушишдан, йўлдан озишдан, зулм қилишдан, зулмга учрашдан, жоҳилликдан ва бизга нисбатан жоҳиллик қилинишидан Ўзингдан паноҳ тилаймиз! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُ اَللّٰهُ رَبِّـي  ۝  لَا أُشْرِكُ بِه۪ شَيْئاً ۝
    """, russian: """
    Аллоҳ(дан паноҳ)! Аллоҳ(дан панож)!  У менинг Раббимдир! Унга ҳеч бир нарсани шерик қилмасман!
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ صَلِّ عَلٰى مُحَمَّدٍ وَأَزْوَاجِه۪ وَذُرِّيَّـتِه۪  ۝  كَمَا صَلَّيْتَ عَلٰى اٰلِ إِبْرَاهِيمَ  ۝  وَبَارِكْ عَلٰى مُحَمَّدٍ وَأَزْوَاجِه۪ وَذُرِّيَّـتِه۪  ۝  كَمَا بَارَكْتَ عَلٰى اٰلِ إِبْرَاهِيمَ  ۝   إِنَّكَ حَمِيدٌ مَجِيدٌ ۝
    """, russian: """
    Аллоҳим! Хазрати Муҳаммадга ва ул зотнинг  жуфти ҳалолларига ва зурриётларига раҳмат айла, мисли Иброҳимнинг оилалари (аҳли)га раҳмат айлаганингдек! Хазрати Муҳаммадни ва ул зотнинг жуфти ҳалоллари ва зурриётларини муборак қил, мисли Иброҳимнинг оилалари (аҳли)ни муборак қилганингдек! Албатта, Сен ҳамдга лойиқсан, шарафи буюк зотсан.
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ بِعِلْمِكَ الْغَيْبَ  ۝   وَقُدْرَتِكَ عَلَى الْخَلْقِ  ۝  أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِي  ۝   وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِي  ۝  اَللّٰهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ   ۝    وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ  ۝   وَأَسْأَلُكَ الْقَصْدَ فِي الْفَقْرِ وَالْغِنٰى  ۝   وَأَسْأَلُكَ نَعِيمًا لَا يَنْفَدُ  ۝   وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ  ۝   وَأَسْأَلُكَ الرِّضَاءَ بَعْدَ الْقَضَاءِ  ۝    وَأَسْأَلُكَ  بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ   ۝    وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلٰى وَجْهِكَ  ۝  وَالشَّوْقَ إِلٰى لِقَائِكَ  ۝   فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ وَلَا فِتْنَةٍ مُضِلَّةٍ  ۝   اَللّٰهُمَّ زَيِّنَّا بِزِينَةِ الْإِيمَانِ  ۝   وَاجْعَلْنَا هُدَاةً   مُهْتَدِينَ ۝ 
    """, russian: """
    Аллоҳим!  сен илминг ила ғайбларни билурсан. Қудратинг ила бутун яратганларингга ҳокимсан. Мен учун яшаш хайрли бўлса, менга яшашни бардавом қил, мен учун ўлимим хайрли бўлса, мени вафот эттир! Аллоҳим! Ошкор ва пинҳон ҳамма жойда Сендан қўрқув (ҳисси)ни тилайман! Сокин-хушнуд  ва ғазабли (ҳар) холимда хақ сўзни сўзламоқ (журати ва қуввати)ни Сендан тилайман! Фақирликда ва бойликда ўрта йўлни тутишни сендан сўрайман. Тугамайдиган нематларингни Сендан сўрайман! Узилмас кўз қувончи - нури - равшанлигини Сендан сўрайман. Ҳукмингдан кейин Сенинг ризолигингни сўрайман!  Ўлимимдан кейин яхши бир хаётни Сендан сўрайман!  Шавқ билан Сенинг дийдорингга эришмоқни, жамолингга боқиш лаззатини, қийновчи фалокатларга йўлиқмасдан, йўлдан оздирувчи фитналарга тушмасдан яшаш (саодати)ни Сендан сўрайман! Эй Аллоҳим! Бизни иймон зийнати билан зийнатла, бизни тўғри йўлга эришгувчилар учун ҳидоят сабаби қил!
    """),
  ],

  // Saturday
  [
    DailyArabicRussianModel(arabic: """
    اَلصَّابِر۪ينَ وَالصَّادِق۪ينَ وَالْقَانِت۪ينَ وَالْمُنْفِق۪ينَ وَالْمُسْتَغْفِر۪ينَ بِالْاَسْحَارِ ۝
    """, russian: """
   (У тақво эгалари) сабр қилгувчилар,  (иймонларида, сўз, ният ва ишларида) садоқат кўрсатгувчилар, (Аллоҳга) итоат этган ҳолда бўйин сунгувчилар, Унинг ризоси учун  (молларини) сарф - инфоқ этгувчилар ва саҳар чоғларда мағфират тилагувчилардир (3/Оли Имрон, 17). 
    """),
    DailyArabicRussianModel(arabic: """
    وَالَّذ۪ينَ اِذَا فَعَلُوا فَاحِشَةً اَوْ ظَلَمُٓوا اَنْفُسَهُمْ ذَكَرُوا اللّٰهَ فَاسْتَغْفَرُوا لِذُنُوبِهِمْۖ وَمَنْ يَغْفِرُ الذُّنُوبَ اِلَّا اللّٰهُۖ وَلَمْ يُصِرُّوا عَلٰى مَا فَعَلُوا وَهُمْ يَعْلَمُونَ ۝
    """, russian: """
    (Яна) улар қачон бир гуноҳ иш қилиб қўйсалар ёки (гуноҳлар билан) ўз-ўзларига зулм қилсалар,  Аллоҳни эслаб, дарҳол (истиғфор айтиб) гуноҳларини мағфират қилинишини сўрарлар. Зотан, Аллоҳдан бошқа ким гуноҳларни мағфират қилур? Ва яна улар қилмишларида (гуноҳ  ва хато ишларида) билган ҳолда бардавом турмаслар (3/Оли Имрон, 135).
    """),
    DailyArabicRussianModel(arabic: """
    فَبِمَا رَحْمَةٍ مِنَ اللّٰهِ لِنْتَ لَهُمْۚ وَلَوْ كُنْتَ فَظًّا غَل۪يظَ الْقَلْبِ لَانْفَضُّوا مِنْ حَوْلِكَۖ فَاعْفُ عَنْهُمْ وَاسْتَغْفِرْ لَهُمْ وَشَاوِرْهُمْ فِي الْاَمْرِۚ فَاِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللّٰهِۜ اِنَّ اللّٰهَ يُحِبُّ الْمُتَوَكِّل۪ينَ ۝ 
    """, russian: """
    (Эй Расулим! Ҳамиша ва, хусусан, Уҳуд урушида) сиз Аллоҳдан бўлган бир раҳмат туфайли уларга юмшоқ муомала қилдингиз. Агар  қўпол, қаттиқ қалбли бўлганингизда эди, албатта, улар атрофингиздан тарқалиб кетар эдилар. У ҳолда уларни авф этинг,  улар учун мағфират тиланг ва (кўпга оид) иш ҳақида улар билан маслаҳатлашинг, азму қарор қилганингиздан эса Аллоҳга таваккул қилинг (ва у ишни қилинг). Шубҳасиз, Аллоҳ Ўзига таваккул қилгувчи (ишониб-таянгувчи)ларни севар (3/Оли Имрон,  159).
    """),
    DailyArabicRussianModel(arabic: """
    وَاسْتَغْفِرِ اللّٰهَۜ اِنَّ اللّٰهَ كَانَ غَفُورًا رَح۪يمًاۚ ۝ 
    """, russian: """
    Аллоҳдан  мағфират тиланг. Шубҳасизки, Аллоҳ  беҳад мағфиратли, бениҳоят раҳмли зотдир (4/Нисо,  106).
    """),
    DailyArabicRussianModel(arabic: """
    وَمَنْ يَعْمَلْ سُٓوءًا اَوْ يَظْلِمْ نَفْسَهُ ثُمَّ يَسْتَغْفِرِ اللّٰهَ يَجِدِ اللّٰهَ غَفُورًا رَح۪يمًا ۝ 
    """, russian: """
    Кимки бир ёмонлик қилса ёки (гуноҳ иш билан) ўз-ўзига зулм қилса-ю, кейин эса (пушаймон бўлиб) Аллоҳдан мағфират сўраса,  Аллоҳни беҳад мағфиратли, бениҳоят раҳмли топур
 (4/Нисо,  110).
    """),
    DailyArabicRussianModel(arabic: """
    اَفَلَا يَتُوبُونَ اِلَى اللّٰهِ وَيَسْتَغْفِرُونَهُۜ وَاللّٰهُ غَفُورٌ رَح۪يمٌ ۝ 
    """, russian: """
    Ахир, Аллоҳга тавба қилиб, Ундан кечирим сўрамайдиларми? Ҳолбуки, Аллоҳ беҳад мағфиратли ва бениҳоят раҳмлидир 
(5/Моида,  74).

    """),
    DailyArabicRussianModel(arabic: """
    وَمَا كَانَ اللّٰهُ لِيُعَذِّبَهُمْ وَاَنْتَ ف۪يهِمْۜ وَمَا كَانَ اللّٰهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ ۝ 
    """, russian: """
(Эй Расулим!) Модомики, сиз уларнинг ораларида бор экансиз, (улар ҳар вақт сизга ва буйруқларингизга итоат этар эканлар,) Аллоҳ ҳаргиз уларга азоб бермас. Ва модомики, улар истиғфор айтиб турар эканлар, Аллоҳ уларни азоблагувчи эмасдир (8/Анфол, 33).    
    """),
    DailyArabicRussianModel(arabic: """
    اِسْتَغْفِرْ لَهُمْ اَوْ لَا تَسْتَغْفِرْ لَهُمْۜ اِنْ تَسْتَغْفِرْ لَهُمْ سَبْع۪ينَ مَرَّةً فَلَنْ يَغْفِرَ اللّٰهُ لَهُمْۜ ذٰلِكَ بِاَنَّهُمْ كَفَرُوا بِاللّٰهِ وَرَسُولِه۪ۜ وَاللّٰهُ لَا يَهْدِي الْقَوْمَ الْفَاسِق۪ينَ۟ ۝ 
    """, russian: """
    (Эй  Расулим!) Улар(нинг кечирилиши) учун хоҳ истиғфор тиланг, хоҳ истиғфор тиламанг! Улар учун етмиш марта истиғфор тиласангиз ҳам, Аллоҳ уларни кечирмас.  Бу уларнинг Аллоҳга ва унинг Расулига нисбатан (иймонда самиймий бўлмай) куфр келтирганлари учундир. Аллоҳ (Ўз амридан чиққан) фосиқлар қавмини тўғри йўлга эриштирмас (9/Тавба,  80)
    """),
    DailyArabicRussianModel(arabic: """
    وَاَنِ اسْتَغْفِرُوا رَبَّكُمْ ثُمَّ تُوبُٓوا اِلَيْهِ يُمَتِّعْكُمْ مَتَاعًا حَسَنًا اِلٰٓى اَجَلٍ مُسَمًّى وَيُؤْتِ كُلَّ ذ۪ي فَضْلٍ فَضْلَهُۜ وَاِنْ تَوَلَّوْا فَاِنّٓي اَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ كَب۪يرٍ ۝
    """, russian: """
    (Эй Расулим! Айтинг:) " Раббингиздан мағфират тиланглар, кейин Унга тавба қилинглар, токи, сизларни белгили бир муддатга қадар гўзал бир ҳаёт билан фойдалантирсин ва ҳар бир фазилатли - яхши ҳаракат эгасига (у лойиқ бўлган) эхсони - мукофотини берсин. Агар (иймондан) юз ўгирсангизлар, албатта, мен сизлар учун улуғ бир куннинг азобидан қўрқурман" 
(11/Ҳуд,  3)
    """),
    DailyArabicRussianModel(arabic: """
    وَاسْتَغْفِرُوا رَبَّكُمْ ثُمَّ تُوبُٓوا اِلَيْهِۜ اِنَّ رَبّ۪ي رَح۪يمٌ وَدُودٌ ۝ 
    """, russian: """
    "Раббингиздан мағфират тиланглар, кейин Унга тавба қил(иб йўнал)инглар! Шуҳбасизки, Раббим беҳад марҳамат қилгувчи, (ишонганларни) кўп-кўп севгувчидир!" 
(11/Ҳуд,  90)
    """),
    DailyArabicRussianModel(arabic: """
اَفَحَسِبْتُمْ اَنَّمَا خَلَقْنَاكُمْ عَبَثًا وَاَنَّكُمْ اِلَيْنَا لَا تُرْجَعُونَ ۝     
    """, russian: """
    "Сизлар гумон қилдингизларки, Биз сизларни беҳуда яратдиг-у, ҳақиқатан, Бизга қайтарилмасмисизлар?" 
(23/Мўминун, 115)
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّمَا الْمُؤْمِنُونَ الَّذ۪ينَ اٰمَنُوا بِاللّٰهِ وَرَسُولِه۪ وَاِذَا كَانُوا مَعَهُ عَلٰٓى اَمْرٍ جَامِعٍ لَمْ يَذْهَبُوا حَتّٰى يَسْتَأْذِنُوهُۜ اِنَّ الَّذ۪ينَ يَسْتَأْذِنُونَكَ اُو۬لٰٓئِكَ الَّذ۪ينَ يُؤْمِنُونَ بِاللّٰهِ وَرَسُولِه۪ۚ فَاِذَا اسْتَأْذَنُوكَ لِبَعْضِ شَأْنِهِمْ فَأْذَنْ لِمَنْ شِئْتَ مِنْهُمْ وَاسْتَغْفِرْ لَهُمُ اللّٰهَۜ اِنَّ اللّٰهَ غَفُورٌ رَح۪يمٌ ۝
    """, russian: """
    Ҳақиқий мўминлар фақат Аллоҳга ва Унинг Расулига (томм) иймон келтирганлардир ва у (Расул) билан бирга жамоа бўлиб (ёки жамоатга оид) бир иш устида бўлган вақтларида, то ундан изн олмагунларича (ажралиб, ўз ишларига) кетиб қолмайдиган кишилардир. (Эй Расулим!) Дарҳақиқат, сиздан изн сўрайдиганлар Аллоҳга ва унинг расулига (чин манода) ишонадиган кишилардир. Шундоқ экан, улар қай вақт бази ишлари учун сиздан изн сўрасалар, улардан хоҳлаганингизга изн беринг ва улар учун Аллоҳдан мағфират тиланг. Шубҳасизки,  Аллоҳ беҳад мағфиратли,  бениҳоят раҳмлидир (24/Нур,  62).
    """),
    DailyArabicRussianModel(arabic: """
    قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ اِلٰى نِعَاجِه۪ۜ وَاِنَّ كَث۪يرًا مِنَ الْخُلَطَٓاءِ لَيَبْغ۪ي بَعْضُهُمْ عَلٰى بَعْضٍ اِلَّا الَّذ۪ينَ اٰمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَقَل۪يلٌ مَا هُمْۜ وَظَنَّ دَاوُ۫دُ اَنَّمَا فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَاَنَابَ ۝ 
    """, russian: """
(Довуд) деди: "Муҳаққақки, (бу одам) сенинг қўйингни ўз қўйларига (қўшиш ва мулкига олишни) сўраб, сенга зулм қилибди! Дарҳақиқат, (молларини меёрсиз ва сабабсиз-тартибсиз бир- бирига) қўшувчи (шерик)лардан кўплари бир- бирларига аниқ зулм қилур. Фақат иймон келтириб,  солиҳ амал (ва ҳаракат)ларни қилганлар бундан мустаснодир, аммо улар жуда оздир". Довуд (бу воқеа билан) Биз уни, албатта, имтиҳон қил(иб, унга бало юбор)ишимизни фикр қилди-да, дарҳол Раббидан мағфират (ҳимоя) сўради, руку қилган ҳолида (саждага) йиқилди ва (тавба қилиб, Бизга) қайтди 
(38/Сод,  24)   (САЖДА ояти).
    """),
    DailyArabicRussianModel(arabic: """
      اَلَّذ۪ينَ يَحْمِلُونَ الْعَرْشَ وَمَنْ حَوْلَهُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيُؤْمِنُونَ بِه۪ وَيَسْتَغْفِرُونَ لِلَّذ۪ينَ اٰمَنُواۚ  رَبَّنَا وَسِعْتَ كُلَّ شَيْءٍ رَحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذ۪ينَ تَابُوا وَاتَّبَعُوا سَب۪يلَكَ وَقِهِمْ عَذَابَ الْجَح۪يمِ ۝ 
    """, russian: """
    Аршни кўтариб турадиган (фаришта)лар ва унинг атрофидаги (тавоф қилувчи фаришта)лар ўз Раббига ҳамди ила тасбиҳ айтурлар. 
Унга иймон келтирурлар ва мўминларнинг мағфират қилинишини тиларлар: "Эй Раббимиз! Сенинг раҳматинг ва илминг ҳамма нарсани қамрагандир. Тавба қилган ва сенинг йўлингга  эргашганларни мағфират қил, уларни жаҳаннам азобидан сақла!" (40/Мумин (Ғофир), 7).
    """),
    DailyArabicRussianModel(arabic: """
    فَاصْبِرْ اِنَّ وَعْدَ اللّٰهِ حَقٌّ وَاسْتَغْفِرْ لِذَنْبِكَ وَسَبِّحْ بِحَمْدِ رَبِّكَ بِالْعَشِيِّ وَالْاِبْكَارِ ۝ 
    """, russian: """
    У ҳолда, (Эй Расули, сиз) сабр қилинг. Чунки Аллоҳнинг (зафар) вадаси ҳақдир. (Ихтиёрсиз кичик саҳвлардан иборат) гуноҳларингиз учун истиғфор айтинг ва шомда ва тонгда (ҳамиша) Раббингизга ҳамди ила тасбиҳ айтинг (40/Мумин(Ғофир), 55).
    """),
    DailyArabicRussianModel(arabic: """
    فَاعْلَمْ اَنَّهُ لَٓا اِلٰهَ اِلَّا اللّٰهُ وَاسْتَغْفِرْ لِذَنْبِكَ وَلِلْمُؤْمِن۪ينَ وَالْمُؤْمِنَاتِۜ وَاللّٰهُ يَعْلَمُ مُتَقَلَّبَكُمْ وَمَثْوٰيكُمْ۟ ۝ 
    """, russian: """
    (Эй Расулим!) Бас, билингки, Аллоҳдан бошқа ҳеч бир илоҳ йўқ! (Саҳв ва қусурлардан иборат) гуноҳингиз учун ҳамда мўмин ва мўминалар(нинг гуноҳлари) учун мағфират тиланг!  Аллоҳ сизларнинг юрган-турган жойларингизни ҳам, (оқибатда) қоладиган жойларингизни ҳам билур (47/Муҳаммад,  19).
    """),
    DailyArabicRussianModel(arabic: """
    سَيَقُولُ لَكَ الْمُخَلَّفُونَ مِنَ الْاَعْرَابِ شَغَلَتْنَٓا اَمْوَالُنَا وَاَهْلُونَا فَاسْتَغْفِرْ لَنَاۚ يَقُولُونَ بِاَلْسِنَتِهِمْ مَا لَيْسَ ف۪ي قُلُوبِهِمْۜ قُلْ فَمَنْ يَمْلِكُ لَكُمْ مِنَ اللّٰهِ شَيْـًٔا اِنْ اَرَادَ بِكُمْ ضَرًّا اَوْ اَرَادَ بِكُمْ نَفْعًاۜ بَلْ كَانَ اللّٰهُ بِمَا تَعْمَلُونَ خَب۪يرًا ۝ 
    """, russian: """
    Бадавийлардан (Ҳудайбийя санасида узр-мазур айтиб) орқада қолганлар сизга:"Мол-мулкимиз ва бола- чақамиз  (ташвиши) бизни машғул қилиб қўйди. Улар дилларида бўлмаган нарсани тиллари билан айтурлар. Айтинг: " Агар У (Аллоҳ) сизларга бир зарарни хоҳласа ёки сизларга бир фойдани хоҳласа, ким (Унинг иродасига қарши бориб) сизлар учун Аллоҳдан бирор нарсани тўсишга молик бўлур?"  Дарҳақиқат,  Аллоҳ қилаётган амалларингиздан ўта хабардордир (48/Фатҳ,  11).
    """),
    DailyArabicRussianModel(arabic: """
كَانُوا قَل۪يلًا مِنَ الَّيْلِ مَا يَهْجَعُونَ  ۝   وَبِالْاَسْحَارِ هُمْ يَسْتَغْفِرُونَ ۝ 
    """, russian: """
    Улар (муттақий зотлар ибодат қилиш учун фақат) кечанинг озгина қисмида ухлар ва саҳарларда (дуо қилиб) истиғфор айтар эдилар (51/Зориёт, 17-18).
    """),
    DailyArabicRussianModel(arabic: """
    هُوَ الْاَوَّلُ وَالْاٰخِرُ وَالظَّاهِرُ وَالْبَاطِنُۚ وَهُوَ بِكُلِّ شَيْءٍ عَل۪يمٌ ۝ 
    """, russian: """
    У (Аллоҳ ибтидоси йўқ) Аввалдир ва (интихоси йўқ) Охирдир (мангу боқий қолгувчидир). Зоҳирдир (борлиғининг далиллари очиқ-ошкордир), Ботиндир (зотининг ҳақиқати яшириндир). У ҳар нарсани ҳаққоний билгувчидир (57/Ҳадид,  3).
    """),
    DailyArabicRussianModel(arabic: """
    َدْ كَانَتْ لَكُمْ اُسْوَةٌ حَسَنَةٌ ف۪ٓي اِبْرٰه۪يمَ وَالَّذ۪ينَ مَعَهُۚ اِذْ قَالُوا لِقَوْمِهِمْ اِنَّا بُرَءٰٓؤُ۬ا مِنْكُمْ وَمِمَّا تَعْبُدُونَ مِنْ دُونِ اللّٰهِۘ  كَفَرْنَا بِكُمْ وَبَدَا بَيْنَنَا وَبَيْنَكُمُ الْعَدَاوَةُ وَالْبَغْضَٓاءُ اَبَدًا حَتّٰى تُؤْمِنُوا بِاللّٰهِ وَحْدَهُٓ اِلَّا قَوْلَ اِبْرٰه۪يمَ لِاَب۪يهِ لَاَسْتَغْفِرَنَّ لَكَ وَمَٓا اَمْلِكُ لَكَ مِنَ اللّٰهِ مِنْ شَيْءٍۜ رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَاِلَيْكَ اَنَبْنَا وَاِلَيْكَ الْمَص۪يرُ ۝ 
    """, russian: """
    Дарҳақиқат, Иброҳимда ва у билан бирга бўлган кишиларда сизлар учун гўзал ўрнак бордир. Ёд этинг, улар ўз қавмига: 
"Шубҳасиз, биз сизлардан ва Аллоҳдан бошқа сиғинаётган нарсаларингиздан безормиз. Биз сизларни инкор этдик ва токи сизлар ягона Аллоҳга (ширксиз) иймон келтирмагунингизча, сизлар билан бизнинг орамизда абадий душманлик ва адоват барқарор бўлди", деган эдилар. Илло Иброҳимнинг (ҳали мушриклар ҳақида мағфират тилаш тақиқланмаган вақтда) отасига: "Сен учун, албатта, мағфират тилайман,- деган сўзи бундан мустаснодир (бу сизларга ўрнак эмасдир) -- (аммо) Сен учун Аллоҳдан келадиган ҳеч бир нарса(ни қайтариш)га қодир эмасман"... (Улар яна:) "Эй Раббимиз! Ёлғиз ўзинга таваккул қилдик - таяндик, ёлғиз Ўзингга йўналдик, қайтиш фақат ўзинггадир!" (-деган эдилар)
 (60/Мумтаҳана,  4).
    """),
    DailyArabicRussianModel(arabic: """
يَٓا اَيُّهَا  النَّبِيُّ  اِذَا جَٓاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلٰٓى اَنْ لَا يُشْرِكْنَ بِاللّٰهِ  شَيْـًٔا وَلَا يَسْرِقْنَ وَلَا يَزْن۪ينَ وَلَا يَقْتُلْنَ اَوْلَادَهُنَّ وَلَا يَأْت۪ينَ بِبُهْتَانٍ يَفْتَر۪ينَهُ بَيْنَ اَيْد۪يهِنَّ وَاَرْجُلِهِنَّ وَلَا يَعْص۪ينَكَ ف۪ي مَعْرُوفٍ فَبَايِعْهُنَّ وَاسْتَغْفِرْ لَهُنَّ اللّٰهَۜ اِنَّ اللّٰهَ غَفُورٌ رَح۪يمٌ ۝ 
    """, russian: """
Эй Пайғамбар! Қачон мўмина аёллар - Аллоҳга ҳеч бир суратда ширк  келтирмаслик, ўғрилик қилмаслик, зино қилмаслик, (қиз)  болаларини ўлдирмаслик, қўллари ва оёқлари орасидан бир бўҳтон тўкиб келтирмаслик (яни бошқадан пайдо бўлган болани эрига нисбат бермаслик), яхши иш(ни  буюрганингизда ва ёмонликдан қайтарганингиз)да сизга осий бўлмаслик шарти билан ҳузурингизга баят қилишга (сизга боғлиқ бўлиб қолиш ҳақида сўз беришга) келсалар, уларнинг баятларини қабул қилинг ва улар учун Аллоҳдан мағфират тиланг. Шубҳасизки, Аллоҳ беҳад мағфиратли, бениҳоят раҳмлидир (60/Мумтаҳина,  12).
    """),
    DailyArabicRussianModel(arabic: """
    وَاِذَا ق۪يلَ لَهُمْ تَعَالَوْا يَسْتَغْفِرْ لَكُمْ رَسُولُ اللّٰهِ لَوَّوْا رُؤُ۫سَهُمْ وَرَاَيْتَهُمْ يَصُدُّونَ وَهُمْ مُسْتَكْبِرُونَ  ۝   سَوَٓاءٌ عَلَيْهِمْ اَسْتَغْفَرْتَ لَهُمْ اَمْ لَمْ تَسْتَغْفِرْ لَهُمْۜ لَنْ يَغْفِرَ اللّٰهُ لَهُمْۜ اِنَّ اللّٰهَ لَا يَهْدِي الْقَوْمَ الْفَاسِق۪ينَ  ۝
    """, russian: """
    Уларга: "Келинглар, Аллоҳнинг Расули(дан узр сўранглар, токи у )   сизлар учун мағфират тиласин", - дейилган вақтда, бошларини (ўнгга-чапга) чайқаганларини   ва (узр сўрашдан орланиб) кибр қилган ҳолда юз ўгирганларини кўрурсиз. Улар учун хоҳ мағфират тиланг, хоҳ мағфират тиламанг, бари бирдир (аҳвол ўзгармас). Аллоҳ уларни асло кечирмас. Шуҳбасизки, Аллоҳ фосиқлар қавмини ҳидоят қилмас - тўғри йўлга бошламас
 (63/Мунофиқун,  5-6).
    """),
    DailyArabicRussianModel(arabic: """
    اِنَّ رَبَّكَ يَعْلَمُ اَنَّكَ تَقُومُ اَدْنٰى مِنْ ثُلُثَيِ الَّيْلِ وَنِصْفَهُ وَثُلُثَهُ وَطَٓائِفَةٌ مِنَ الَّذ۪ينَ مَعَكَۜ وَاللّٰهُ يُقَدِّرُ الَّيْلَ وَالنَّهَارَۜ عَلِمَ اَنْ لَنْ تُحْصُوهُ فَتَابَ عَلَيْكُمْ فَاقْرَؤُ۫ا مَا تَيَسَّرَ مِنَ الْقُرْاٰنِۜ عَلِمَ اَنْ سَيَكُونُ مِنْكُمْ مَرْضٰىۙ وَاٰخَرُونَ يَضْرِبُونَ فِي الْاَرْضِ يَبْتَغُونَ مِنْ فَضْلِ اللّٰهِۙ وَاٰخَرُونَ يُقَاتِلُونَ ف۪ي سَب۪يلِ اللّٰهِۘ فَاقْرَؤُ۫ا مَا تَيَسَّرَ مِنْهُۙ وَاَق۪يمُوا الصَّلٰوةَ وَاٰتُوا الزَّكٰوةَ وَاَقْرِضُوا اللّٰهَ قَرْضًا حَسَنًاۜ وَمَا تُقَدِّمُوا لِاَنْفُسِكُمْ مِنْ خَيْرٍ تَجِدُوهُ عِنْدَ اللّٰهِ هُوَ خَيْرًا وَاَعْظَمَ اَجْرًاۜ وَاسْتَغْفِرُوا اللّٰهَۜ اِنَّ اللّٰهَ غَفُورٌ رَح۪يمٌ ۝ 
    """, russian: """
    (Эй Расулим!) Шуҳбасиз, Раббингиз билурки, сиз кечанинг  (гоҳ) учдан икки қисмига яқинини, (гоҳ) ярмини ва (гоҳ) учдан бир қисмини тик тур(иб ибодат билан ўтказ)урсиз  ва сиз билан бирга бўлганлардан бир тоифа ҳам (шундоқ қилур). Кеча ва кундуз (миқдори)ни Аллоҳ тақдир қилур (белгилар; уларни фаслларга кўра гоҳ узун, гоҳ қисқа қилур). У (Аллоҳ) сизлар уни (бутун кеча оёқда туриб, ибодатда бедор ўтказиш миқдорини) ҳисоблаб (тўлиқ қамраб, уддалай) олмаслигингизни билди ва сизларни кечирди (таҳажжудни фарз қилмасдан, енгиллаштирди). Энди (намозда) Қурондан осон-муяссар бўлган (миқдор)ини ўқинглар. У зот орангиздан базилар бемор (ҳолатда) бўлишини,  бошқа базилар Аллоҳнинг фазлу карамидан (насиба) қидириб ер юзида кезиб юришини, бошқа базилар эса Аллоҳ  йўлида жанг қилишини билур. У ҳолда ундан (Қурондан) осон-муяссар бўлган (миқдор)ини ўқинглар,  (фарз) намозини адо этинглар, закотни беринглар ва Аллоҳга қарзи ҳасана беринглар (кўнгил хушлиги билан гўзал бир қарз беринглар -- муқобилини Аллоҳдан олиш шарти ила яхшилик қилинглар). Ўзларингиз учун олдиндан (дунёда эканлигингиздан охиратга) нима яхши нарса юборсангизлар, Аллоҳ хузурида уни янада яхшироқ ва улуғроқ ажр-мукофот ҳолида топгайсизлар. Аллоҳдан мағфират тиланглар. Албатта, Аллоҳ беҳад мағфиратлидир, бениҳоят раҳмлидир (73/Музаммил, 20).
    """),
    DailyArabicRussianModel(
        arabic: """
اِذَا جَٓاءَ نَصْرُ اللّٰهِ وَالْفَتْحُۙ  ۝   وَرَاَيْتَ النَّاسَ يَدْخُلُونَ ف۪ي د۪ينِ اللّٰهِ اَفْوَاجًاۙ  ۝   فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُۜ اِنَّهُ كَانَ تَوَّابًا ۝    """,
        russian: """
Бисмиллаҳир-Роҳманир-Роҳийм.
Аллоҳнинг (вада қилган) ёрдами ва фатҳ (зафар) келганида, Инсонлар тўп-тўп бўлиб Аллоҳнинг (сўнгги) динига кираётганларини кўрсангиз, дарҳол Раббингизга ҳамд ила тасбиҳ айтинг ва Ундан мағфират сўранг. Чунки У тавбаларни кўплаб қабул қилгувчидир (110/Наср,  1-3).
   
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَعَافِنِي وَارْزُقْنِي ۝ 
    """, russian: """
    Ҳадиси шарифлар

Аллоҳим! Мени мағфират қил, менга раҳм қил, мени тўғри йўлга бошла (ризоингга эришадиган ишларни насиб эт), менга офият - сиҳат - саломатлик, тинчлик - хотиржамлик бер ва хайрли ризқ ато эт!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَسْأَلُكَ رَحْمَةً مِنْ عِنْدِكَ  ۝   تَهْدِي بِهَا قَلْبِي  ۝    وَتَجْمَعُ بِهَا أَمْرِي  ۝    وَتَلُمُّ بِهَا شَعَثِي  ۝   وَتُصْلِحُ بِهَا غَائِبِي  ۝   وَتَرْفَعُ بِهَا شَاهِدِي  ۝   وَتُزَكِّي بِهَا عَمَلِي  ۝   وَتُلْهِمُنِي بِهَا رَشَدِي  ۝   وَتَرُدُّ بِهَا أُلْفَتِي  ۝   وَتَعْصِمُنِي بِهَا مِنْ كُلِّ سُوءٍ  ۝
    """, russian: """
    Аллоҳим! Сенинг ҳузурингдан шундай бир раҳмат тилайманки, раҳмат билан қалбимни ҳидоят қилгайсан, ишларимни жамлагайсан, тангликларимни тузатгайсан,  у раҳмат билан ички оламимни (гўзал ахлоқ билан) ислоҳ қи(либ камолга етказ)гайсан ва у билан ташқи оламимни юксалтиргайсан, амалимни поклагайсан; у раҳмат билан менга тўғри ри йўлни илҳом айлагайсан, у билан (Ўзингга) дўстлигимни тамин этгайсан ва мени  ҳар турли ёмонликлардан сақлагайсан! 
    """),
    DailyArabicRussianModel(arabic: """
     اَللّٰهُمَّ أَعْطِنِي إِيمَانًا وَيَقِينًا لَيْسَ بَعْدَهُ كُفْرٌ  ۝   وَرَحْمَةً أَنَالُ بِهَا شَرَفَ كَرَامَتِكَ فِي الدُّنْيَا وَالْاٰخِرَةِ ۝   اَللّٰهُمَّ  إِنِّي أَسْأَلُكَ الْفَوْزَ فِي الْقَضَاءِ  ۝   وَنُزُلَ الشُّهَدَاءِ  ۝    وَعَيْشَ السُّعَدَاءِ  ۝   وَالنَّصْرَ عَلَى الْأَعْدَاءِ  ۝
    """, russian: """
    Аллоҳим! Менга кейинида куфр (жойи) бўлмайдиган (собит) иймон ва яқийн ато эт! Ва менга дунёю охиратда Сенинг икроминг (назаринг) шарафига эришадиган бир раҳмат бер!  Аллоҳим! Сендан (ҳақимда бериладиган) ҳукм (ва бағишлов куни)да нажотни, шаҳидлар (даражаси) манзилини, саодатли  бандаларинг ҳаётини ва душманлар устидан нусратни сўрайман!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أُنْزِلُ بِكَ حَاجَتِي  ۝   وَإِنْ قَصُرَ رَأْيِي وَضَعُفَ عَمَلِي  ۝    اِفْتَقَرْتُ إِلٰى رَحْمَتِكَ ۝ 
    """, russian: """
    Аллоҳим! Кўришим қусурли - қисқа (кўзим етмас), амалим нокис  бўлса-да,  мен Сендан ҳожатимнинг (бир зум олдин) раво этилмоғини сўрайман. Сенинг раҳматингга муҳтожман.
    """),
    DailyArabicRussianModel(arabic: """
     فَأَسْأَلُكَ يَا قَاضِيَ الْأُمُورِ  ۝  وَيَا شَافِيَ الصُّدُورِ  ۝    كَمَا تُجِيرُ بَيْنَ الْبُحُورِ أَنْ تُجِيرَنِي مِنْ عَذَابِ السَّعِيرِ  ۝   وَمِنْ دَعْوَةِ الثُّبُورِ  ۝   وَمِنْ فِتْنَةِ الْقُبُورِ  ۝
    """, russian: """
    Эй (барча) ишларни (ҳукм этиб) битиргувчи Зот! Эй  (бутун) кўнгилларга шифо бергувчи Зот! Денгизларни бир-бирига қўшилиб кетишдан сақлаб, ораларини ажратиб турганинг каби, мени ҳам дўзах азобидан, ҳалокатга элтувчи чақириқдан ва қабрлар фитнасидан сақламоғни сўрайман!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ مَا قَصُرَ عَنْهُ رَأْيِي  ۝  وَلَمْ تَبْلُغْهُ نِيَّتِي  ۝   وَلَمْ تَبْلُغْهُ مَسْأَلَتِي مِنْ خَيْرٍ وَعَدْتَهُ أَحَدً مِنْ خَلْقِكَ  ۝  أَوْ خَيْرٍ أَنْتَ مُعْطِيهِ أَحَدًا مِنْ عِبَادِكَ  ۝   فَإِنِّي أَرْغَبُ إِلَيْكَ فِيهِ  ۝   وَأَسْأَلُكَهُ بِرَحْمَتِكَ رَبَّ الْعَالَمِينَ  ۝ 
    """, russian: """
    Аллоҳим! Кўзим  етмайдиган,  ниятим эриша олмайдиган, тилагим ета олмайдиган, Ўз  яратганларингдан бирортасига вада қилганинг ёки Ўз бандаларингдан бирортасига берганинг - Сенинг ризолигингни исташимга сабаб бўладиган бирор яхшилик бор бўлса, мен раҳматингга таяниб, ўшани  Сендан тилайман,  эй оламларнинг Рабби!
    """),
    DailyArabicRussianModel(arabic: """
     اَللّٰهُمَّ ذَا الْحَبْلِ الشَّدِيدِ وَالْأَمْرِ الرَّشِيدِ  ۝   أَسْأَلُكَ الْأَمْنَ يَوْمَ الْوَعِيدِ  ۝    وَالْجَنَّةَ يَوْمَ الْخُلُودِ  ۝   مَعَ الْمُقَرَّبِينَ الشُّهُودِ الرُّكَّعِ السُّجُودِ الْمُوفِينَ بِالْعُهُودِ  ۝   إِنَّكَ رَحِيمٌ وَدُودٌ  ۝   وَأَنْتَ تَفْعَلُ مَا تُرِيدُ  ۝  
    """, russian: """
    Аллоҳим! Эй мустаҳкам арқон (маҳкам шариат), тўғри иш Эгаси! Кўриб шоҳид бўлгувчи, рукуга боргувчи, саждага йиқилгувчи,  амринга итоат этгувчи бандаларинг ва ҳузурингда ҳозир бўлгувчи муқарраб фаришталаринг билан бирга, Сендан қўрқитиш куни -  қиёмат кунида омонликни,  абадий қолиш кунида жаннатни сўрайман! Албатта, Сен Раҳийм ва Вадудсан  (бениҳоят раҳмли, бандаларини севгувчи, севгувчиларнинг энг буюги, севилмоққа энг кўп лойиқ Зотсан)! Сен хоҳлаган ишингни қилгувчисан!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ اجْعَلْنَا هَادِينَ مُهْتَدِينَ   ۝   غَيْرَ ضَالِّينَ وَلَا مُضِلِّينَ  ۝   سِلْمًا لِأَوْلِيَائِكَ وَعَدُوًّا لِأَعْدَائِكَ  ۝   نُحِبُّ بِحُبِّكَ مَنْ أَحَبَّكَ   ۝   وَنُعَادِي بِعَدَاوَتِكَ مَنْ خَالَفَكَ ۝ 
    """, russian: """
    Аллоҳим! Бизни йўлдан озгувчилардан ва йўлдан оздиргувчилардан қилмасдан,  ҳидоятга - тўғри йўлга эришганлардан ва ҳидоятга бошловчилардан айла! Бизни дўстларингга  муросали дўст, душманларингга муросасиз душман қил!  Сенинг севганларингни Сенинг муҳаббатинг учун севармиз,  Сенга мухолафат қилгувчиларни Сен душман тутганинг учун душман тутармиз!
    """),
    DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ هٰذَا الدُّعَاءُ وَعَلَيْكَ الْإِسْتِجَابَةُ   ۝   وَهٰذَا الْجُهْدُ وَعَلَيْكَ التُّكْلَانُ   ۝   اَللّٰهُمَّ اجْعَلْ لِي نُورًا فِي قَبْرِي   ۝   وَنُورًا فِي قَلْبِي   ۝   وَنُورًا مِنْ بَيْنِ يَدَيَّ   ۝   وَنُورًا مِنْ خَلْفِي   ۝   وَنُورًا عَنْ يَمِينِي   ۝   وَنُورًا عَنْ شِمَالِي   ۝    وَنُورًا مِنْ فَوْقِي   ۝   وَنُورًا مِنْ تَحْتِي   ۝   وَنُورًا فِي سَمْعِي   ۝    وَنُورًا فِي بَصَرِي   ۝   وَنُورًا فِي شَعْرِي   ۝   وَنُورًا فِي بَشَرِي   ۝    وَنُورًا فِي لَحْمِي   ۝   وَنُورًا فِي دَمِي   ۝   وَنُورًا فِي عِظَامِي   ۝
    """, russian: """
    Аллоҳим! (Қўлимдан келган) дуо будир, ижобат Сендандир, (қўлимдан келган) ғайбат будир, суянчиғимиз Сенсан. 
Аллоҳим! Қалбимга нур бериб ёруғ қил, қабримга нур бериб ёруғ қил! Олдимни нур бериб ёритгил, ортимда нур бериб ёритгил! Ўнгимни нур бериб ёритгил, сўлимни нур бериб ёритгил! Устимни нур бериб ёритгил, остимни нур бериб ёритгил! Қулоғимга нур бериб ёруғ қил, кўзимга нур бериб ёруғ қил! Сочимга нур бериб ёритгил, теримга нур бериб ёритгил! Этимга нур бериб ёритгил, қонимга нур бериб ёритгил. Суягимга нур бериб ёритгил!

    """),
    DailyArabicRussianModel(arabic: """
     اَللّٰهُمَّ أَعْظِمْ لِي نُورًا   ۝   وَأَعْطِنِي نُورًا   ۝   وَاجْعَلْ لِي نُورًا    ۝
    """, russian: """
    Аллоҳим! Нуримни улуғ қил, менга  нур ато қил! Ва мен учун нур пайдо қил!  
    """),
    DailyArabicRussianModel(arabic: """
    سُبْحَانَ الَّذِي تَعَطَّفَ الْعِزَّ وَقَالَ بِه۪   ۝   سُبْحَانَ الَّذِي لَبِسَ الْمَجْدَ وَتَكَرَّمَ بِه۪   ۝   سُبْحَانَ الَّذِي لَا يَنْبَغِي التَّسْبِيحُ إِلَّا لَهُ   ۝   سُبْحَانَ ذِي الْفَضْلِ وَالنِّعَمِ   ۝   سُبْحَانَ ذِي الْمَجْدِ وَالْكَرَمِ   ۝   سُبْحَانَ ذِي الْجَلَالِ وَالْإِكْرَامِ ۝ 
    """, russian: """
    (Эй) иззатга (мутлақ ғолиблик ва куч-қувватга) эгалик қилиб, уни Ўзига байроқ қилган Зот (Раббим), Сен пок ва муназзаҳсан!  Мажд - буюкликка эга бўлиб, у билан (бандаларига) мўл-кўл икром этувчи Зот (Раббим), Сен пок ва муназзаҳсан! (Эй,) тасбиҳ фақат Ўзигагина лойиқ бўлган Зот (Раббим), Сен ғоят юксак ва (нуқсон сифатларидан) пок ва муназзаҳсан! Эй фазл ва (энсону) немат эгаси бўлган Зот, Сен пок ва муназзаҳсан!  Мажд - буюклик ва карам эгаси, Сен пок ва муназзаҳсан! Жалол (улуғлик) ва икром эгаси! Сен пок ва муназзаҳсан!
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ وَالْجُنُونِ وَالْجُذَامِ   ۝   وَمِنْ سَيِّئِ الْأَسْقَامِ ۝ 
    """, russian: """
    Аллоҳим! Мохов касаллигидан, жинниликдан, пес иллатидан ва ёмон хасталиклардан Ўзингдан паноҳ тилайман (Ўзинг асра)! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ  إِنِّـي أَعُوذُ بِكَ مِنْ مُنْكَرَاتِ الْأَخْلَاقِ وَالْأَعْمَالِ وَالْأَهْوَاءِ ۝ 
    """, russian: """
    Аллоҳим! Ёмон ахлоқни бўлишдан, ярамас ишларни қилишдан ва ёмон орзу-ҳаваслардан (хато этиқодларга тойишдан) Ўзингдан паноҳ тилайман! 
    """),
    DailyArabicRussianModel(arabic: """
    اَللّٰهُمَّ أَلْهِمْنِي رُشْدِي   ۝   وَأَعِذْنِي مِنْ شَرِّ نَفْسِي ۝
    """, russian: """
    Аллоҳим! Менга тўғри йўлни илоҳ қил (кўрсат) ва мени нафсим ёмонлигидан Ўзинг асра! 
    """),
    DailyArabicRussianModel(arabic: """
    يَا مُقَلِّبَ الْقُلُوبِ   ۝   ثَبِّتْ قَلْبِي عَلٰى دِيـنِكَ ۝ 
    """, russian: """
    Эй қалбларни (ҳолдан-ҳолга) ўзгартирувчи Зот (Аллоҳим)! Менинг қалбимни Ўз дининг узра собит қил!
    """),
  ],
  // Sunday

  [
   DailyArabicRussianModel(arabic: """   
وَاِذْ قَالَ رَبُّكَ لِلْمَلٰٓئِكَةِ اِنّ۪ي جَاعِلٌ فِي الْاَرْضِ خَل۪يفَةًۜ قَالُٓوا اَتَجْعَلُ ف۪يهَا مَنْ يُفْسِدُ ف۪يهَا وَيَسْفِكُ الدِّمَٓاءَۚ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَۜ قَالَ اِنّٓي اَعْلَمُ مَا لَا تَعْلَمُونَ ۝ 
   """, russian: """
   (Эй Расулим!) Вақтида, Раббингиз малоикаларга: " Мен ер юзида (ҳукмларимни бажо келтирадиган)  бир халифа (салоҳият ва бошқарувга лойиқ бир инсон)  яратгайман", деди. (Малоикалар: "Ё Рабби! ) Биз сени ҳамд (мақтов) ила улуғлаб, Сени, барча нуқсонларидан пок ва муназзаҳ деб олқишлаб турар эканмиз, Сен у ерда (Сенинг амрларингни тутмай) бузғунчилик қиладиган ва қонлар тўкадиган бир инсонни яратурмисан?"-- дедилар. (Аллоҳ эса:) "Шубҳасиз, Мен сизлар билмаган нарсаларни билурман", - деди (2/Бақара, 30).

   """),
    DailyArabicRussianModel(arabic: """
قَالُوا سُبْحَانَكَ لَا عِلْمَ لَنَٓا اِلَّا مَا عَلَّمْتَنَاۜ اِنَّكَ اَنْتَ الْعَل۪يمُ الْحَك۪يمُ ۝    
   """, russian: """
(Фаришталар эса: "Ё Рабби!)  Сен (бутун нуқсон сифатларидан) пок ва муназзаҳсан! Бизда Сен ўргатган илмдан бошқа ҳеч бир билим йўқ. Албатта, (ҳамма нарсани) ҳаққоний билгувчи, ҳукм ва ҳикмат соҳиби (фақат) Сенсан", дедилар (2/Бақара,  32).
   
   """),
    DailyArabicRussianModel(arabic: """   
وَقَالُوا اتَّخَذَ اللّٰهُ وَلَدًاۙ سُبْحَانَهُۜ بَلْ لَهُ مَا فِي السَّمٰوَاتِ وَالْاَرْضِۜ كُلٌّ لَهُ قَانِتُونَ ۝ 
   """, russian: """
   (Яҳудий, насоро ва мушриклар:) " Аллоҳ фарзанд тутди" дедилар (ва кофир бўлдилар. Асло!) У зот бундан пок ва юксакдир. Дарҳақиқат, осмонлардаги ва ердаги бор нарсалар(нинг ҳаммаси) Уникидир, барчаси Унга бўйин эггандир (2/Бақара, 116).
   """),
    DailyArabicRussianModel(arabic: """
   اَلَّذ۪ينَ يَذْكُرُونَ اللّٰهَ قِيَامًا وَقُعُودًا وَعَلٰى جُنُوبِهِمْ وَيَتَفَكَّرُونَ ف۪ي خَلْقِ السَّمٰوَاتِ وَالْاَرْضِۚ رَبَّنَا مَا خَلَقْتَ هٰذَا بَاطِلًاۚ سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ ۝ 
   """, russian: """
   (Баски,) у (ақли салим соҳиби 
бўлган ) кишилар тик турганда,  ўтирганда, ёнбошлаб ётганда Аллоҳни зикр қилурлар, осмонлар ва ернинг яратилиши ҳақида тафаккур қилурлар (ва дерларки:) "Эй Раббимиз! Сен буни беҳуда яратмагансан. Сен (ҳар қандай айбу нуқсондан) пок ва муназзаҳсан, бизни олов азобидан Ўзинг асра!" (3/Оли Имрон,  191).
   """),
    DailyArabicRussianModel(arabic: """   
يَٓا اَهْلَ الْكِتَابِ لَا تَغْلُوا ف۪ي د۪يـنِكُمْ وَلَا تَقُولُوا عَلَى اللّٰهِ اِلَّا الْحَقَّ اِنَّمَا الْمَس۪يحُ ع۪يسَى ابْنُ مَرْيَمَ رَسُولُ اللّٰهِ وَكَلِمَتُهُۚ اَلْقٰيهَٓا اِلٰى مَرْيَمَ وَرُوحٌ مِنْهُۘ فَاٰمِنُوا  بِاللّٰهِ  وَرُسُلِه۪ۚ  وَلَا  تَقُولُوا ثَلٰثَةٌۜ  اِنْتَهُوا خَيْرًا لَكُمْۜ اِنَّمَا اللّٰهُ اِلٰهٌ وَاحِدٌۜ سُبْحَانَهُٓ اَنْ يَكُونَ لَهُ وَلَدٌۢ لَهُ مَا فِي السَّمٰوَاتِ وَمَا فِي الْاَرْضِۜ وَكَفٰى بِاللّٰهِ وَك۪يلًا۟ ۝ 
   """, russian: """
   Эй Аҳли китоб! Динингизда ҳаддан ошманглар. Аллоҳ ҳақида ҳақиқатдан бошқани сўзламанглар. Марям ўғли Ийсо Масиҳ фақат Аллоҳнинг Расули ва Марямга юборган "Бўл!"  деган сўзи(нинг асари)дир ва (Жаброил орқали) Унинг тарафидан (юборилган)  бир руҳдир. Аллоҳга ва унинг расулларига ишонинаглар, "(Аллоҳ) учта" деманглар, ўз фойдангиз учун бунга якун ясанглар. Аллоҳ бир илоҳдир
 У боласи бўлишдан тамоман йироқдир (пок, муназзаҳдир), Унинг шони буюкдир. Осмонларда ва ерда бор нарсалар(нинг ҳаммаси) Уникидир. Вакийл ўлароқ Аллоҳ кифоядир (4/Нисо,  171).

   """),
    DailyArabicRussianModel(arabic: """   
وَلَمَّا جَٓاءَ مُوسٰى لِم۪يقَاتِنَا وَكَلَّمَهُ رَبُّهُۙ قَالَ رَبِّ اَرِن۪ٓي اَنْظُرْ اِلَيْكَۜ قَالَ لَنْ تَرٰين۪ي وَلٰكِنِ انْظُرْ اِلَى الْجَبَلِ فَاِنِ اسْتَقَرَّ مَكَانَهُ فَسَوْفَ تَرٰين۪يۚ فَلَمَّا تَجَلّٰى رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكًّا وَخَرَّ مُوسٰى صَعِقًاۚ فَلَمَّا اَفَاقَ قَالَ سُبْحَانَكَ تُبْتُ اِلَيْكَ وَاَنَا۬ اَوَّلُ الْمُؤْمِن۪ينَ ۝ 
   """, russian: """
Мусо Биз (ибодат учун) белгилаган муддатда келиб, Рабби унга (ҳотифдан, илоҳий, калом ила) сўлаганида (Мусо):
 " Ё Раббим! Менга (Ўзингни) кўрсат, Сенга қарайин", деди. (Аллоҳ:) "(Сен тоқат қилиб дунё кўзи билан) Мени асло кўра олмассан. Лекин тоққа назар сол, агар у ўз  ўрнида қола олса, сен ҳам Мени кўрурсан", деди. Рабби(нинг жамоли) у тоққа тажаллий этганида уни чилпарчин қилиб юборди ва Мусо беҳуш бўлиб ерга йиқилди. Ҳушига келгач: " Сен (ҳар қандай айбу нуқсондан) пок ва муназзаҳсан (Сен буюксан, бу сўзим учун)  Сенга тавба қилдим ва иймон келтирганларнинг биринчисиман!" -- деди (7/Ароф,  143).   
   """),
    DailyArabicRussianModel(arabic: """   
اِتَّخَذُٓوا اَحْبَارَهُمْ وَرُهْبَانَهُمْ اَرْبَابًا مِنْ دُونِ اللّٰهِ وَالْمَس۪يحَ ابْنَ مَرْيَمَۚ وَمَٓا اُمِرُٓوا اِلَّا لِيَعْبُدُٓوا اِلٰـهًا وَاحِدًاۚ لَٓا اِلٰهَ اِلَّا هُوَۜ سُبْحَانَهُ عَمَّا يُشْرِكُونَ ۝ 
   """, russian: """
   Улар Аллоҳни қўйиб, ўз билағонлари (хоҳомлари) ва роҳибларини ҳамда Марям ўғли Масиҳни рабблар (илоҳлар) қилиб олдилар. Ҳолбуки, уларга фақатгина бир Илоҳ  (бўлмиш Аллоҳ)га ибодат қилиш амр эртилгандир. Ундан бошқа ҳеч бир илоҳ йўқ. У зот уларнинг шерик қилган нарсаларидан пок ва олийдир (9/Тавба,  31).
Ҳадиси шарифда, " Аллоҳнинг ҳалол қилган нарсаларини ҳаром қилганларида ва ҳаром қилган нарсаларини ҳалол қилганларида тобеларининг уларга (ўз ихтиёри билан) итоат этиши уларни рабб қилиб олиб, уларга ибодат қилмоқ" эканлигини билдирилган (Табарий, ВИ, жуз 10,  80-81).
   """),
    DailyArabicRussianModel(arabic: """   
قَالُوا اتَّخَذَ اللّٰهُ وَلَدًا سُبْحَانَهُۜ هُوَ الْغَنِيُّ لَهُ مَا فِي السَّمٰوَاتِ وَمَا فِي الْاَرْضِۜ اِنْ عِنْدَكُمْ مِنْ سُلْطَانٍ بِهٰذَاۜ اَتَقُولُونَ عَلَى اللّٰهِ مَا لَا تَعْلَمُونَ ۝ 
   """, russian: """
   (Кофирлар:) "Аллоҳ фарзанд тутди", дедилар. Асло! У Зот бундан пок ва юксакдир. У беҳожатдир (ҳеч нарсага  эҳтиёжи йўқдир). Осмонлардаги ва ердаги бор нарсалар фақат Уникидир. Бу хусусда (болага эга бўлиш борасида) ҳузурингизда ҳеч бир (илмий) далил йўқ. Сизлар Аллоҳ ҳақида билмаган нарсаларингизни гапирасизларми? (10/Юнус, 68).
   """),
    DailyArabicRussianModel(arabic: """
   قُلْ هٰذِه۪ سَب۪يل۪ٓي اَدْعُٓوا اِلَى اللّٰهِ عَلٰى بَص۪يرَةٍ اَنَا۬ وَمَنِ اتَّبَعَن۪يۜ وَسُبْحَانَ اللّٰهِ وَمَٓا اَنَا۬ مِنَ الْمُشْرِك۪ينَ ۝ 
   """, russian: """
   Айтингки: " Мана шу (Аллоҳнинг динига дават) менинг йўлимдир. Мен басират билан (билган ҳолда, ишонган ҳолда ва очиқ далил ила) Аллоҳга дават қилурман ва менга эргашганлар ҳам 
(шундоқдир). Аллоҳ пок ва муназзаҳдир (Уни, ҳар турли айб ва  нуқсонлардан узоқдир, деб тасбиҳ ва танзиҳ этурман). Мен (Аллоҳга) ширк келтиргувчилардан эмасман" (12/Юсуф,  108).
   """),
    DailyArabicRussianModel(arabic: """
   قُلْ هٰذِه۪ سَب۪يل۪ٓي اَدْعُٓوا اِلَى اللّٰهِ عَلٰى بَص۪يرَةٍ اَنَا۬ وَمَنِ اتَّبَعَن۪يۜ وَسُبْحَانَ اللّٰهِ وَمَٓا اَنَا۬ مِنَ الْمُشْرِك۪ينَ ۝ 
   """, russian: """
   Аллоҳнинг (қиёмат ва азоб билан боғлиқ) амри келди; энди уни тезлатишни истаманглар.У зот у (мушрик)ларнинг шерик қилаётган нарсаларидан пок ва муназзаҳ (тамоман йироқ) ва юксакдир (16/Наҳл,  1).
   """),
    DailyArabicRussianModel(arabic: """
   سُبْحَانَ الَّذ۪ٓي اَسْرٰى بِعَبْدِه۪ لَيْلًا مِنَ الْمَسْجِدِ الْحَرَامِ اِلَى الْمَسْجِدِ الْاَقْصَا الَّذ۪ي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ اٰيَاتِنَاۜ اِنَّهُ هُوَ السَّم۪يعُ الْبَص۪يرُ ۝ 
   """, russian: """
   Ўз бандаси (Муҳаммад алайҳиссалом)ни (жасади ила) кечаси Масжиди Ҳаромдан Биз атрофини баракотли қилиб қўйган Масжидни Ақсога олиб бирган Зот (Аллоҳ) шони юксак (ва ҳар турли нуқсонлардан пок)дир. (Буни) унга оятларимиздан бир қисмини кўрсатмоғимиз учун (қилдик). Шубҳасиз, Унинг Ўзи ҳаққоний эшитгувчидир, кўргувчидир ( 17/Исро,  1).
   """),
    DailyArabicRussianModel(arabic: """
   وَيَقُولُونَ سُبْحَانَ رَبِّنَٓا اِنْ كَانَ وَعْدُ رَبِّنَا لَمَفْعُولًا ۝
   """, russian: """
   (Олдин илм берилган - Аҳли китобдан бўлмиш мўминлар:) "Раббимиз пок ба шони юксакдир, шубҳасиз, Раббимизнинг (билдирган ҳар бир) вадаси албатта бажо бўлгувчидир", дерлар (17/Исро, 108).
   """),
    DailyArabicRussianModel(arabic: """
   مَا كَانَ لِلّٰهِ اَنْ يَتَّخِذَ مِنْ وَلَدٍۙ سُبْحَانَهُۜ اِذَا قَضٰٓى اَمْرًا فَاِنَّمَا يَقُولُ لَهُ كُنْ فَيَكُونُۜ ۝ 
   """, russian: """
   Аллоҳнинг бола тутиши (асло) бўлган эмас. У пок ва шони юксакдир  (бундай айб тақашлардан йироқдир). У бит ишга ҳукм қилганида унга фақатгина: "Бўл!" - дер, бас, у (дарҳол) бўлур (17/Марям,  35).
   """),
    DailyArabicRussianModel(arabic: """
   فَاصْبِرْ عَلٰى مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَاۚ وَمِنْ اٰنَٓائِ الَّيْلِ فَسَبِّحْ وَاَطْرَافَ النَّهَارِ لَعَلَّكَ تَرْضٰى ۝ 
   """, russian: """
   У ҳолда (уларнинг) айтаётган нарсаларига сабр қилинг. Қуёш чиқишидан олдин (тонгда) ва ботишидан олдин (аср вақтида) Раббингизда ҳамди ила тасбиҳ айтинг. Кечанинг (белгили) соатларида (шом ва хуфтонда) ҳамда кундузнинг атрофларида (пешинда) ҳам тасбиҳ айтинг (намоз ўқинг), токи (натижадан) рози бўлгайсиз (20/Тоҳо,  130).
   """),
    DailyArabicRussianModel(arabic: """   
يُسَبِّحُونَ الَّيْلَ وَالنَّهَارَ لَا يَفْتُرُونَ ۝ 
   """, russian: """
   Улар (Аллоҳнинг наздидаги фаришталар) кечаю кундуз (нафас олиб, нафас чиқариш каби) орани узмасдан (Унга) тасбиҳ айтурлар (21/Анбиё,  20).
   """),
    DailyArabicRussianModel(arabic: """
   لَوْ كَانَ ف۪يهِمَٓا اٰلِهَةٌ اِلَّا اللّٰهُ لَفَسَدَتَاۚ فَسُبْحَانَ اللّٰهِ رَبِّ الْعَرْشِ عَمَّا يَصِفُونَ ۝ 
   """, russian: """
   Агар у иккисида (осмонларда ва ерда) Аллоҳдан бошқа илоҳлар бўлса эди, албатта, иккиси(нинг бошқаруви ва тартиб-низоми) ҳам бузилиб кетар эди.  Аршнинг Рабби бўлган Аллоҳ улар тўқиб-тақаётган сифатлардан пок-юксак ( ва муназзаҳ)дир (21/Анбиё,  22).
   """),
    DailyArabicRussianModel(arabic: """
   ف۪ي بُيُوتٍ اَذِنَ اللّٰهُ اَنْ تُرْفَعَ وَيُذْكَرَ ف۪يهَا اسْمُهُۙ يُسَبِّحُ لَهُ ف۪يهَا بِالْغُدُوِّ وَالْاٰصَالِۙ ۝ 
   """, russian: """
   (У чироқ) Аллоҳ юксалтирилишига ва Ўз исми зикр қилинишига изн берган уйларда ( ва масжидларда)дирки, у ерда эртаю кеч Унга тасбиҳ айтур(лар) (24/Нур,  36).
   """),
    DailyArabicRussianModel(arabic: """
   اَلَمْ تَرَ اَنَّ اللّٰهَ يُسَبِّحُ لَهُ مَنْ فِي السَّمٰوَاتِ وَالْاَرْضِ وَالطَّيْرُ صَٓافَّاتٍۜ كُلٌّ قَدْ عَلِمَ صَلَاتَهُ وَتَسْب۪يحَهُۜ وَاللّٰهُ عَل۪يمٌ بِمَا يَفْعَلُونَ ۝ 
   """, russian: """
   Ахир, кўрмайсизмики, осмондаги ва ердаги бор жон-жонзот ва ҳавода (қанот қоқиб) учадиган     саф-саф қушлар хоссатан Аллоҳга тасбиҳ айтурлар! Уларнинг ҳар бири ўз дуосини ҳам, тасбиҳини ҳам, муҳаққаҳ, (аниқ) билур. Аллоҳ уларнинг қилаётган ишларини ҳаққоний билгувчидир (24/Нур,  41).
   """),
    DailyArabicRussianModel(arabic: """
   فَسُبْحَانَ اللّٰهِ ح۪ينَ تُمْسُونَ وَح۪ينَ تُصْبِحُونَ ۝ 
   """, russian: """
   У ҳолда, шомга кирган вақтингизда (шом ва хуфтонда) ва тонгда етган вақтингизда (бомдодда) Аллоҳга тасбиҳ айтинглар (намоз ўқинглар) 
(30/Рум,  17).
   """),
    DailyArabicRussianModel(arabic: """
   سُبْحَانَ الَّذ۪ي خَلَقَ الْاَزْوَاجَ كُلَّهَا مِمَّا تُنْبِتُ الْاَرْضُ وَمِنْ اَنْفُسِهِمْ وَمِمَّا لَا يَعْلَمُونَ ۝ 
   """, russian: """
   Ер ундирадиган ҳар нарсадан, у (инсон)ларнинг ўзларидан ва яна улар билмайдиган қанча нарсалардан ҳаммасини жуфт-жуфт қилиб яратган Зот (Аллоҳ) бениҳоят пок (ва шони баҳад олий)дир (36/Ясин,  36).
   """),
    DailyArabicRussianModel(arabic: """
   وَاِنَّا لَنَحْنُ الْمُسَبِّحُونَ ۝ 
   """, russian: """
   (Жаброил фариштага бу сўз айтдирилди: "Аллоҳнинг пок ва муназзаҳ эканлигини олқишлаб, узлюксоз) Унга тасбиҳ айтиб тургувчилар ҳам, албатта, биз (фаришталар)дирмиз" (37/Соффат,  166).
   """),
    DailyArabicRussianModel(arabic: """
   فَاِنِ اسْتَكْبَرُوا فَالَّذ۪ينَ عِنْدَ رَبِّكَ يُسَبِّحُونَ لَهُ بِالَّيْلِ وَالنَّهَارِ وَهُمْ لَا يَسْـَٔمُونَ ۝ 
   """, russian: """
   Агар улар (бази кимсалар, сажда қилишдан) кибрлансалар, (ўз зарарларигадир; билсинларки,) Раббингиз ҳузуридаги зотлар (фаришталар) кечасию кундузи ҳеч малолланмасдан Унга тасбиҳ айтиб турурлар (41/Фуссилат,  38).
   """),
    DailyArabicRussianModel(arabic: """
   سُبْحَانَ رَبِّ السَّمٰوَاتِ وَالْاَرْضِ رَبِّ الْعَرْشِ عَمَّا يَصِفُونَ ۝ 
   """, russian: """
   Осмон ва ернинг Рабби, Аршнинг ҳам Рабби (бўлган Аллоҳ) улар тақаётган сифатлардан пок ва муназзаҳдир (43/Зуҳруф,  82).
   """),
    DailyArabicRussianModel(arabic: """
   لِتُؤْمِنُوا بِاللّٰهِ وَرَسُولِه۪ وَتُعَزِّرُوهُ وَتُوَقِّرُوهُۜ وَتُسَبِّحُوهُ بُكْرَةً وَاَص۪يلًا ۝ 
   """, russian: """
   Бу ( Расулуллоҳнинг бутун инсониятга бир шоҳид, хушхабар берувчи ва огоҳлантирувчи қилиб юборилишлари) эса (сизларнинг)  Аллоҳга ва Унинг Расулига иймон келтирмоғингиз ва Ун(инг Расули)га  ёрдам бермоғингиз, Уни улуғламоғингиз ва эртаю кеч Унга (бениҳоят пок, муназзаҳ ва шони юксак Зот эканини олқишлаб) тасбиҳ айтмоғингиз учундир
 (48/Фатҳ,  9). 
   """),
    DailyArabicRussianModel(arabic: """
   اَمْ لَهُمْ اِلٰهٌ غَيْرُ اللّٰهِۜ سُبْحَانَ اللّٰهِ عَمَّا يُشْرِكُونَ ۝ 
   """, russian: """
   Ёки уларнинг  Аллоҳдан бошқа бир илоҳлари борми (улар билан таскин топиб, Аллоҳга таслим бўлишга интилмасларми)? Аллоҳ уларнинг шерик қилган нарсаларидан пок (ва шони улуғ)дир (52/Тур,   43).
   """),
    DailyArabicRussianModel(arabic: """
   فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظ۪يمِ۟ ۝ 
   """, russian: """
   У ҳолда Раббингизга "Азийм" исми ила тасбиҳ айтинг! (56/Воқеа, 96).
   """),
    DailyArabicRussianModel(arabic: """
   سَبَّحَ لِلّٰهِ مَا فِي السَّمٰوَاتِ وَمَا فِي الْاَرْضِۚ وَهُوَ الْعَز۪يزُ الْحَك۪يمُ ۝ 
   """, russian: """
   Осмонлардаги бор нарсалар ва ердаги бор нарсалар Аллоҳга тасбиҳ айтур (Унинг бениҳоят пок ва муназзаҳ эканини айтиб зикр қилур). У мутлақ ғолибдир, ҳукм ва ҳикмат соҳибидир ( 59/Ҳашр,  1).
   """),
    DailyArabicRussianModel(arabic: """
   يُسَبِّحُ لِلّٰهِ مَا فِي السَّمٰوَاتِ وَمَا فِي الْاَرْضِۚ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُۘ وَهُوَ عَلٰى كُلِّ شَيْءٍ قَد۪يرٌ ۝ 
   """, russian: """
   Осмонлардаги бор нарсалар ва ердаги бор нарсалар(нинг ҳаммаси)  Аллоҳга тасбиҳ айтур ( Унинг беҳад буюк, пок ва муназзаҳ эканини олқишлаб ёд этур). Ҳукмронлик фақат Уникидир, ҳамд фақатгина Унга хосдир. У ҳамма нарсага қодирдур  (64/Тағобун,  1).
   """),
    DailyArabicRussianModel(arabic: """
   قَالَ اَوْسَطُهُمْ اَلَمْ اَقُلْ لَكُمْ لَوْلَا تُسَبِّحُونَ   ۝   قَالُوا سُبْحَانَ رَبِّنَٓا اِنَّا كُنَّا ظَالِم۪ينَ   ۝ 
   """, russian: """
   Уларнинг (боғлари барбод бўлганларнинг) энг инсофлиси: "Мен сизларга; "(Аллоҳга сиғиниб, У зотга) тасбиҳ айтмайсизларми!" -- демаганмидим?" - деди. Улар: "Раббимиз (зулмдан) покдир ва муназзаҳдир ( деб тасбиҳ айтурмиз)! Дарҳақиқат, биз золимлардан эканмиз!" - дедилар  (68/Қалам, 28-29).
   """),
    DailyArabicRussianModel(arabic: """
   وَاِنَّهُ لَحَقُّ الْيَق۪ينِ   ۝   فَسَبِّحْ بِاسْمِ رَبِّكَ الْعَظ۪يمِ   ۝ 
   """, russian: """
   Шубҳасиз, у (Қурон) аниқ ҳақиқатдир. У ҳолда улуғ Раббингиз исми билан тасбиҳ айтинг (айбу нуқсондан пок ва муназзаҳ эканини олқишлаб, ёд этинг) (69/ал-Ҳаққо, 51-52).
   """),
    DailyArabicRussianModel(arabic: """  
وَمِنَ الَّيْلِ فَاسْجُدْ لَهُ وَسَبِّحْهُ لَيْلًا طَو۪يلًا ۝ 
   """, russian: """
   Кечанинг бир қисмида Унга сажда қилинг (шом  ва хуфтон намозларини ўқинг) ва кечаси узун вақт Унга тасбиҳ айтинг (Таҳажжуд намозини ўқинг)  (76/Инсон,  26).
   """),

DailyArabicRussianModel(arabic: """
   سَبِّحِ اسْمَ رَبِّكَ الْاَعْلٰىۙ   ۝   اَلَّذ۪ي خَلَقَ فَسَوّٰىۙ     ۝ 
   """, russian: """
   (Улуғ) Раббингизнинг олий исми билан (ҳар қандай  нуқсон сифатларидан пок ва муназзаҳ эканини олқишлаб) тасбиҳ айтинг ("Субҳана Раббиял-Ало" денг). У (ҳамма нарсани) яратган ва хос низомига солган Зотдир. (87/Ало, 1-2).
   """),

DailyArabicRussianModel(arabic: """   
سُبْحَانَكَ اللّٰهُمَّ وَبِحَمْدِكَ   ۝   أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا أَنْتَ   ۝    أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ    ۝    عَمِلْتُ سُوءًا وَظَلَمْتُ نَفْسِي  ۝   فَاغْفِرْ لِي   ۝   إِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ ۝ 
   """, russian: """
Ҳадиси шарифлар 
     

Аллоҳим! Сенга ҳамдинг ила тасбиҳ айтурман! (Нуқсон сифатларидан пок ва муназзаҳ эканингни олқишлаб ёд этурман!)  Ўзингдан ўзга илоҳ йўқ деб гувоҳлик берурман!  Сендан мағфират тиларман ва  Сенга тавба қилурман!  Мен ёмон иш(лар) қилдим,  ўз  жонимга зулм этдим! Мени мағфират қил! Чунки гуноҳларни мағфират қилгувчи Зот фақат сенсан!     
   """),

DailyArabicRussianModel(arabic: """   
سُبْحَانَ اللّٰهِ وَبِحَمْدِه۪    ۝    لَا قُوَّةَ إِلَّا بِاللّٰهِ   ۝   مَا شَاءَ اللّٰهُ كَانَ وَمَا لَمْ يَشَأْ لَمْ يَكُنْ   ۝   أَعْلَمُ أَنَّ اللّٰهَ عَلٰى كُلِّ شَىْءٍ قَدِيرٌ   ۝   وَأَنَّ اللّٰهَ قَدْ أَحَاطَ بِكُلِّ شَىْءٍ عِلْمًا ۝ 
   """, russian: """
   Ҳамд ва тасбиҳ фақат Аллоҳга хосдир.Аллоҳнинг қувватидан бошқа ҳеч қандай қувват йўқ!  Аллоҳнинг хоҳлагани бўлур,  хоҳламагани бўлмас. Билурманки, Аллоҳ ҳамма нарсага қодирдир ва Аллоҳ Ўз илми билан ҳамма нарсани қамрагандир. 
   """),

DailyArabicRussianModel(arabic: """
   سُبْحَانَ الْمَلِكِ الْقُدُّوسِ ۝
   """, russian: """
   Малик ва Қуддус -- мулкнинг эгаси ва муқаддас Зот (Аллоҳ) пок ва муназзаҳдир!
   """),

DailyArabicRussianModel(arabic: """
   سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلَائِكَةِ وَالرُّوحِ ۝ 
   """, russian: """
   Пок ва муназзаҳсан муқаддассан,  фаришталарнинг ва Руҳнинг  Раббисан!
   """),

DailyArabicRussianModel(arabic: """
   سُبْحَانَ ذِي  الْجَبَرُوتِ  وَالْمَلَكُوتِ  وَالْكِبْرِيَاءِ وَالْعَظَمَةِ ۝ 
   """, russian: """
Жабарут - буюклик эгаси, малакут - мулк, подшоҳлик  эгаси, кибриё - чексиз улуғлик эгаси ва азамат - сўнгсиз буюклик эгаси бўлган Зот (Аллоҳ, бутун нуқсон сифатларидан) пок ва муназзаҳдир!   
   """),

DailyArabicRussianModel(arabic: """
   اَللّٰهُمَّ عَافِنِي فِي بَدَنِي   ۝   اَللّٰهُمَّ عَافِنِي فِي سَمْعِي   ۝   اَللّٰهُمَّ عَافِنِي فِي بَصَرِي   ۝   لَا إِلٰهَ إِلَّا أَنْتَ ۝ 
   """, russian: """
   Аллоҳим! Баданимга офият  (тани сиҳатлик, тинчлик-хотиржамлик) бер! Аллоҳим! Қулоғимга офият - соғлик - омонлик бер! Аллоҳим! Кўзимга офият - соғлик - омонлик бер! Сендан бошқа илоҳ йўқ (фақат Сен борсан)! (3 марта). 
   """),

DailyArabicRussianModel(arabic: """
   اَللّٰهُمَّ  إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ وَالْفَقْرِ  ۝   اَللّٰهُمَّ  إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ   ۝   لَا إِلٰهَ إِلَّا أَنْتَ ۝ 
   """, russian: """
   Аллоҳим! Куфрдан ва камбағалликдан Ўзингдан паноҳ тилайман! Аллоҳим! Қабр азобидан Сендан паноҳ тилайман! Сендан бошқа илоҳ йўқ (фақат Сен борсан)! (3 марта).
   """),

DailyArabicRussianModel(arabic: """
   اَللّٰهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيكَ    ۝    وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِه۪ جَنَّتَكَ   ۝   وَمِنَ الْيَقِينِ مَا تُهَوِّنُ بِه۪ عَلَيْنَا مُصِيبَاتِ الدُّنْيَا   ۝   وَمَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا   ۝   وَاجْعَلْهُ الْوَارِثَ مِنَّا   ۝   وَاجْعَلْ ثَأْرَنَا عَلٰى مَنْ ظَلَمَنَا   ۝    وَانْصُرْنَا عَلٰى مَنْ عَادَانَا   ۝   وَلَا تَجْعَلْ مُصِيبَتَنَا فِي دِينِنَا   ۝   وَلَا تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا   ۝    وَلَا مَبْلَغَ عِلْمِنَا   ۝   وَلَا تُسَلِّطْ عَلَيْنَا مَنْ لَا يَرْحَمُنَا ۝ 
   """, russian: """
   Аллоҳим! Бизга - биз билан гуноҳлар орасини тўсиб турадиган - Ўзингдан қўрқув (ҳиссини) насиб айла! Бизга - бизни жаннатингга етказадиган тоатингни насиб айла!  Бизга дунё мусибатларининг енгил қиладиган яқийн - собит иймон насиб айла!  Бизга берганинг ҳаёт муддатида қулоқларимиздан, кўзларимидан, куч-қувватимиздан (дунё ва охират учун) бизни фойдалантир! Бу фойдаланишни бизларга ворис қил - авлоду зурруётларимизга ҳам насиб айла! Бизга зулм қилганлардан бизнинг қасосимизни ол! Душманларимизга қарши бизга нусрат бер! Динга боғлиқ хусусларда бизга мусибат берма! Дунёни бизнинг энг улкан муродимиз қилма! Илмимизни дунёга хос қилиб қўйма!  Бизга раҳм қилмайдиган кимсаларни бизнинг устимизда мусаллат (куч- қувват эгаси) қилма! 
   """),

DailyArabicRussianModel(arabic: """
   اَللّٰهُمَّ رَحْمَتَكَ أَرْجُو   ۝   فَلَا تَكِلْنِي إِلٰى نَفْسِي طَرْفَةَ عَيْنٍ   ۝   وَأَصْلِحْ لِي شَأْنِي كُلَّهُ   ۝   لَا إِلٰهَ إِلَّا أَنْتَ ۝ 
   """, russian: """
   Аллоҳим! сенинг раҳматингдан умидворман! Бир кўз очиб юмгунчалик муддатда ҳам мени ўз нафсимга ташлаб қўйма! Барча ҳолларимни мен учун ислоҳ қил - тузат! Сендан бошқа илоҳ йўқ (фақат  Сен борсан)!
   """),

DailyArabicRussianModel(arabic: """
اَللّٰهُمَّ مُصَرِّفَ الْقُلُوبِ   ۝   صَرِّفْ قُلُوبَنَا عَلٰى طَاعَتِكَ ۝    
   """, russian: """
   Эй қалбларни тасарруф этгувчи Аллоҳим! Бизнинг қалбларимизни ўз тоатига йўналтир!
   """),

DailyArabicRussianModel(arabic: """   
اَللّٰهُمَّ أَصْلِحْ لِي دِينِيَ الَّذِي هُوَ عِصْمَةُ أَمْرِي   ۝    وَأَصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي    ۝    وَأَصْلِحْ لِي اٰخِرَتِيَ الَّتِي فِيهَا مَعَادِي    ۝    وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ   ۝   وَاجْعَلِ الْمَوْتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ ۝ 
   """, russian: """
   Аллоҳим! Мен учун динимни дуруст қил, у (дин) ишларимнинг исмати - пок сақловчиси,  муҳофизи,  ҳимоячисидир,  мени дўзахдан Жабборнинг ғазабидан асрагувчидир! Мен учун дунёмни дуруст қил, ҳаётим унда кечмоқдадир. Мен учун охиратимни дуруст қил,  қайтишим унгадир. Ҳаётни мен учун ҳар бир ҳайр - яхшилик борасида ортиб бориш (василаси) қил! Ўлимимни ҳам мен учун ҳар турли ёмонликлардан (қутулиб,) роҳатга  эришув  (мақоми)га айлантир!
   """),

DailyArabicRussianModel(arabic: """
   اَللّٰهُمَّ  زِدْنَا وَلَا تَنْقُصْنَا   ۝   وَأَكْرِمْنَا وَلَا تُهِنَّا    ۝    وَأَعْطِنَا وَلَا تَحْرِمْنَا   ۝   وَاٰثِرْنَا وَلَا تُؤْثِرْ عَلَيْنَا   ۝    وَارْضِنَا وَارْضَ عَنَّا ۝ 
   """, russian: """
   Аллоҳим! Бизни (яхшиликда) орттир, бизни (яхшилик бобида) кам қилма! Бизни икромли қил, бизни хор-тубан қилма! Бизга (эҳсонлар) ато қил, бизни маҳрум қилма! Бизни (яхшиликларда) устун қил, (душманларимизни) биздан устун қилма! Аллоҳим! Бизни рози (мамнун) қил, биздан рози бўл!
   """),

DailyArabicRussianModel(arabic: """  
اَللّٰهُمَّ إِنَّا نَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ   ۝   وَنَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ   ۝   وَأَنْتَ الْمُسْتَعَانُ وَعَلَيْكَ الْبَلَاغُ   ۝   وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللّٰهِ ۝
   """, russian: """
   Аллоҳим! Пайғамбаринг  ҳазрати Муҳаммад  (алайҳиссалом) Сендан тилаган нарсаларнинг яхшилигидан биз ҳам Сендан тилаймиз ва пайғамбаринг ҳазрати Муҳаммад (алайҳиссалом) Сендан паноҳ тилаган нарсаларнинг ёмонлигидан биз ҳам Сендан паноҳ тилаймиз! Ёрдам сўраб мурожаат этиладиган ягона даргоҳ Сенсан; охир-оқибат сенга етурмиз. Ҳеч бир куч- қувват ва ҳимоя йўқ, бутун куч-қувват ва ҳимоя фақат Аллоҳдандир!
   """),

DailyArabicRussianModel(arabic: """
   
   """, russian: """
   
   """),

DailyArabicRussianModel(arabic: """
   
   """, russian: """
   
   """),

DailyArabicRussianModel(arabic: """
   
   """, russian: """
   
   """),

DailyArabicRussianModel(arabic: """
   
   """, russian: """
   
   """),


  ],
];
String aboutDua = """
Бисмиллаҳир роҳманир роҳийм. Дуо – руҳий ибодат.
Дуо – банда ва Аллоҳ таоло ўртасидаги хос сирли мулоқот.

Дуо қилиш чоғида осмонга қараш шарт эмас. Чунки Аллоҳ субҳанаҳу ва таоло ҳар жойда ҳозиру нозир. Дуонинг ижобат бўлиши осмонга қарашга боғлиқ, деб ўйламанг. Аллоҳнинг буйруғига таслим бўлиб, хушуъ, хузуъ ила дуо қилишда шундай роҳат борки, У Зотга яқин бўлган вақтимизда ўзимизни бу роҳатлардан маҳрум қилиб қўймайлик.
Роббимиздан бизга раҳм қилишини, гуноҳларимизни кечиришини, тоқатимиз етмайдиган нарсаларни бизга юкламаслигини, ернинг устида ҳам, ернинг остида ҳам, қиёмат куни ҳам бизни муҳофаза этишини, дунё ва охиратда бизга яхшиликлар беришини ҳамда бизни дўзахдан узоқ қилишини умид қилиб, ёлвориб сўраймиз.
Дуо катта ёки кичик, эътиборли шайх ёки оддий одамнинг тилидан бўладими, фарқ қилмайди. Набий соллаллоҳу алайҳи васаллам бир кишининг: «Аллоҳим, Сендан ўзга ибодатга лойиқ ҳеч бир зот йўқ. Ўзинг яккаю ёлғизсан. Сен туғмаган ва туғилмаган ва Сенга ҳеч бир нарса тенг келолмайдиган Улуғ Зотлигингга иймон келтириб сўрайман!..»

деяётганини эшитиб: «Жоним қўлида бўлган Зотга қасамки, у билан дуо қилса, дуоси ижобат бўладиган ва у билан сўраса, бериладиган Аллоҳнинг улуғ исмлари билан сўради», дедилар..
Расуллар имоми соллаллоҳу алайҳи васаллам бизга таълим бериб, дуоси ижобат бўладиган уч тоифа инсонларни зикр қилдилар:
Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:

«Набий соллаллоҳу алайҳи васаллам:

«Уч дуо мустажобдир. Уларда шак йўқ. Ота-онанинг дуоси, мусофирнинг дуоси ва мазлумнинг дуоси», дедилар».
Абу Довуд, Аҳмад ва Термизийлар ривоят қилишган.

Демак, ушбу уч тоифанинг яхши дуосини олишга ҳаракат қилишимиз, уларнинг ёмон дуо қилишларидан қўрқишимиз лозим экан.


«Дуо ибодатдир»

«Дуо ибодатдир». Расулуллоҳ соллаллоҳу алайҳи васаллам дуонинг сирини мана шундай қисқагина жумла билан баён қилдилар.
Қўлингиз, қалбингиз ва умидларингизни осмонга кўтариб, ғурурингиз ва кибрингизни ерга пасайтириб, Буюк Яратувчингиз қаршисида нақадар заиф ва ҳақир инсон эканингизни изҳор этиб, Унга муножот қиласиз.
Инсон ўзидаги табиий ожизлик сабабли қадим-қадим замонлардан буён унинг истакларини қондиришга қодир бўлган бир илоҳга суянади. Ана шу илоҳига яқин бўлиб, ундан ўзи эҳтиёж сезган турли нарсаларни беришини сўрайди, содир бўлишини хоҳламаган нарсаларидан, турли ёмонликлардан эса паноҳ тилайди. Улар бор истак-хоҳишларини, орзу-армонларини, эҳтиёжларини, дуоларини қуёш, ой, олов, бут каби жисмларга айтиб, уларни ўзларига илоҳ қилиб олганларида Аллоҳ уларга тўғри йўлни кўрсатишлари, ибодатни яккаю ягона Зот – Аллоҳ таолога қилиш лозимлигини, дуою илтижоларни ҳам фақат У Зотгина қабул қилишини ўргатишлари учун пайғамбарларни жўнатди. Орадан бир неча минг йиллар ўтиб, хотамул анбиё Муҳаммад соллаллоҳу алайҳи васалламни юбориб, у зотга Қуръонни ваҳий қилди. Аллоҳ таоло Қуръони Кримда шундай марҳамат қилади: «Роббингизга тазарру ила ва махфий дуо қилинг.

Зотан, У ҳаддан ошувчиларни севмас» (Аъроф сураси, 55-оят),
«Роббингиз: «Менга дуо қилинг, сизга ижобат қилурман», деди» (Ғофир сураси, 55-оят). Расулуллоҳ соллаллоҳу алайҳи васалламдан ривоят қилинган ҳадиси қудсийда эса У Зот айтади: «Бандам Мендан сўраса, албатта Мен унга яқинман, агар дуо қилса, дуо қилувчининг дуосини ижобат қиламан».
Термизий, Аҳмад ва Ҳокимлар Абу Ҳурайра розияллоҳу анҳудан ривоят қилган ҳадисда Расулуллоҳ соллаллоҳу алайҳи васаллам дуонинг фазлини баён этиб: «Аллоҳ таолонинг наздида дуодан кўра мукаррамроқ нарса йўқ», деганлар. Балки Аллоҳга дуо қилмаган, У Зотдан ҳожатларини сўрамаган бандасидан ғазабланади. Расулуллоҳ соллаллоҳу алайҳи васаллам бу ҳақда шундай дейдилар: «Ким Аллоҳдан сўрамаса, У Зот ундан ғазабланади».
Қандай дуо қиламиз?

Дуо қилиш учун махсус жой, вақт ва вазият танланмайди. Зотан,
«Аллоҳни турган, ўтирган ва ёнбошлаган ҳолингизда эсланг» (Нисо сураси, 103-оят). Энг муҳими – поклик ва ихлосга риоя қилиш.
Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:

«Расулуллоҳ соллаллоҳу алайҳи васаллам: «Аллоҳнинг ижобатига аниқ ишонган ҳолингизда дуо қилинг. Ва билингки, Аллоҳ ғофил ва беҳудачи қалбдан дуони қабул қилмас», дедилар».
Термизий ва Ҳоким ривоят қилишган.

Дуо қилишда Расулуллоҳ соллаллоҳу алайҳи васаллам биз, умматларига ўргатган асосий қоида шуки, Аллоҳ дуоимизни ижобат қилишига бизда қатъий ишонч бўлиши лозим. У Зот ваъдасига шубҳа қиладиган бандасининг дуосини қабул этмайди.
Нуъмон ибн Башир розияллоҳу анҳудан ривоят қилинади:

«Набий соллаллоҳу алайҳи васаллам:

«Дуо ибодатдир», дедилар ва «Ва Роббингиз: «Менга дуо қилинг, сизга ижобат қилурман. Менинг ибодатимдан кибр қилганлар жаҳаннамга хору зор ҳолларида кирурлар»ни қироат қилдилар».
Термизий ва Абу Довуд ривоят қилишган.

Сўнг худди намоздаги каби қиблага юзланамиз. Ўзимизни Каъбанинг олдида тургандек ҳис қиламиз. Аллоҳ таолонинг ҳузурида ҳақир эканимизни билдириб, хушуъ билан қўлларимизни дуога очамиз.
Салмон розияллоҳу анҳудан ривоят қилинади:

«Набий соллаллоҳу алайҳи васаллам: «Албатта, Роббингиз ҳаёли ва каримдир. У Зот бандаси Унга икки қўлини кўтарса, уларни бўш қайтаришдан ҳаё қилади», дедилар».
Дуонинг аввалида Аллоҳнинг гўзал исмлари билан Унга ҳамду сано, сўнг Набий соллаллоҳу алайҳи васалламга салавот айтиб, кейин дуо қилинади. Дуонинг сўнгида яна такрор Аллоҳ таолога ҳамд, Пайғамбаримизга салавот айтиб, тугатилади.
Инсон кўпчилик ичида дуо қилганида, овоз чиқариб дуо қилади, лекин бунда овозни ҳаддан ташқари кўтариб юбориш, атрофдагиларнинг эътиборини ўзига тортишга ҳаракат қилиш, риё каби иллатлардан узоқ бўлиш лозим.
Абу Мусо розияллоҳу анҳудан ривоят қилинган ҳадиси шарифда шундай дейилади:
«Расулуллоҳ соллаллоҳу алайҳи васаллам бир тепалик ёки довонга чиқа бошладилар. Унинг устига чиқилганда бир киши баланд овоз билан:
«Лаа илааҳа иллаллоҳу, Аллоҳу акбар!» деди.

Расулуллоҳ соллаллоҳу алайҳи васаллам хачирларининг устида туриб:

«Сизлар кар ёки ғойиб Зотга дуо қилаётганларингиз йўқ...»
дедилар».

Банда ёлғиз ўзи дуо қилганида бу дуо у билан Робби ўртасида махфий (сирли) бўлиши учун паст овозда, пичирлаб қилиши жоиз. Лекин бунда ҳам фақат ўзининг эмас, бошқа мусулмонларнинг ҳаққига ҳам дуо қилса, ижобати ҳам оммавий бўлади. Зотан, комил мўмин ўзига яхши кўрган нарсани биродари учун ҳам яхши кўради.
Дуода қатъий туриш ҳам мақтовга сазовордир. Набий соллаллоҳу алайҳи васаллам ўзларининг ҳадиси шарифларида дуосида қатъий турадиганларни Аллоҳ яхши кўришини таъкидлаганлар. Дуони уч марта такрорлаш, охирида «Омин», дейиш унинг одобларидандир. «Омин»нинг

маъноси: «Эй оламлар Робби, ижобат эт!..» деганидир. Кейин Расулуллоҳ соллаллоҳу алайҳи васаллам қилганлари каби кафтларимизни юзимизга сурамиз.


Дуонинг ижобат бўлиш вақтлари

Аллоҳ таоло дуонинг ижобат бўлиш вақти ва ўринларини муайян ва хос турларга ажратиб, бирини бошқасидан афзал қилди. Булар:
–Аллоҳ таоло дунё осмонига тушиб: «Дуо қилувчи борми, ижобат қиламан», дейдиган туннинг охирги учинчи қисми;
–беш вақт намоздан кейинги вақт;

–азон ва иқомат орасидаги вақт;

–намозда ташаҳҳуддан кейинги вақт;

–банданинг Роббига энг яқин бўладиган вақти – саждадаги пайти;

–жума кунидаги ижобат бўладиган соат;

–асрдан кейинги охирги соат;

–арафа кунидаги вақт;

–Рамазон ойидаги вақт;

–жангдаги;

–сафар вақтидаги;

–беморнининг зиёрати вақти;

–ёмғир ёғаётган вақт;

–бирор солиҳ амални қилган вақтдаги дуо. Бу ҳақда Аллоҳ таоло айтади:
«Унга хуш каломлар юксалур ва солиҳ амал кўтарур уни. Дуо яхши сўздандир» (Фотир сураси, 10-оят).


Рамазон ойидаги дуо

Аллоҳга дуо билан юзланишда бу ойга тенглаша оладиган бирор вақт борми? Бу ойда дўзах эшиклари ёпилиб, жаннат эшиклари очилади.
Шайтон занжирланиб, фаришта: «Эй яхшилик истовчи, (бу ойда яхшиликларга) юзлан! Эй ёмонлик истовчи, (бу ойда ёмонликлардан) тўхта!» дея нидо қилади.
Рамазон ойи умумий сифатлари билан дуо қабул бўладиган вақтлардандир. Бу ойда Қадр кечаси бўлиб, у минг ойдан яхшидир. Уни Рамазоннинг охирги ўн кунлигидаги тоқ кечалардан излаймиз. Мўмин банда бу кечада дуо қилса, сўраганидан ҳам яхшироғига ижобат қилинади. Рамазон ойининг ҳар бир кунида ҳам дуо ижобат бўладиган соат бор бўлиб, у Расулуллоҳ соллаллоҳу алайҳи васаллам айтганларидек, ифтор вақтидир: «Рўзадорнинг ифтор вақтида қайтарилмайдиган дуоси бордир».
Дуо қазои қадарни қайтарадими?

Бу кўпчиликни қизиқтирадиган саволлардан биридир: «Агар ҳамма нарсанинг қадари бўлиб, тақдиримиз ёзиб қўйилган экан, нима учун биздан балони кўтаришини ва яхшиликни беришини сўраб дуо қиламиз? Дуо қадарни ўзгартирадими?»
Бу саволга қисқача жавоб қуйидагича: «Дуо аслида қадар чегарасидадир. Бир қадар бошқа қадарнинг кўтарилишига сабаб бўлади ёки бунга бошқа тақдир келишига сабаб бўлади. Умар ибн Хаттоб розияллоҳу анҳу қўл остидаги қўшиннинг Шомга йўл олганини эшитганида, уларга Мадинага қайтишни буюради. Шунда уларга: «Аллоҳнинг қадаридан қочасизми?» дейишади. Умар ибн Хаттоб: «Аллоҳнинг қадаридан Аллоҳнинг қадарига қочаман», деб жавоб берадилар. Дуо бемор учун шифодир. Беморнинг қадарида ёзилган дарди давосиз бўлмайди. Лекин дуо қадарида ёзилган дардининг шифосига сабаб бўлади.»


Набийларнинг дуолари

Пайғамбарлар отаси Иброҳим алайҳиссалом Байтуллоҳни қургач, Аллоҳ таолодан Маккани омонлик шаҳри қилишини, унинг аҳлига кенг ризқ беришини, ундан ва ўғли Исмоилдан қабул қилишини ва фарзандларини Аллоҳга ихлосли уммат қилишини, бу уммат учун авлодларидан Аллоҳнинг оятларини етказиб, ўргатадиган элчилар чиқаришини сўраб дуо қилдилар. Унинг дуосини Аллоҳ таоло қабул этиб, Маккани муқаддас жой қилди,

аҳлини ризқлантирди. Нубувват ва рисолатни Исмоил алайҳиссалом наслидан қилди. Муҳаммад соллаллоҳу алайҳи васаллам: «Мен Иброҳим алайҳиссаломнинг дуосиданман», дер эдилар.
Закариё алайҳиссалом ёши улғайиб, кексайгач, Аллоҳ таолодан фарзанд беришини сўради. Унинг аёли ҳам бепушт эди. Уларга Аллоҳ Яҳё алайҳиссаломни ризқ қилиб берди. «Бас, унга ижобат этдик ва  унга Яҳёни ҳадя этдик ҳамда жуфтини ўнглаб қўйдик» (Анбиё сураси, 90- оят).
Айюб алайҳиссалом эса барча касаллик ва оғриқларга чидаб, юксак сабр намунасини кўрсатди. «Ва Айюбнинг Ўз Роббига нидо қилиб: «Албатта, мени зарар тутди. Сен  раҳмлиларнинг  раҳмлисисан!»  деганини эсла» (Анбиё сураси, 83-оят).
Юнус алайҳиссалом денгиз тубида, кит қорнида Аллоҳга дуо қилган ёлғиз инсондир. Аллоҳ унинг дуосини қабул қилиб, унга нажот берди. Ва бу дуони мусулмонларга фазилат қилиб берди. Кимки Юнус алайҳиссаломнинг дуоси билан дуо қилса, ўша мусулмондаги зарар кетиб, ғам-андуҳи арийди. «Зулматларда туриб: «Сендан ўзга Илоҳ йўқ, Ўзинг поксан! Албатта, мен золимлардан бўлдим», деб нидо қилди. Бас, унга ижобат қилдик. Унга ғамдан нажот бердик. Мўминларга шундай нажот берурмиз» (Анбиё сураси, 87-88-оятлар).
Сулаймон алайҳиссалом Аллоҳдан ундан кейин ҳеч кимга берилмайдиган мулкни сўради. Аллоҳ унинг дуосини қабул қилиб, шамолни, шайтон ва жинларни унга бўйсундириб, қуш ва ҳайвонлар тилини ўргатди.
Юсуф алайҳиссалом Аллоҳдан унга зулм қилган аёлларнинг макр- иғволаридан паноҳ беришини сўради: «У: «Роббим, улар мени чорлаётган нарсадан кўра мен учун зиндон маҳбуброқдир, уларнинг ҳийласини Ўзинг мендан нари қилмасанг, уларга мойил бўлиб, жоҳиллардан бўлиб қоламан», деди. Бас, Робби унга ижобат қилиб, уларнинг ҳийласини ундан нари қилди. Албатта, Унинг Ўзи ўта эшитувчидир, ўта билувчидир» (Юсуф сураси, 33-34-оятлар)
Нуҳ алайҳиссаломнинг қавми у зотнинг узоқ йиллик даъватидан юз ўгириб, унга зулм қилганларида шундай дуо қилди: «Ва Нуҳ деди: «Роббим, ер юзида кофирлардан бирорта қимир этганини қўймагин. Албатта, Сен уларни қўйиб қўйсанг, бандаларингни адаштирадилар ва фожиру кофирдан бошқани туғмаслар.» (Нуҳ сураси, 26-27-оятлар). Аллоҳ унинг

қавмини жазолаб, Нуҳга нажот берди: «Бундан олдин у нидо этганида, унинг нидосига жавоб қилдик ва унга ҳамда унинг аҳлига улуғ ташвишдан нажот бердик» (Анбиё сураси, 76-оят).
Мазлумнинг дуоси

«Мазлумнинг дуосидан қўрқ, у билан Аллоҳнинг ўртасида парда йўқ».
Бу Расулуллоҳ соллаллоҳу алайҳи васалламнинг васиятларидир. Унинг маъноси шуки, агар мўмин банда хоҳ динида, хоҳ ишида зулмга учраса ва Аллоҳга дуо қилса, Аллоҳ унинг дуосини ижобат қилади. Чунки Аллоҳ таол зулмни ёқтирмайди, банданинг бандага зулм қилишини ҳам хоҳламайди, шу боис золимларни яхши кўрмайди. «Албатта, Аллоҳ одамларга ҳеч қандай зулм қилмас ва лекин одамлар ўзларига зулм қилурлар» (Юнус сураси, 44-оят).
Расулуллоҳ соллаллоҳу алайҳи васаллам шундай марҳамат қилганлар:

«Уч тоифанинг дуолари рад қилинмас: рўзадорники, то оғзини очгунича; одил имомники; мазлумнинг дуосини Аллоҳ булутлар узра кўтаради ва унга осмон эшикларини очади. Сўнгра Робб: «Иззатим билан қасамки, сенга кейинроқ бўлса ҳам нусрат берурман», дейди» (Термизий ривоят қилган).
Ғойибдан қилинган дуо

Бир мўмин бошқа биродарининг ҳаққига ёки танимаган кишиси учун унинг йўқлигида яхшилик сўраб дуо қилиши динимизда яхши амаллардан саналади. Бу содиқ дўстнинг риё, шубҳа ва нифоқдан холи ҳолда дуо қилишидир. Бу мўминнинг ўзига яхши кўрганини биродарига ҳам раво кўришидир. Фаришталар унинг дуосига «Омин», деганларида, шунинг мисли ўзига ҳам бўлишини сўрайдилар. Инсон биродари учун дуо қилар экан, Раҳмон Зотнинг фаришталари ушбу дуодаги сўралган нарсани ўзига ҳам сўраб дуо қиладилар. Расулуллоҳ соллаллоҳу алайҳи васаллам ҳадиси шарифларида шундай марҳамат қиладилар:
«Мусулмоннинг ўз биродарига ғойибдан қилган дуоси мустажобдир. Унинг бошида бир муваккал фаришта туради. У ўз биродарига ҳар сафар яхшилик тилаб дуо қилганида муваккал фаришта: «Омин!
Сенга ҳам ўшандоқ бўлсин!» дейди».

Муслим ва Абу Довуд ривоят қилишган.

Нима учун дуо ҳар доим ҳам қабул бўлавермайди?
Ҳар куни Аллоҳ таолонинг ҳузурига миллиардлаб дуолар кўтарилади. Кўпчилигимиз «Нега дуоларим қабул бўлмаяпти?» дея куюниши бор гап. Аввало, дуо қилиш одоблари ва шартларига риоя қилиш даркор.
Қолаверса, ҳар қандай дуонинг ўша заҳотиёқ ижобат қилинмаслигининг қуйидаги бир нечта ҳикматлари бор.
Биринчидан, ҳар кимнинг ҳаёт йўлига алоқадор сабаблар туфайли ҳамма одамларнинг дуоси ижобат бўлиши мумкин бўлмаган нарсадир. Мисол учун, ҳамма бойлик сўрайди. Агар Аллоҳ ҳамма баналарнинг сўровини ижобат қилиб, ҳамма бараварига бойиб кетса, кўпчилик инсонлар туғёнга кетишлари, ер юзи фасодга тўлиши шубҳасиз. Аллоҳ таоло айтади: «Агар Аллоҳ бандаларига ризқни кенг қилиб  қўйса,  албатта,  улар  ер юзида ҳаддан ошиб кетурлар, лекин У Ўзи хоҳлаганига ўлчов билан туширади. Албатта, У Ўз бандаларидан ўта хабардордир, ўта кўриб турувчидир» (Шуро сураси, 27-оят).
Иккинчидан, албатта, инсон дуода яхшиликни сўраб, ёмонликдан паноҳ тилайди. Лекин яхшилик ва ёмонлик доим ҳам инсон тасаввуридагидек бўлмайди. У ўз ўй-хаёлидаги яхшиликни истаб дуо қилади. Аслида эса бу унинг учун ёмонлик бўлиши мумкин. Тақдир унга бир ишни ихтиёр қилса, уни ёмонлик деб ҳисоблайди. Кейин кунлар ўтиб, унинг яхшилик экани аён бўлади. Бу ҳақда Аллоҳ таоло айтади:
«Ажаб эмаски, ёқтирмаган нарсангиз сиз учун яхши бўлса. Ва ажаб эмаски, ёқтирган нарсангиз сиз учун ёмон бўлса. Аллоҳ биладир, сиз эса билмассиз» (Бақара сураси, 216-оят).
Учинчидан, дуо қилган инсоннинг барча ҳолатида унинг дуоси ижобат бўладими-йўқми, барибир унга яхшилик бўлаверади. Агар дуоси амалга ошса, у билан бахтли бўлади. Агар амалга ошмаса, ёки Аллоҳ бу дуони унга келадиган бир ёмонликнинг қайтишига сабаб қилади, ёки уни охирати учун заҳира қилади, ёки бир оз вақтдан сўнг амалга оширади, ёки дуосидан унга охиратини эваз қилади. Буни Расулуллоҳ соллаллоҳу алайҳи васаллам ўз ҳадисларида таъкидлаб айтганлар:

«Ер юзида қай бир мусулмон гуноҳ аралаштирмасдан, қариндошлик алоқасини узмасдан туриб дуо қилса, албатта, Аллоҳ таоло унга ё сўраганини тезда беради, ёки ўшанинг мислича ёмонликни ундан буриб қўяди».
Термизий ривоят қилган.

Тўртинчидан, баъзилар шариат буйруқларини бажармай, қайтариқларидан қайтмай, қалбида Аллоҳга холислик бўлмай, ғофил қалб билан дуо қиладилар. Бу сабаблар унинг дуоси қабул бўлмаслиги учун етарлидир. Саъд ибн Аби Ваққос розияллоҳу анҳу Расулуллоҳ соллаллоҳу алайҳи васалламга: «Дуо қилинг, мен дуоси ижобат бўладиганлардан бўлай», деганида, у зот соллаллоҳу алайҳи васаллам: «Таомингни пок қил, дуоинг қабул бўлади», дедилар» .


Қайтарилган дуолар

Ҳар қандай дуо ҳам яхши бўлавермайди. Инсон ўзига сўрайдими ёки бошқалар учунми, ёмонлик сўраб қилинадиган дуолардан қайтарилган. Аллоҳ таоло бу ҳақда шундай дейди:
«Инсон яхшиликка дуо қилганидек, ёмонликка ҳам дуо қилур. Инсон шошқалоқ бўлгандир» (Исро сураси, 11-оят).
Инсон ғазабланганида отаси, онаси ва фарзандларига ёмон дуо қилиши тўғри бўлмаганидек, зулм кўрганида ёки умидсизликка тушганида ўзига касаллик ёки ўлимни сўраб дуо қилиши ҳам жоиз бўлмайди. Бу борада Расулуллоҳ соллаллоҳу алайҳи васаллам шундай марҳамат қиладилар:
«Ўзингизга, фарзандларингизга ва молингизга қарши дуо қилманг»;
«Ўзига етган зарар сабабли бирортангиз ўзига ўлимни тиламасин. Дуо қилиши зарур бўлган ҳолатда ҳам мана бундай десин:
«Аллоҳим, ҳаёт мен учун хайрли бўлса, мени яшатгин. Агар мен учун ўлимим хайрли бўлса, вафот топтиргин».
Шариатимиза маъсият, гуноҳ ва қариндошлик алоқаларини узиш ҳақидаги дуолардан ҳам қайтарилган. Зеро, бу дуодаги кибрдир. Аллоҳ таоло айтади:
«Роббингизга тазарру ила ва махфий дуо қилинг. Зотан, У ҳаддан ошувчиларни севмас» (Аъроф сураси, 55-оят).

Шунингдек, «Аллоҳим, агар хоҳласанг, мана бундай қил. Агар хоҳласанг...» каби қатъиятсизлик билан қилинадиган дуодан ҳам қайтарилган.
Дуода мустаҳкам бўлинг!

Бугунги кунимизда одатга айланиб қолган ачинарли ҳолатлардан бири – қалблардан дуонинг йўқолишидир. Фақатгина Аллоҳ раҳм қилган зотлар бундан мустасно. Агар бирортаси сизга муаммосини айтса ва сиз унга:
«Дуода мустаҳкам бўлинг», десангиз, унинг фақат қовоқ уйиб, тумшуғи осилиб, умидсизланиб, хўмрайиб қолганини кўрасиз. Гўё сиз унинг шаштини пасайтириб, ҳафсаласини пир қилиб, дардини сариқ чақага олмагандек бўлиб қоласиз. Бизнинг наздимизда дуонинг мартабаси не ҳолга тушиб қолди?! Дуо аслида ибодат эмасмиди?! Ибодат бўлганда ҳам, ибодатларнинг мияси эди-ку! Айнан дуо билан банданинг Роббига яқинлиги, Унга тобелиги, Унинг буюклигига бўйсуниши, Унинг ягона эканига иқрор бўлиши ўлчанар эди-ку!
Асарларда келишича, дуо қилувчилар бу дунёда қабул бўлмаган дуоларининг ажрини охиратда кўрганларида бирорта ҳам дуолари ижобат бўлмаслигини орзу қилиб қолар эканлар.
Мусо ва Ҳорун алайҳимассаломлар Аллоҳга дуо қилганларида, «У Зот:
«Батаҳқиқ, икковингизнинг дуоингиз қабул қилинди. Бас, мустақим туринглар ва билмайдиганларнинг йўлига эргашманглар», деди» ( Юнус сураси, 89-оят).
Ибн Касир айтади: «Мусо дуосининг ижобатини қирқ йилдан кейин кўрди. Дуо қилиб, қирқ йил кутган Аллоҳнинг набийси эди. Бизга нима бўлдики, дуо қилганимиздан қирқ кун ўтмасидан, «Дуойимиз қабул бўлмади», дейишни бошлаймиз.»
«Саҳиҳи Бухорий»да келтирилган Абу Ҳурайра розияллоҳу анҳудан ривоят қилинган ҳадисда Расулуллоҳ соллаллоҳу алайҳи васаллам: «Сизлардан дуо қилгач, «Дуо қилдим, дуойим қабул бўлмаяпти», деб шошмайдиган кишининг дуоси қабул  бўлади.  Аллоҳга  дуо қилинглар ва шикоят қилиб, «Дуойим ижобат бўлмади, дуойим қабул бўлмади», деманглар», деганлар.
Биз дуо қилар эканмиз, юқорида айтиб ўтилган дуонинг қабул бўлиш сабабларини тўлалигича юзага чиқаришимиз лозим. Дуоларни қабул қилиб, ижобат этиш эса Аллоҳ субҳанаҳу ва таолонинг Ўз хоҳиш-истагига, иродасига боғлиқдир.

Ақл-идрокимизни тараққий эттириб, зеҳнимизни чархлайлик, шунда қалбларимизда иймонни топамиз ва Аллоҳнинг афви ва раҳматидан умид қилиб, ижобат бўлишига ишониб дуо қиламиз. Кундалик дуоларни ҳаётимизга татбиқ қилайлик ва мустажоб вақтлардан фойдаланиб қолайлик. Биз ҳоким ёки амир, ёки вазирдан сўрамаяпмиз, балки осмону ернинг Яратувчиси, подшоҳларнинг Подшоҳига дуо қиляпмиз.
Бандага суяниб, ундан умид қиламиз, лекин ана шу банданинг Роббини унутиб қўямиз?! Бундай ҳолга тушишдан, Аллоҳ билан бизнинг ўртамизга тушиб, бизга фойда ҳам, зарар ҳам беролмайдиганларга суянишдан У Зотнинг Ўзи сақласин. Бизга ҳечбир банда ёрдам беролмайди. Бу ҳақда Аллоҳ таоло расулимиз Муҳаммад соллаллоҳу алайҳи васалламга шундай дейди:
«Қачон бандаларим сендан Мен ҳақимда сўрасалар, бас, албатта, Мен яқиндирман. Дуо қилувчи Менга дуо қилганда, дуосини ижобат қилурман» (Бақара сураси, 186-оят).
Мазкур ояти каримани маҳкам ушлаб, унга амал қилайлик. Аллоҳ таоло яна марҳамат қилади:
«Ҳақиқий дуо Унгагинадир. Ундан ўзгага дуо қилаётганларга эса ҳеч бир нарсада ижобат этмаслар. Магар, икки кафтини сувга узатиб, сув оғзига етишини кутган одамга ўхшарлар. Ҳолбуки, у унга етувчи эмас. Кофирларнинг дуоси фақат йўқотишдадир» (Раъд сураси, 14-оят).
Ёлғиз Аллоҳга муножот қилинг. Унинг гўзал исмлари билан сўранг:

«Энг гўзал исмлар Аллоҳникидир. Бас, Унга улар ила дуо қилинг ва Унинг исмларида оғадиганларни тек қўяверинг. Тезда қилган амалларининг жазосини олурлар» (Аъроф сураси, 180-оят).
Агар ризқ хоҳласангиз: «Ё Раззоқ, ризқлантир», денг... Агар мол-мулк хоҳласангиз: «Ё Ғаний, бой қилгин», денг...
Агар кечиришини хоҳласангиз: «Ё Ғофур, кечиргин», денг... Агар раҳматини хоҳласангиз: «Ё Раҳмон, раҳм қил», денг... Агар илмни хоҳласангиз: «Ё Алийм, билдиргин», денг...

Агар дуойингиз Расулуллоҳ соллаллоҳу алайҳи васалламдан ворид бўлганига кўра бўлса, сизни табриклайман. Фақат ўзингиз учун сўраб қиладиган дуоларингизда ёмонлик йўқдир, фақат дуойингизда ҳаром бўлишидан ёки Аллоҳга қарши боришдан эҳтиёт бўлинг.
Шайхулислом Ибн Таймия айтади: «Инсонга шу пайтгача айтиб келинаётган дуолар билан дуо қилиш машруъдир. Дуо энг афзал ибодатлардандир. Аллоҳ бизни дуо қилмасликдан қайтарди. Бошқа ибодатларимиздаги каби дуода ҳам шариат ва суннатга эргашиш лозим. Машруъ бўлган дуода бошқалар учун ҳам адолат бўлади. Бунда энг яхшиси комиллик ва афзалликни ўтказиб юбормаслик ва мана шу набавий дуодир. Бу дуо баъзи шайхларнинг айтганидек эмас, балки мусулмонларнинг иттифоқи билан афзал ва комилдир. Қандай қилиб дуонинг айни ўзи хато, гуноҳ ёки яна бошқа нарса бўлиши мумкин?!»
Шайх Али Хузайфий айтади: «Дуонинг ҳақиқати – дунёвий ва ухровий ҳожатларни сўрашда, қийинчиликларни ечишда, дунё ва охират ёмонликларини кетказишда Аллоҳга қаттиқ боғланишдир».
Ибн Қайюм раҳимаҳуллоҳ айтади: «Дуо энг фойдали дорилардандир. Дуо касалликнинг душманидир, уни даф қилади, тузатади, касалликнинг олдини олади, агар касаллик келса, уни кўтаради ёки енгил ўтказади. Дуо мўминнинг қуролидир».
Гоҳида кўча-кўйда, касалхоналарда оғир беморлар ичида баъзи худбинларни ҳам кўрамиз. Бу кабиларнинг васфи қуйидаги оятда ҳам келган:
«Қачонки инсонга зарар етса, ёнбошлаган, ўтирган ёки турган ҳолида Бизга дуо қиладир. Ундан зарарини кетказсак, худди ўзига етган зарар ҳақида Бизга дуо қилмагандек, кетаверадир. Ҳаддидан ошганларга қилаётган амаллари ана шундай чиройли кўрсатилди» ( Юнус сураси, 12-оят).
Оғир кунда қолган инсон, ким бўлишидан қатъи назар, ёнбошлаган, ўтирган ёки тик турган ҳолида, яъни ҳар қандай ҳолатда Аллоҳга ёлворишни бошлайди. Ҳатто энг катта кофир, фосиқлар ҳаётида ҳам бундай воқеалар рўй берганига тарихда мисоллар кўп. Турли мусибатлардан кейин дин йўлига кирганларнинг кўплиги ҳам шу ҳолга далил. Аммо, афсуски, кўплар бундан ўзига яраша хулоса чиқариб олмайди. Бошига мусибат тушганда Аллоҳга ёлворади-ю,

«Ундан зарарини кетказсак, худди ўзига етган зарар ҳақида Бизга дуо қилмагандек, кетаверадир».
Иймонимиз зиёда бўлишига ҳаракат қилайлик ва юқорида ўрганганларимиз – Мусо, Ҳорун, Закариё алайҳимуссалом ва Набийимиз соллаллоҳу алайҳи васалламнинг дуоларини намозларимизда қўллайлик. Расуллар Аллоҳга энг комил таслим бўлган бандалардир. Иброҳим алайҳиссалом:
«Роббим, мени ва зурриётларимни намозни тўкис адо этадиганлардан қилгин. Роббимиз, дуони қабул этгин» (Иброҳим сураси, 40-оят), дея дуоларини қабул қилишини сўраб Аллоҳга ёлворганида биз У Зотдан сўрамасак, ҳолимиз қандай бўларкин?!
Ёрдамчимиз ва ёлғиз мавломиз бўлган Роббимиздан сўрамасак, зарар кўрувчилардан бўлиб қолишимиз шубҳасиз.
Абу Ҳурайра розияллоҳу анҳу Набий соллаллоҳу алайҳи васалламдан ривоят қилиб айтадилар:
«Дуодан бошқа ҳеч нарса Аллоҳга қадрли эмасдир» (Имом Термизий ривоят қилган).
Билингки, амалларнинг қабул бўлишидаги асл таянч ихлосдир. Қалбингизни тайёрламасдан, бўш қалб ила ёдлаб олган сўзларингизни такрор-такрор айтиб дуо қилманг. Аксинча,
«Бас, агар кофирлар ёқтирмасалар ҳам, Аллоҳга динни холис қилган ҳолингизда илтижо қилинг» (Ғофир сураси, 14-оят).
Имом Нававий айтади: «Аллоҳ субҳанаҳу ва таоло дунёга шўнғиган, Мавлоси билан бирга бўлиш ҳузуридан ғофил бандасининг дуосига ҳам беэътибор эмас. Дуога эътибор ва жидду жаҳд дуонинг улуғ одобларидандир».
Фахриддин Розийдан ривоят қилинади: «Уммат: «Ихлоссиз, тил учида қилинган дуоларнинг фойдаси кам ва таъсири йўқ», деб ижмоъ қилдилар».
Имом Нававий айтади: «Билгинки, дуодан мақсад – қалб роҳатидир. Бунга далил чексиз кўпдир».
Имом Байҳақий айтади: «Дуонинг қисмлари бордир. Улар – ҳақиқий жидду жаҳд билан сўраш, ижодий ишларда дуони иқтибос қилиб олмаслик. Ва бу

ҳақиқатда ғофилликдир».

«Роббингиз: «Менга дуо қилинг, сизга ижобат қилурман…» деди» ( Ғофир сураси, 60-оят) оятини Абу Бакр Шалабий: «Менга ғафлатсиз дуо қилинг, сизга муҳлатсиз ижобат қилурман», дея тафсир қилар эканлар.
Ибн Ражаб Ҳанбалий айтади: «Дуонинг ижобат бўлишини тақозо этадиган сабаблар – унинг шартларини комил қилиш билан бирга уларни бажаришдаги тўсиқларни ҳам олишдир. Дуо қабул бўлишининг катта шартларидан бири – қалб ҳозирлиги ва унинг ижобат бўлишини Аллоҳдан умид қилишдир. Шуни яхши билишимиз лозимки, яна егуликларнинг ҳалол бўлиши, гуноҳлар ва ёмон ишларни тарк қилиш, солиҳ амалларни кўпайтириш ҳам дуонинг қабул бўлиш сабабларидандир».
Хўш, дуонинг шунча қийматга эгалигини билгандан кейин ҳам уни камайтириш ёки дангасалик билан унутишда давом этамизми?!
Шуни яхши билайликки, дуонинг ўзи кифоя қилмайди, балки унинг қабул бўлиш сабаблари билан бирга амалларини ҳам бажаришимиз керак.
Аллоҳ таолодан ҳар қандай ҳолатимизда ҳам бу ибодатга қоим қилишини сўраймиз. Аллоҳга туннинг охирги учдан бирида, азон ва иқомат орасида, жума куни қуёш ботишидан олдин, ёмғир ёғаётганда, енгилликда ва оғир пайтда, сафарда ва муқимликда –дуолар ижобат бўладиган барча фурсатларда дуо қилайлик.
Қалбимиз ва тилимизни дуога ўргатайлик!...

Ҳумайро тайёрлади.

""";
String aboutAvrod = """
Бисмиллаҳир роҳманир роҳийм
Аллоҳ таолога сўзсиз хамду санолар, хазрати Расулуллоҳга чексиз салоту саломлар бўлсин.
    Ушбу авроди шариф ер юзидаги энг шарафли энг ишончли дуо китобларидан ҳисобланади. Чунки у мйқаддас Қуръони карим оятлари ва энг саҳиҳ хадиси шарифлар асосида тузилган. 
"Аврод" - "вирд" сўзининг кўплиги бўлиб, хар кун, доимий бажариб туриладиган вазифалар, дуолар деган маънони билдиради.
 Ушбу Аврод қадимий тарихга эгадур. Уни, дастлаб, Муҳаммад ибн Усома ( Усома ибн Зайд розияллоҳу анҳунинг ўғиллари ) Исфахон шаҳрида тасниф этганлар. Таснифнинг ягона ва нодир қўлёзма нусхаси П-2177 рақами, ягона тошбосма нусхаси, Л 23240 - рақами остида "Авроди Қуръония"/" Жавоҳир ул-Қурон деган ном билан Ўзбекистон фанлар академияси Абу Райхон Беруний номидаги Шарқшунослик институти қўлёзмалар ҳазинасида сақланади (46-54 саҳифалар). Китоб Бухорода хижрий 1295, милодий 1878 йилда Амир Аркининг қорийси ва хаттоти Қорий Абдурраҳийм томонидан кўчирилган. (" Қашф уз-зунун" китобида бу тасниф "Ал-авроди саба" (" Етти кунлик видрлар ") деб аталиб, мусанниф аш-шайх аз-зоҳид Мухйиддин ибн Усома дейилган.) 
  Нақлга кўра, Муҳаммад ибн Усома бир вақт Ажам ( Исфахон шаҳри)да этиқоди бузуқ бир қавмнинг қўлига асир тушиб қоладилар. У кишини хибс этишади. Шунда у киши хазрати Пайғамбаримиз соллолоҳу алайҳи ва салламни тушида кўрадилар. Хазрати Росулуллоҳ; " Эй Ибн Усома! Бу холингдан ғамгин бўлма! Туриб, Мусхаф (Қуръонни карим)дан ҳафтанинг етти куни учун етти вирд (вазифа ва дуолар ) чиқаргин!" дейдилар.  Ибн усома етти кун учун Қуръондан гулчин қилиб, ушбу видрларни чиқарадилар ва уни ўқиб, хибсдан халос бўладилар: 
1) Жума куни учун хамду сано оятлари; 
2) Шанба куни учун тавба-истиғфор оятлари; 
3) Якшанба куни учун тасбех оятлари; 
4) Душанба куни учун таваккул ва ҳифзу ҳимоят оятлари; 
5) Сешанба куни учун саломат ва шифо оятлари; 
6) Чоршанба куни учун таҳлил ("Ла илаҳа иллаллоҳ") оятлари; 
7) Пайшанба куни учун дуо оятлари

""";

List<PoemModel> poems = [
  PoemModel(poem: """Охират йўлида йўлдош излагил,
Ҳоли дилинг учун ҳолдош излагил.
Умрингни то хазон бўлмасин десанг,
Ёстиқдош излама, дилдош излагил.
  """),
  PoemModel(poem: """Фироқдан титраса тоғлар, йиғлама,
Йиғлаб хазон тўкса боғлар, йиғлама.
Аллоҳ учун мажнун, бемор, зор бўлсанг,
Тегрангда бор экан соғлар, йиғлама.
  """),
  PoemModel(poem: """Айрилиқ азобин найдан билурсан,
Бир висол қувончин тўйдан билурсан.
Модом ўз қалбингдан бехабар бўлсанг,
Ўзгалар қалбини қайдан билурсан?!
  """),
  PoemModel(poem: """ 
Дардингни ўз дилин тиғлаган билур,
Дарду ғамин пинҳон сақлаган билур.
Ҳолингни дунёда кулганлар билмас,
Кеча зулматида йиғлаган билур.
  """),
  PoemModel(poem: """Кетмагил, гар кетсанг, фарзона кетгил,
Мажнундек бўлиб чин афсона, кетгил.
Нур бўлиб яшагил, Ҳақ ҳузурига
Бир кун кетар бўлсанг, мардона кетгил.
  """),
  PoemModel(poem: """Ҳар қаҳат, очликнинг бордир адоғи,
Пурхўрлик, маишат – киборлар доғи.
Очликдан ўлганнинг саноғи бордир,
Тўқликдан ўлганнинг йўқдир саноғи!..  
  """),
  PoemModel(poem: """Дўст, майли, туҳмат қил, ҳақорат қилгин, 
Тангрим, сен сабрга ишорат қилгин. 
Қалбимга урилган ҳар бир озорни 
Бирор гуноҳимга  каффорат қилгин.
  """),
  PoemModel(poem: """Ватан деб қон ютган қалблар, ҳалаксиз,
Асл макондан ҳам қолманг дараксиз: 
«Аллоҳдан қўрқингиз ва билинг, шаксиз, 
Унинг ҳузурида тўпланажаксиз!»
   """),
  PoemModel(poem: """Элдошлар минг бўлса, турли тарафлик,
Кўнгиллар бир бўлса – бир хил ҳадафлик.
Дунёда қалбимни йиғлатган, эй ғам,
Содиқ ёр топмадим сендан шарафлик.  
  """),
  PoemModel(poem: """Қуёш йўқ ғарб билан шарқнинг ҳукмида,
Ой йўқ осмон деган тахтнинг ҳукмида.
Ой, қуёш, коинот: замину само,
Жонлар ҳам, қалблар ҳам – Ҳақнинг ҳукмида!  
  """),
  PoemModel(poem: """Адолат деб ўлдим заҳархандадан, 
Сас чиқди мен бошим қўйган кундадан: 
Мавҳумни ахтариб хор бўлган эй зот, 
Адолат тиланма ҳаргиз бандадан! 
  """),

PoemModel(poem: """Раббим, умидимни барбод айлама,
Бу ношод кўнглимни ношод айлама.
Қалбга нидо келди: «Гар ошиқ бўлсанг,
Минг жафо кўрсанг ҳам, фарёд айлама!»  
  """),

PoemModel(poem: """Дунёда сир борки, сочма-соч дунё,
Қорни тўқ, усти бут, кўзи оч дунё.
Азал орифларнинг кўзи ўнгида
Кийимлари қат-қат – яланғоч дунё!  
  """),

PoemModel(poem: """Элдошлар минг бўлса, турли тарафлик,
Кўнгиллар бир бўлса – бир хил ҳадафлик.
Дунёда қалбимни йиғлатган, эй ғам,
Содиқ ёр топмадим сендан шарафлик.
    """),

PoemModel(poem: """
Қуёш йўқ ғарб билан шарқнинг ҳукмида,
Ой йўқ осмон деган тахтнинг ҳукмида.
Ой, қуёш, коинот: замину само,
Жонлар ҳам, қалблар ҳам – Ҳақнинг ҳукмида!  
  """),

  PoemModel(poem: """Адолат деб ўлдим заҳархандадан, 
Сас чиқди мен бошим қўйган кундадан: 
Мавҳумни ахтариб хор бўлган эй зот, 
Адолат тиланма ҳаргиз бандадан!
  """),

  PoemModel(poem: """Раббим, умидимни барбод айлама,
Бу ношод кўнглимни ношод айлама.
Қалбга нидо келди: «Гар ошиқ бўлсанг,
Минг жафо кўрсанг ҳам, фарёд айлама!»
  """),
  PoemModel(poem: """Дунёда сир борки, сочма-соч дунё,
Қорни тўқ, усти бут, кўзи оч дунё.
Азал орифларнинг кўзи ўнгида
Кийимлари қат-қат – яланғоч дунё!
  """)

];